{
  "layout": "blog",
  "date": "2022-04-20T22:48:17.455Z",
  "body": "> *(Image Source: @CAF_Online)*\n\nEthiopia has been allotted to qualification Group C for next year’s AFCON that will take place in Côte d'Ivoire. The draw, which took place on Tuesday, April 19th in South Africa, also pitted the Walias against Guinea and Malawi in the qualifying group. All four teams qualified for the latest AFCON tournament in Cameroon.\n\n\n\nThe Walias’ tough draw is down in large part to being placed in pot four of the draw which was determined by the latest FIFA rankings and not by performances in previous editions of the African Cup of Nations. \n\n\n\nThe draw makes clear that Webetu Abate's side will have to be in top form to qualify for back-to-back AFCON tournaments. This qualification group will be tricky as it includes Egypt, seven-time AFCON Champions, as well as Guinea and Malawi, both of which advanced to the last 16 at the African Cup of Nations in Cameroon earlier this year. Fans will be heartened, however, as Ethiopia’s qualification group from last year was not easy either: it featured African giants Côte d'Ivoire as well as Madagascar, who had made the quarter-finals of the 2019 edition of the tournament.\n\n\n\nHost country Côte d'Ivoire will compete in the qualifiers as well. If Côte d'Ivoire fails to finish first or second in its group, the lowest-performing national team from the other 11 qualification groups will be replaced by the host country to fulfill the guaranteed spot for hosting the competition.\n\n\n\nCAF, which has been criticized in the past for having a habit of eye-brow raising decision-making, has made another interesting decision by allowing Kenya and Zimbabwe to participate in the draw. This decision was made despite their suspension from international football by FIFA. If neither country's suspension is lifted two weeks before the qualifiers begin, they will be eliminated, and their respective groups will be reduced to three teams.\n\n\n\nQualifying will begin on May 30 with two matches, followed by two more on June 14th. More games will be played in September, with the final set of games taking place in March of the following year. In due course, the CAF will announce the dates and schedule of fixtures. Ivory Coast will host the 2023 Nations Cup in June and July next year.\n\n\n\n<!--EndFragment-->",
  "title": "2023 AFCON Qualifiers: Walias drawn in Group C with Egypt ",
  "slug": "2023-afcon-qualifiers-walias-drawn-in-group-c-with-egypt",
  "author": "Ebawak Tesfaye @negussu_",
  "thumbnail": "/images/uploads/afcon-qualifying-2023-draw.jpg"
}