{
  "layout": "blog",
  "date": "2022-10-13T04:22:36.462Z",
  "author": "Blue Nile Sport",
  "title": "Asrat Megersa Caught the Eyes of Rory Smith ",
  "thumbnail": "/images/uploads/my-project-copy-1.png",
  "body": "It was the No. 8 who first caught the eye. He was tall, languid, just on the border between rangy and ungainly. It was not the way he moved, so much, but the way he did not. In the middle of all the bustle and hurry, he was unusually still. He did not sprint. He did not dash. He did not even run, not really. He strolled. He meandered. He moseyed.\\\n\\\nHe was playing in midfield, but he did not look much like a central midfielder. There are, in modern soccer, precisely three acceptable profiles of central midfielder: slight and inventive; dynamic and industrious; physically imposing.\\\n\\\nThe No. 8 was none of them. He towered over almost everyone who drew close, but he was slender, almost fragile. In another world, he might have been a mercurial playmaker who refused to leave his local team — Robin Friday or Tomás Carlovich — but, while his technique was flawless, his energy was not especially chaotic, particularly magical.\n\n![](/images/uploads/asrat-megersa-recalled.jpg \"Asrat Megersa (right) battling with John Obi Mikel of Nigeria\")\n\n``\\\n\\\nBut the No. 8 was, in theory, the team’s defensive linchpin. And yet he did not throw himself into tackles or busily chase down opponents. He played simple, unwaveringly accurate passes, and then he stood all but still, waiting for the game to come back his way.\\\n\\\nTo an eye raised on watching European soccer, with its blend of tactical influences and its faintly South American inflection, the initial assumption was that he was not following instructions. But he was. Or, at least, he seemed to be. He was there to occupy space, to act as a fixed point, an anchor. He did it well. It worked, too.\\\n\\\nHis name was Asrat Megersa, and he was, in 2013, a 25-year-old playing in midfield for Ethiopia in its first Africa Cup of Nations in three decades.\n\n\n\n![](https://www.nytimes.com/2022/01/07/sports/soccer/africa-cup-of-nations.html \"Source\")",
  "slug": "a"
}