{
  "layout": "blog",
  "date": "2022-08-24T23:11:34.812Z",
  "body": "የኢትዮጲያ እግር ኳስ ብሔራዊ ቡድን ዋልያዎቹ ለቻን የአፍሪካ ዋንጫ ለማለፍ የመጨረሻውን የማጣሪያ ጨዋታ ከሩዋንዳ ብሔራዊ ቡድን ጋር ለማድረግ ወደ ታንዛንያ አቅንተዋል። \n\nበሀገር ውስጥ ሊጎች ውስጥ በሚጫወቱ ተጫዋቾች ብቻ የሚካሔደው የቻን አፍሪካ ዋንጫ ፤ ዘንድሮ በአልጄሪያ አስተናጋጅነት የሚካሔድ ይሆናል። የኢትዮጲያ ብሔራዊ ቡድን ለማለፍ የቀረው የ 180 ደቂቃ ጨዋታዎች ብቻ ነው። የመጀመሪያው ጨዋታውን ነሐሴ 20 በታንዛኒያ ቤንጃሚን ምካፓ ስታዲየም ላይ ከሩዋንዳ ጋር ይደረጋል። ለጨዋታው በአዳማ ዝግጅታቸውን ሲያደርጉ የነበሩት ዋልያዎቹ ሁለት የአቋም መለኪያ ጨዋታዎችን አድርገዋል። ሀ‍ለቱንም ጨዋታዎች ከዩጋንዳ ብሔራዊ ቡድን ጋር ያደረጉት ዋልያዎቹ በመጀመሪያው ጨዋታ በበዛብህ መለዮ ብቸኛ ጎል 1-0 አሸንፈው  በቀጣዩ ጨዋታ ቡደኑ 0-0 በሆነ አቻ ውጤት ጨዋታውን አጠናቋል።\n\n![](/images/uploads/img-20220824-wa0004.jpg)\n\nበቅድመ ማጣሪያው ከደቡብ ሱዳንን ጋር የተደለደሉት ዋልያዎቹ  5-0 በሆነ ሰፊ የደርሶ መልስ የድምር ውጤት አሸንፈው ለቀጣዩ ዙር ሩዋንዳ ለመጫወት ተደልድለዋል።\n\nየዋልያዎቹ አሰልጣኝ  ውበቱ አባተ በኢትዮጲያ እግር ኳስ ፌዴሬሽን ጽህፈት ቤት ስለማጣሪያ ጨዋታዎቹ ጋዜጣዊ መግለጫ ላይ ለአሰልጣኝ  ውበቱ ከBLUENILESPORT.COM ጥያቄዎችን ተጠየቀው ነበር። \n\n![](/images/uploads/img-20220824-wa0000.jpg)\n\nበመጀመሪያው የማጣሪያ ጨዋታ ላይ ስለታዩት ክፍተቶች?\n\n“አንደኛ ተጫዋቾቹ አጭር የእረፍት ጊዜ ነው የነበራቸው። ሁለተኛ ደግሞ የተጫዋቾች የዝውውር ወቅት ስለነበር ቀጣይ ማረፊያቸውን ለማወቅ ትንሽ የተጨናነቀ ሳምንት ነበር ሲያሳልፉ የነበረው። ተጫዋቾቹ ከተለያዩ ክለቦች ጋር ግንኙነት ፈጥረው ውሳኔ ለማግኘት ሲሄዱ ነበር። ይህ አድካሚ ነገር ነበረው። በአምሮም ሆነ በአካል የዛሉበት ሁኔታ እና ሙሉ ለሙሉ ትኩረት መስጠት የቻሉበት ሁኔታ እንዳልነበር ቀደም ብዬ ገልጬ ነበር። ይሄ ጨዋታው ላይ ተፅዕኖ አልፈጠረም ማለት አይቻልም። በተወሰነ ደረጃ ተፅዕኖ ፈጥሮብናል።ሌላው የመጀመሪያውን ጨዋታ ከባድ የሚያደርገው ነገር ስለ ደቡብ ሱዳን መረጃዎች ማግኘት ቢቻልም ቻን ላይ የሚመጣውን የደቡብ ሱዳን ቡድን ማወቅ አለመቻል ነው።\n\nስለ ቻን ማጣሪያ ጨዋታዎች?\n\n”ሁላችሁም እንደተከታተላችሁት ሁለት የደርሶ መልስ ጨዋታን ታንዛኒያ ላይ ከደቡብ ሱዳን ጋር አድርገናል። በመጀመሪያው ጨዋታ ተጋጣሚያችን ጠንካራ የሆነ መከላከል፣ የአንድ ለአንድ ጨዋታዎች እና ክፍተቶችን ያለመስጠት እንዲሁም ሀይል የተቀላቀለበት ጨዋታ መርጠው የቀረቡበት ነበር።። ከቀናት በኋላ ግን በመጀመሪያው ጨዋታ ያየነውን ክፍተት ታሳቢ በማድረግ ለመዘጋጀት ሙከራ አድርገናል። እነሱ በሁለተኛውም ጨዋታ በተመሳሳይ አቀራረብ አልፎ አልፎ በመልሶ ማጥቃት ለመምጣት እና ጫና ለመፍጠት ከመሞከር ውጪ ብዙ የከበደን ነገር አልነበራቸውም። በተሻለ ጨዋታውን መቆጣጠር እና ግቦችን ማስቆጠር ለእኛ ቡድን ከባድ አልነበረም። ይህንንም ተከትሎ በሰፊ ብልጫ 5ለ0 ማሸነፍ ችለን ወደ ቀጣዩ ዙር አልፈናል። ከመጀመሪያው ጨዋታ አንፃር የሁለተኛው ጨዋታ በሁሉም የጨዋታ ክፍሎች ላይ መሻሻል የታየበት ነበር። ጨዋታውን አሸንፎ ለመውጣትም የነበረን ቁርጠኝነት የተሻለ ነበር። በቀጣይ ከሩዋንዳ ጋር የምንጫወት ይሆናል። ለዚህም ጨዋታ ትኩረታችንን ሰጥተን ዝግጅታችንን እንጀምራለን።”……በማለት በርከት ካሉት ጥያቄዎች መካከል መልሶችን ሰጥተዋል። \n\n![](/images/uploads/img-20220824-wa0002.jpg)\n\nበአዳማ ሳይንስ እና ቴክኖሎጂ  ዩኒቨርስቲ ስታዲየም ልምምዳቸውን በሚያከናውኑበት ወቅት የቡድኑ ተጫዋች ያሬድ ባየህ ለዩጋንዳው አቋም መለኪያ ጨዋታ እያሟሟቀ ሳለ ባጋጠመው ጉዳት ከጨዋታ ውጪ ሆኗል። ይህን ተከትሎ በነበሩት የሁለት ቀን የብሔራዊ ቡድኑ ልምምዶች ያልተሳተፈው ያሬድ ወደ ታንዛኒያ የማይሄድ መሆኑ ተረጋግጧል። አሰልጣኝ ውበቱ አባተ በያሬድ ባየህ ቦታ አስቻለው ታመነን መጥራታቸውና ወደ ታንዛኒያ ከቡድኑ ጋር እንደሚጓዝ ታውቋል። የመልስ ጨዋታ ነሐሴ 29 በሩዋንዳ  ሁዬ ስታዲየም ላይ ይጫወታሉ ።",
  "title": "የዋልያዎቹ አሰልጣኝ ውበቱ አባተ የቅድመ ጨዋታ መግለጫ ሰተዋል",
  "author": "Brook Tefera ",
  "slug": "abate-pre-match-conference",
  "thumbnail": "/images/uploads/img-20220824-wa0003.jpg"
}