{
  "layout": "blog",
  "date": "2022-02-01T22:03:51.156Z",
  "body": "Ethiopia national team and Ethiopian Coffee forward Abubeker Nasir has sealed a dream move for defending South African champions Mamelodi Sundowns, after several days of protracted negotiations.\n\nSouth African media outlets had reported all week that the Walias’ number ten had impressed during [his trial in South Africa](https://www.bluenilesport.com/articles/abubeker-nassir-south-africa-trials) and was confirmed to have signed. But yesterday, a press officer from his current club, Ethiopian Coffee had told Blue Nile Sport that nothing was confirmed and that negotiations were ongoing.\n\nToday, the club confirmed in communications with Blue Nile Sport that Abubeker Nasir had indeed signed an agreement with Mamelodi Sundowns.\n\nThe club has not immediately disclosed the transfer fee and personal terms. But according to the agreement, Abubeker would be immediately loaned back to Ethiopian Coffee until the end of the Ethiopian Premier League season, in May.\n\n“Abubeker is officially a Mamelodi Sundowns player,” reads an Ethiopian Coffee club statement sent to Blue Nile Sport. “He will return to Addis Ababa and play for Coffee then return in Johannesburg in four months time.”\n\n![](/images/uploads/abubeker-south.jpg)\n\n> *Abubeker Nasir dribbles the ball past fellow Mamelodi Sundowns loanee Sydney Mobbi for Ethiopia during a world cup qualifier against South Africa in Johannesburg on October 12th 2021 (Image: Lefty Shivambu - Gallo Images/Getty Images)*\n\nWith the news, Abubeker becomes the third Ethiopian footballer to sign for a South African side, following in the footsteps of Walias’ teammate Getaneh Kebede, who enjoyed stints with Bidvest Wits and University of Pretoria FC following the 2013 AFCON, as well as retired former striker Fikru Teferra Lemessa, who turned out for Supersport United, Orlando Pirates and University of Pretoria FC among others.\n\nArguably the hottest talent to emerge from Ethiopia in years, Abubeker’s ground shattering 29 goals in 23 Ethiopian Premier League games last season put him in the scope of clubs around the world, including among others, Kaizer Chiefs who were reportedly the closest to sealing his signature.\n\nFollowing an impressive showing at the African Cup of Nations, the race for Abubeker’s signature intensified, and the Brazilians were quicker to bring him to South Africa, initially on trial.\n\nDeployed as a false 9 or a winger for the national team, he currently has 15 caps for Ethiopia, three goals, and was a crucial part of the national team’s successful qualification campaign for the 2021 AFCON. He also featured prominently in world cup qualifying for the Walias.\n\nDuring a disappointing AFCON 2021 campaign, which saw Ethiopia earn a single point and finish bottom of group A in Cameroon, Abubeker was among the team’s [better performers.](https://www.bluenilesport.com/articles/abubeker-nasser-shines-afcon)",
  "title": "BREAKING: South African giants Mamelodi Sundowns have signed Ethiopia’s Abubeker Nasir",
  "slug": "abubeker-nasir-signs-mamelodi-sundowns",
  "author": "Blue Nile Sport staff",
  "thumbnail": "/images/uploads/mameldo.jpg"
}