{
  "layout": "blog",
  "date": "2022-02-23T00:12:28.828Z",
  "title": "Adama's front two blow away Dire defence",
  "slug": "adamas-front-two-blow-away-dire-defence",
  "body": "*(Image: Ethiopian Premier League Share Company)*\n\nAdama City put on a dominant performance against Dire Dawa City as they tore the home team apart in a display that saw them temporarily go up to fifth place.\n\nDire Dawa on the day set up to control the game through pressing and a high defensive line, defending through offside traps. Adama looked to exploit the space behind the defenders with long balls and defense-splitting passes through their pacy front two of Dawa Hotessa and Am Mohammed.\n\nIt was one-way traffic after a competitive first fifteen minutes. With Abdulretif's agonizing miss from an Adama mistake the only big chance that Dire Dawa had in the first half.\n\nDire Dawa will have considered themselves lucky to have not conceded a goal in the first half, with Hotessa and Mohammed finding themselves in all sorts of space in Dire Dawa's defensive third. The biggest chance of the half came to Mohammed, who could not get to the end of Hotessa's low cross for a tap-in. Hotessa had thought he had scored the opener in the twenty-eighth minute when his header was deemed offside by a tight margin. This was the story of the half as Adama were caught offside seven different times in the first half.\n\nDire Dawa initially came into the second half with an improved showing, having decent passages of play for the first ten minutes, with Abdulretif finding himself one-on-one against Adama keeper Jassew Tassew. Adama reasserted control of the game after the fifty-fifth minute, getting in behind the Dire Dawa defense twice and finally scoring the opener in the sixtieth minute. It was a beautiful long ball from Zekarias Kebede that exposed Dire Dawa's high line and set Hotessa off with his pace. Dire Dawa keeper Firew Getahun was caught in no man's land as Hotessa chipped the ball over him for the goal.\n\nThe problem for Dire Dawa was not necessarily their tactical setup, but the lack of proper implementation. Adama's chance creators were not prevented from passing through a press/marking and the defense left spaces in between them for the pacy Adama strikers to run into. This is what led to Adama's second goal with Ame Mohammed making a run through the Dire Defence unchecked and beating keeper Frew one-on-one.\n\n![](/images/uploads/adama-hotessa.jpg)\n\n*(Image: Ethiopian Premier League Share Company)*\n\nWhile the deadly strike partnership of Hotessa and Mohammed will be front of the headlines, a player who also deserves praise for his performance on the day was Amanuel Gobena. Gobena continuously sliced through the Dire Defence with pinpoint through balls look and created three key chances for Adama.\n\nDire Dawa's attack did not create many clear-cut chances, it is thus fitting that the goal they scored was a result of a self-inflicted wound from veteran keeper Jemal Tassew. Tassew fumbled a cross which fell to grateful Dire skipper Daniel Demisse for the consolation.\n\nIt did not take too long for Adama to regain their two-goal cushion, however as Hotessa exploited the space between the Dire defense by slipping in substitute Abubekir Wondemu, who converted with a far-post finish. Dire had a sending off to cap off a miserable outing. Hotessa found himself in a nearly identical situation to the Adama opener with Dire keeper Frew Getahun electing to palm away the striker's chip for a red card in this instance.\n\nThe good news for Dire Dawa fans will be that their team has one last game at home to make things right and move away from the relegation zone. Both them and Adama will play difficult fixtures against title contenders Fasil and Hawassa respectively.",
  "thumbnail": "/images/uploads/adama2.jpg",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3"
}