{
  "layout": "blog",
  "date": "2022-02-16T03:47:20.620Z",
  "body": "<!--StartFragment-->\n\n> *Addis Ababa City (Image: Ethiopian Premier League Share Company)*\n\nThe capital city club put five past their neighbors Sebeta City in the late kick-off game of the Ethiopian Premier League’s twelfth week. Addis Ababa City ended their six-game winless streak in a match that will be long-remembered by fans of both clubs albeit for different reasons. This crucial relegation scrap ended up with six goals; with three goals being shipped in each half. This means that this round of the BetKing Premier League played in Dire Dawa Stadium has now had two games featuring six goals(alongside the Jimma VS Hadiya fixture).\n\n\n\nRichmond Adongo opened the scoring for Addis in the thirteenth minute, his fifth of the season. Adongo was again involved in a goal ten minutes later with an assist as his through ball put Fistum Tilahun in front of the goal to score the second goal of the game. Fitsum added another goal to his name in the thirty-sixth minute to also put his tally to 5 goals for the season, giving his side a comfortable three-nil lead at halftime. \n\n![](/images/uploads/addis-abeba-3.jpg)\n\n\n\n>  *(Image: Ethiopian Premier League Share Company)*\n\n Muluken Addisu slotted home the fourth goal in the 60th minute. The consolation goal for Sebeta came seven minutes later, with Bereket Samuel coolly converting a penalty to give his side a glimmer of hope. This hope was quickly quashed in the 70th minute, with Robel Girma putting the nails in Sebeta's coffin to make the final score five-one in favor of Addis Ababa. \n\n\n\nThree points for Addis Ababa mean that they are out of the relegation zone and into the twelfth position with fourteen points. Sebeta has only had one win all season and is now bottom of the league on goal difference. The pressure that was on Sebeta City’s coach Zelalem Shiferaw will mount as Sebeta look for a way out of the relegation zone.\n\n\n\n<!--EndFragment-->",
  "thumbnail": "/images/uploads/addis-abeba-celebrations.jpg",
  "title": "Addis Ababa Sink Sebeta in Crucial Six-Pointer",
  "slug": "addis-ababa-sink-sebeta-in-crucial-six-pointer",
  "author": "Ebawak Tesfaye @negussu_"
}