{
  "layout": "blog",
  "date": "2022-06-04T15:27:07.959Z",
  "body": "Ethiopian fans will feel slightly underwhelmed by their team’s performance in the delayed 2021 edition of AFCON. The Walias finished dead last in their group with just one point collected over their three games. To be fair to Wubetu’s side, they were handed a tough group, having to face the likes of continental giants and hosts Cameroon in addition to recent strong performers Cape Verde and Burkina Faso. Still, there was the sense that the Walias’ youthful side had the potential to sneak into the next round through a third-place finish. Luckily for Wubetu Abate’s side, another AFCON tournament is just around the corner, with the COVID pandemic leading to the 2021 and 2023 editions taking place within 16 months of one another.\n\n\n\nEthiopia will have to worry about making it into the tournament before anything else. This will be a tough undertaking in and of itself with the Walias qualification group containing the likes of seven-time champions Egypt. Guinea and Malawi will be tough opponents as well, with both making it past the group stage in last year's edition. Ethiopia’s qualification group last year was not a walk in the park either; containing Ivory Coast and Madagascar, but this year contains three strong teams to overcome rather than two. With the qualifying round kicking off this weekend, now would be an appropriate time to look back and reflect on the recent performances of the Ethiopian National team. Due to limitations in data, most of the statistics will focus on the AFCON 2021 campaign. \n\n![](/images/uploads/img-20220603-wa0014.jpg)\n\n> *(Image Source:EFF)*\n\n\n\nSince Wubetu Abate took over coaching duties of the national team in November 2020, Ethiopia have played 13 games. Out of these matches, the Walias have won 3, drawn 3 , and lost 7. They have scored 13 goals and conceded 17 in the process. The top scorer from the games Wubetu has been in charge of is Getaneh Kebede by quite some distance, scoring 6 goals during this period. The first half of Wubetu’s reign has been markedly much stronger than the second half. Ethiopia collected 4 wins and 3 losses in their first seven games while only managing 3 draws and 3 losses in the last 6 games. \n\n\n\nWubetu has kept his formation relatively consistent throughout his tenure, with the defense operating as a back four that is encouraged to play out from the back alongside the goalkeeper. This is evident in his squad selection, goalkeepers Fasil Gebremichael, Teklemariam Shanko, and Bereket Amare all play in teams that are comfortable playing out of the back at the club level. Further up the pitch, Ethiopia plays with a midfield three, either in a 4-3-3 or a 4-5-1 formation to facilitate possession-based football. We can gather the strengths and weaknesses of Abate’s side through the statistics. Wubetu has made clear his preference for attacking football, with his philosophy leading to defensive frailties at times. So far Wubetu's Walias have averaged a goal per game while conceding 1.3 goals per game. Lack of concentration, individual mistakes, and goalkeeper howlers account for most of the goals conceded.\n\n![](/images/uploads/img-20220603-wa0012.jpg)\n\nDefensive errors have been a fixture of Ethiopia’s matches in recent months, with goalkeeping howlers proving especially costly for Ethiopia. This has always been a calculated risk for teams that play out of the back. Wubetu encourages his goalkeepers and defenders to pass the ball into play from the back in the hopes of opening up space for the attack further up the pitch. During AFCON 2021, Teklemariam Shanko made a total of 124 passes (41.3 per game) with a 72% pass accuracy. There is a risk attached to such tactics, particularly when playing against teams that press high. On the other hand, using the goalkeeper as an \"outfield player\" allows the pitch to be \"bigger\" by creating overloads in the defensive third and allowing the team in possession width when full-backs are enabled to hug the touchline. Mignot Debebe (DF), Aschalew Tameness (DF), and Amanuel Yohannes (DM) are the top performers for average passes per game. The latter two also have the highest passing accuracy of players who have played for 90 mins or more. The rest of the top performers for this statistic are mostly defenders, which is to be expected for a team that looks to build play from the back. The Walias on occasion have a bad habit of being too narrow when building up, the two center backs ideally should be far apart and positioned on opposite ends of the penalty box. This allows the team width when building up as the fullbacks will then be free to push to the touchline.\n\n\n\n\n\nEthiopia found it hard to play the back-three, with the Walias struggling to deal with the width provided by this formation. Defensively capable fullbacks, as well as wingers that track back, are necessary to mitigate the risks of the wingbacks employed by the opposition team. Abubekir Nassir and Amanuel Gebremichael were the most frequently played wingers during AFCON and failed to consistently cover for their fullbacks.\n\n![](/images/uploads/img-20220603-wa0008.jpg)\n\n\n\nEthiopia’s weakness against width was also evident when they played Cameroon. Both fullbacks, as well as the wingers, played very narrowly over the course of the game, allowing Cameroon to deliver dangerous crosses. Ramadan Yusuf in particular was exposed against Collins Fai and Moumi Ngamaleu on the right. Suleiman Hamid fared better, as he was only dribbled past once, winning 4 out of his 8 ground duels\n\n![](/images/uploads/img-20220603-wa0006.jpg)\n\nIt is not a coincidence that the Walias’ best performance came in the 1-1 draw against Burkina Faso, where the average positions of the fullbacks was the highest up the pitch it had been in the tournament, with the back four being evenly spaced apart. Wingers Hotessa and Nassir also kept their wide positioning rather than attempting to overload central areas by going narrow. This shape allowed Ethiopia to control the game with a majority of the possession (56%) for the first time in the tournament. The positioning of wide players will be crucial if Ethiopia are to come out on top in their upcoming fixtures. \n\n\n\nOverall, Ethiopia had the second highest pass accuracy and number of shots in the group (averaging 10 shots per game), only second to eventual finalists Cameroon. Control of aerial space was the team’s major Achilles heel, with the aerial duels won being by far the lowest in the group at 33%.  \n\n\n\nOf the twenty-three players that were selected to go to AFCON 2021, only fourteen retain their spots for the most recent squad. The goalkeeping position has seen the most reshuffling, with two of the three keepers changed: Fasil Gebremichael remains whereas former starting keeper Teklemariam Shanko and Jemal Tassew making way for Bereket Amare of Ethiopia Coffee and Dagim Tefera of Hawassa City. \n\n\n\n![](/images/uploads/img-20220522-wa0008.jpg)\n\n> *(Image Source: Getty Images)*\n\nTurning our attention to Ethiopia’s rivals, Egypt scored even less per game than the Walias over the course of AFCON 2021, only putting the ball into the back of the net on four occasions, averaging 0.57 goals per game. The Pharaohs made up for this with their solid defense, conceding two goals over the entire tournament. Malawi on the other hand were very middle of the pack when it came to their statistics; scoring 0.75 goals per game and conceding 1 goal per game. Malawi retained their coach from AFCON Romanian Mario Marinica after they defied expectations by taking a team that had not qualified for the competition in over ten years into the round of 16. \n\n\n\nEgypt have appointed Ehab Galal as head coach after Quierios was sacked after failing to secure silverware at AFCON 2021. The new coach has not had many games to mold his Egyptian side away from Querios’ vision as of yet. Queiroz employed a similar formation to the Walias in a 4-3-3 with one holding midfielder and two midfielders. The Portuguese coach also encouraged his team to employ an aggressive press, with Egypt pressing high up against the defense for sides who have problems playing out from the back, a strategy that Galal may seek to employ this tactic against Wubetu’s side.",
  "title": "AFCON 2023 Qualifiers Preview: Tactical Breakdown",
  "slug": "afcon-2023-qualifiers-preview-tactical-breakdown",
  "author": "Ebawak Tesfaye @negussu_ ·, Natnaiel Mulugeta @NatnaielMuluge3 · ",
  "thumbnail": "/images/uploads/img-20220604-wa00013.jpg"
}