{
  "layout": "blog",
  "date": "2022-03-29T02:25:11.459Z",
  "title": "BKEthPL Round Two (Dire Dawa) in Review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "body": " The end of game week fifteen also signaled the end of the first half of BetKing Ethiopian Premier action. This was also the last time this season we will see Dire Dawa Stadium, which has been hosting Premier League matches for the last six match weeks. This round of games did not disappoint in terms of drama, with the round hosting a total of a hundred and seven goals and nine red cards. Here are some of the major talking points taken away from the second round of Premier League fixtures played in Dire Dawa.\n\n## Fasil's Defensive Woes\n\nIn comparison to the strong start of their title defense in Hawassa, it is clear to see that Fasil Kenema have been poor in Dire Dawa. The Emperors have only collected eight points from a possible eighteen, seven worse than in-form Welayta Dicha. Looking deeper into their performances across the two rounds, it is obvious that goal-scoring has not been Fasil's issue; their goals per game has remained identical across the two rounds at about 1.67 goals per game.  It is in the goals conceded that problems emerge; this statistic went up from 0.444 to 1.33 goals conceded per match. A related issue is that Fasil are incapable of winning a game once they have conceded a goal, the only game in which Fasil have managed to pick up three points when they conceded a goal was in the first game week against Hadiya Hossana.\n\nTheir most recent game, the 4-0 walloping of Dire Dawa City, displays Fasil at their best. Shimekit Gugsa and Belay Desta were the stars of the show with two-goal contributions each. Belay Desta has been a major reason why Fasil are the league's top scorers, with the twenty-one-year-old picking up five assists(more than any player), and four goals in his breakout season. The winger has picked up form in Dire Dawa, scoring three and assisting two. A peculiar feature of Fasil's goal scoring this season has been that they most frequently score four, one, and zero goals. They have yet to score only two goals in a game. Fasil is not short of these kinds of performances; their deadly attack has similarly blown out the likes of Sidama, Jimma, and Sebeta by more than three goals. Fasil will hope to improve their performances in the tighter games to reignite the defense of their title in the second half of the season.\n\n![](/images/uploads/fasil-gugsa.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## Dire Dawa Struggles at Home\n\nDire Dawa wrapped up a worrying run of games on home turf with a heavy defeat to Fasil Kenema. Their attack has been a big problem for them, they have only scored one goal in their last four matches. This goal drought has coincided with one of the worst runs of form in the league, with Dire collecting a mere five points from this round of games.\n\nDire Dawa’s leaky defense and lack of goal threat were exemplified in their last two games against Adama City and Fasil Kenema in which they scored one and conceded seven. The team rarely threatened the opposing team's offense while Dire Dawa City's poorly set up high-line was exposed on the counter.  Dire Dawa had sidelined their main coach Zemariam Woldegiorgis, relegating him to coaching the under twenty’s since January 11th due to the club's dissatisfaction with his performances. The Easterners have been under the leadership of Fuad Yusuf since in one of the more amusing stories of this season. Yusuf's record has been nearly identical to Zemariam’s however,  with both managers only getting 0.83 points per game. Newly appointed Samson Ayele will hope to replicate his work with Sehul Shire to avoid the drop with Dire Dawa this season.\n\n![](/images/uploads/dire-fans.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## **Resurgent Jimma**\n\nJimma Aba Jifar have been the standout improvers in Dire Dawa as they have gone from getting one point from nine games in the first round to an impressive ten points from six in the second round of matches. While they ended their time in Hawassa hopelessly adrift at the foot of the table, Jimma’s performances in Dire Dawa were the sixth-best in the league points-wise. Both Jimma’s attack and defense have seen improvements: Jimma’s goals scored per game increased by 1.1 while their goals conceded per game went down by 0.5. The improvement in attack can be attributed to breakout star Mohammed Nur Nassir who has been prolific, being the second top scorer in the Premier League this round with four goals. Veteran Dawit Estifanos has also been important as the creative spark for Jimma and has chipped in with two goals and two assists. Props must also be given to manager Ashenafi Kebede, who has been able to turn things around after a bad first nine games with his team.\n\n![](/images/uploads/jimmafc.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## In-Form Welayita Dicha\n\nWelayita Dicha have been allergic to draws this season, drawing just once all season and managing to have the most wins in the league (nine). They are currently the in-form side in the league with fourteen points from a possible eight this round. Welayita are right on the heels of league leaders Saint George as they are just three points away from the top spot. One of the most impressive aspects of Welayita's performances since the start of this round of fixtures has been their rock-solid defense. Dicha have only conceded a single goal in the six matches they have played in Dire Dawa. A potential weakness going forward will be their attack as it is not as potent as fellow title rivals. This is evident in the fact that nearly all of Welayta's wins have been within a margin of a single goal. Sintayehu Mengistu might be an antidote for these problems, with the promising forward scoring consecutively in his past two starts.\n\n![]()\n\n## Ethiopia Coffee Goal Drought\n\nEthiopia Coffee extended its winless run with a draw against fellow strugglers Bahir Dar City. What has caught the eye of many observers is the sputtering form of Coffee's attack: Ethiopia Coffee are the joint-second lowest scorers of goals in the league, a stark contrast to last season where they were the league's top scorers by a wide margin. For context, Coffee scored 44 goals in 24 matches last season. They have 11 goals in 15 games this season. Coffee’s goalscoring form has been even direr since the start of matches in Dire Dawa with only three goals scored in the last six matches(making them the lowest goal scorers in this time period). It is a mystery as to why Manager Kassaye Arage has not been able to get his side to score more as the core of his attack remains largely the same. Their dependence on Abubekir Nassir’s contributions to their attack has stayed consistent in both seasons: he contributed to 52.27% of Coffee’s goals last season. Even with the star winger missing a few games this season, he has been involved in 63.63% of Ethiopia Coffee’s goals this season.\n\n There will be increasing pressure on Kassaye to improve the team's performances and Abubekir Nassir's form will be make or break for Ethiopia Coffee's season to end on a high note. Alternative goal sources will also have to come for Bunna to remain competitive, be it from the midfield with players like William Solomon and Robert Teklemichael or from a new signing.\n\n![](/images/uploads/bunna1.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## Sebeta Winless in Dire\n\nAfter a successful campaign under Abraham Mebrahtu which saw Sebeta finish an impressive fifth place last season, Sebeta fans would have hoped to push on for a title challenge under new manager Zelalem Shiferaw this season. These aspirations soon came crashing down, and after their most recent draw against Arba Minch, Sebeta have dropped to the foot of the table.  Halfway into the season, Sebeta have only won a single game. They also have the distinct honor of being the only side to not have won a game in Dire Dawa. \n\nThe question on the minds of many fans will be what went wrong? Looking at the stats for last season, Sebeta were never a prolific outfit, with the team having average goals scored and goals conceded statistics. Their strength came from the fact that they kept most of their games tight, earning the highest amount of draws in the premier league with 10. Mebrahtu’s possession-based football was less focused on creating a large number of chances and more focused on limiting chances for the opposition. Zelalem Shiferaw's style of play has deemphasized the importance of position (their match against Arba Minch being the only game in which Sebeta had a considerable edge in position in this round of games), all the while Sebeta’s defense has struggled to deal with the transition, conceding 0.6 more goals per game compared to last season. Sebeta have the unwanted record for most goals conceded(fourteen ) in Dire Dawa, in addition to the worst goal difference.\n\n![]()\n\n## **Next Stop: Adama** \n\nWith the league resuming on the 29th of March, the first set of matches in this new round will be a litmus test for most of the teams we have mentioned above. This is due to the fact that all of the underperformers in Dire Dawa seemingly face the League heavy-hitters with strugglers Ethiopia Coffee, Sebeta City, and Dire Dawa City, facing tough opposition in the form of Sidama Coffee, Saint George, and Welayta Dicha respectively. Here are the tables for matches in Hawassa and Dire Dawa for a full comparison before the league kicks off at Adama.\n\n***League Table for Hawassa Matches :***\n\n![](https://lh3.googleusercontent.com/qw3nPzHXyJRDJaphmnP0y6C-pA_EmFVN_GfyMtFm4P-mK9HMy966YREiqbJuhZZGcLILJrmLmKTiCW9ZFEtIFn6djGDmGjtaccBvpsC8mJU486G_JIdboUtdKJ6AD3EnZAPOmNmS)\n\n***League Table for Dire Dawa Matches :***\n\n![](https://lh5.googleusercontent.com/VkPi8OuBSD_hzSleIfinL_Ry1QoHvmje00jbUWqJV1LCd_3DosHgPFSBOBzTnQh_yXW92ZrBwlQM3Qy2Cs1pkfnBG5A4rW9ikJOOUh-lyy0g_7-QZD7QT_Dmo_cEBa_pmx_q0ANK)",
  "thumbnail": "/images/uploads/74419593_2327028597407967_5636164107980767232_n.jpg",
  "slug": "bkethpl-round-two-dire-dawa-in-review"
}