{
  "layout": "blog",
  "date": "2022-04-17T02:04:11.932Z",
  "title": "BKEthPL Gameweek 18 In Review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "body": "## The Horsemen Gallop On\n\nSaint George continued their imperious march towards their first title in five years after yet another comfortable win in the BetKing Premier League, this time dispatching Dire Dawa three goals to nil. Two goals from Edwin Frimpong and a stunning strike from Abel Yalew were enough for Saint George to get the three points.\n\n\n\nFrimpong Mensu has been one of the unsung heroes for this Saint George side. Not only has the defender formed one of the most formidable defensive pairings in the league which has only conceded seven goals all season, and registered eleven clean sheets he has also had a productive goal-scoring record these past few weeks. The Ghanian has always been a threat from Saint George’s set-piece routines but has only seen it bear fruit recently. Frimpong's brace against Dire Dawa has come after he scored in consecutive games against Ethiopia Coffee as well as Sebeta, taking his goal tally for this season up to four.\n\n![](/images/uploads/edwin-st-george.jpg)\n\n> *Frimpong Mensu (Image: Ethiopian Premier League Share Company)*\n\nSaint George are now on a four-game win streak and have a seven-point cushion at the top after Welayta Dicha failed to beat Adama City. The aggregate score over the last four games is 14-1 in favor of Saint George, who look unstoppable at the moment. In a league that is increasingly volatile(no team is on a winning streak outside of the Horsemen), a Saint George win seems like one of the few constants.\n\n\n\n## The Curse of Home Advantage\n\n\n\nAfter Dire Dawa went on a miserable run of games on home soil, one would have backed Adama City to break the voodoo on poor home performances. On paper, Adama have a stronger side and have not been threatened to be dragged into the relegation battle the same way Dire Dawa have been. It seems however that Adama have not been able to break this curse as of yet, with all three games played so far ending in a draw for the seventh-placed side. It could be worse, however, as one point is better than none. This won't assuage Adama fans who are concerned with the number of draws their side is involved in. Adama have had an eye-watering 12 games end in stalemates so far, constituting 67% of their results and making them top of the league for this metric.\n\n![](/images/uploads/adama.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nA bright spot for Adama this season has been their defense, they have only conceded eleven goals, the second-best record in the league behind leaders Saint George. Getting the most out of their attacking talent could be key in Adama finishing their season strong. Dawa Hottessa is one of their star men with five goals and one assist, but he has not been able to register a goal in his past four games. Rekindling his synergy with striker Ame Mohammed is critical if Adama are to improve.\n\n\n\n## A New Chapter for The Emperors\n\n![](/images/uploads/fasil-new.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nThe decision to let go of veteran coach Seyoum Kebede after Fasil slumped to a 2-1 defeat to Wolkite City was a move that shocked many. This was a decision that was seen as harsh by many observers as Seyoum led Fasil to their first Premier League title last season and finished in 1st place in the canceled 19/20 season.\n\n\n\nFasil Kenema’s first post-Seyoum match and  Interim manager Hailu Negash’s first game in charge ended with a last-gasp winner against Jimma Aba Jifar. It was the type of game that was a rarity under the previous management, a tight Fasil win. Prior to this game, Fasil had only won two games by a margin of one this season,  both coming in the first half of the season against Wolkite and Defence force.  One of the constants across both managers based on a limited sample size was Desta Belay's continued importance, with the midfielder registering his 6th assist of the season to cement his position as the league’s top creator.\n\n\n\nOne of the major differences between this match and Seyoum Kebede’s last match was each team’s share of Possession. Possession, which was dominated by Fasil last week at 67%, shrank to 49% this week (the last time that Fasil did not retain most of the possession was against Ethiopia Coffee five gameweeks ago). In terms of chances created and conceded Fasil’s stats this week mirrored what they did in last week’s defeat to Wolkite. \n\n\n\n## Bahir Dar’s Struggles Continue\n\n![](/images/uploads/wolkite-bahir-dar.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nBahir Dar let slip a great opportunity to pick up three points and go level with a resurgent Wolkite after conceding a late goal in this 2-2 thriller. It was a game in which Wolkite controlled the majority of the first half, culminating in their first goal.  Behailu Teshager was one of the best players in the half, registering an assist and getting close to scoring a goal. For all of their control, they did not threaten Bahir Dar outside of this goal. This came back to hurt Wolkite who let Bahir Dar back into the game in the second half. Wolkite’s failure to play out of Bahir Dar’s high press saw Wolkite concede early in the second half to a rocket from outside the box by Girma Disasa. From then on, the game was decided by set pieces. Bahir Dar scored what they thought was the winner in the 75th minute via a Fitsum Alemu header from a well-worked set-piece routine. It was not to be Bahir Dar’s first win in six, however, as in the 88th minute Getaneh Kebede whipped in a quality ball for Challa Teshita who converted for the Wolkite equalizer.\n\n\n\nThis result comes as a blow to Bahir Dar, who are in a bad form at the moment. Bahir Dar have only picked up four points out of a possible fifteen. Bahir Dar will feel hard done by, as they have controlled most of the games well: they have averaged a possession of 53% over their past five games. It has not been possession for possession’s sake either: over the past five games, Bahir Dar have created 62 shots while conceding 49 shots. Taking the latest fixture as an example, Wolkite scored two from four shots, while Bahir Dar scored the same amount of goals from 18 shots. This indicates that Bahir Dar has been plagued by poor finishing. It is very rare, however, that a team has a spell of poor finishing that is this extended. Bahir Dar’s bright start to the season has masked how truly abject results have been for them as of late. Four out of Bahir Dar’s five wins of the season have come from their first seven games, with only one win coming from their last eleven games.",
  "thumbnail": "/images/uploads/74419593_2327028597407967_5636164107980767232_n.jpg",
  "slug": "bkethpl-gameweek-18-in-review"
}