{
  "layout": "blog",
  "date": "2022-05-06T21:44:57.276Z",
  "title": "BKETHPL GameWeek 21 in Review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "body": "\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## Adama Go Out With a Whimper\n\nAdama played their last game at home against a resilient Sidama side looking to regain their footing after Gebremedhin Hailu’s side lost to title rivals Saint George in the previous game week. Most of the big chances in the match were created from set-pieces, with Saladin Seid and Ame Mohammed looking dangerous in these situations for their respective sides. The opener came about from open play, however, when Abubekir Wondimu hit a blistering shot outside the box in the forty-third minute. Adama did not hang on to their lead for long, as Dawit Tefera delivered yet another dangerous inswinging free-kick for Sidama Bunna to give Saladin Said the opportunity to score the equalizer. Adama were the better of the two teams in the second half, getting as close as hitting the post, but it was not meant to be for the home side.\n\n![](/images/uploads/adama-fans1.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nThe trend of poor home performances in the Ethiopian Premier League continues with it derailing Adama City's season much the same way it did Dire Dawa City's in the last round. Adama have had a horrible time at home, especially in relation to how they were performing prior to the start of matches in their home city (Fasil Tekalign's side were flying high in sixth place by the end of Matchweek 15). Their record for their stay at home is five draws and one loss, with the team only scoring four and conceding five goals in the process.  An Adama side that already had the highest number of draws in the league before the start of the current round have now drawn an incredible 14 of their 21 games (67%). These stats put them near the bottom of the league for this time period.\n\n## Defense Put Coffee to the Sword\n\nDefense dismantled Ethiopia Coffee four goals to nil in the match that will steal all of the headlines this week. It was one of Coffee's former players, Yordanos Abay, who led Defense to victory as assistant coach due to the illness faced by the main coach Yohannes Sahle.\n\nLike many of the teams that have beaten Ethiopia Coffee, Defense Force took advantage of Coffee’s tactic of playing out from the back by pressing high up the pitch and looking to dispossess Coffee in their own final third. Coffee got their first warning in the fourteenth minute as Teshome Belachew hit the crossbar. It was not too long after this chance that Defense got their first goal. An interception in Coffee's own half was followed by a through ball to Teshome Belachew again who converted this time after getting past the Coffee keeper Bereket Amare.  Ethiopia Coffee yet again lost the ball in their own half for the second goal as Israel Eshetu intercepted the ball and passed to Mintesinot Adane. Adane delivered a chipped through ball for Biniam Belay who converted cooly in the twenty-second minute. There was a lot of space in behind for Defense Force on the day, and goalscorer Biniam Belay pounced on this for the third goal as he threaded a ball through for Teshome Belachew, who squared it to Adissu Atula for the finish. Defense Force continued to threaten Coffee’s defense (especially with incisive through balls to exploit their highline) throughout the game without rarely being threatened themselves.\n\n![](/images/uploads/defense-force3.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nThe result sees Ethiopia Coffee come back down to earth after a string of good results, dropping down to eighth place. This was a win that Defense desperately needed due to the fact that they had not won in seven. Despite their poor prior form, there were signs of resilience in this Defense Force side: they were unbeaten in their last three games(including a draw against a tough Saint George side), picking up three clean sheets in this winless run. Yohannes Sahle will be buoyed by all these signs as well as the three-point gap that has now formed between them and the bottom three.\n\n## Saint George Vs Hawassa\n\nWhen Saint George dropped points to Defense Force a couple of gameweeks back, it looked like there was an opportunity for their title challengers Hawassa and Sidama, who the Horsemen had to face back to back. Instead, it seems that Saint George have all but wrapped up the title after beating the Southern clubs in consecutive games. As has been the case in many instances for the Horsemen as of late, the opener came from an excellent set-piece delivery from Henok Adugna. Caanan Markneh dispatched Adugna’s corner with a clever headed ball down. Hawassa sought a way back into the game in the second half, which gave Saint George a lot of space in behind to exploit. Saint George took advantage of this and Hawassa’s defensive line was laid bare by pace on the counter. Amanuel Gebremichael used his electric pace to go on a run from his own half to create and convert George's second goal. The pacy Amanuel was also central in the game’s third goal as it was his cross from the left that was turned in by Medhane Birhane for an own goal.  \n\n![](/images/uploads/saint-george-7.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nSaint George leave Adama in a much more authoritative position than they entered it. They lead the league with a 10-point gap, collecting 16 points out of a possible 18. The team scored 14 and conceded just 1 goal. Amanuel Gebremichael and Abel Yalew have been impressive on the wing with 2 goals each this round, but the standout player would have to be Frimpong Mensu. Mensu has been part of this solid defensive unit which has only conceded once in these past six games in Adama, and perhaps more impressively as a defender, he is Saint George’s top scorer for this round with four goals.\n\n## Addis Ababa City and Hadiya Hossana star in six-goal thriller\n\nRichmond Adongo continued to impress as the league’s in-form striker registered another goal and an assist against Hadiya. It was a game with a frenetic start, with two penalties scored in the first five minutes. Richmond Adongo scored the opener before Samson Tilahun leveled the score from the spot. Adongo was at the center of Addis' second goal as well, as the Ghanian frontman got on the end of a through ball before cutting the ball back to goalscorer Abel Negash. Hadiya were resilient on the day and clawed back to level the score via Habtamu Tadesse in the twenty-fourth minute as a result of sloppiness when playing out of the back from Addis Ababa. The players saved the best for last as the final two goals were the pick of the bunch. In the thirty-third minute, Elias Ahmed and Negash combined impressive runs with solid interplay before the latter ended the move with an emphatic near-post finish from a tight angle. Addis Ababa could not hold on for the three points, however, as Ephrem Zecharias scored a goal of the season contender in the seventy-ninth minute from long range to end the game level.  Abel Negash will feel unlucky to have not gotten a hat-trick (and Addis their fourth goal ) as his headed ball went into the net only for it to be chalked off with a marginal offside call. \n\n![](/images/uploads/addishadiya.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nAfter having a great spell in Adama, Richmond Adongo is now the top goal contributor in the league with 12-goal involvements. As for Addis Ababa City, they have earned 7 points from a possible 18 in Adama, which puts them at about the middle of the pack for this time period. This has not been enough for the side to escape the bottom three as of yet. Indeed, since the start of this round, the gap between Addis and safety has slightly grown from two points to three. Interestingly enough, one of the teams that was languishing near the bottom of the table before the start of the round in Adama was the team they played against this week, Hadiya. Hadiya sat only three points from the drop zone at 12th place by the end of match week 15. After a great string of performances in Adama, in which Hadiya collected 12 points from 18 (a record only bested by Saint George) they rose to 6th place. This type of form may be what is needed for Addis Ababa to get out of the bottom three.",
  "slug": "bkethpl-gameweek-21-in-review",
  "thumbnail": "/images/uploads/hadiyafans.jpg"
}