{
  "layout": "blog",
  "date": "2022-05-16T00:27:14.180Z",
  "body": "> *(Image: Ethiopian Premier League Share Company)*\n\n## Dire Dawa City vs Hadiya Hossana\n\nDire Dawa City put four goals past Hadiya Hossana in the opening fixture of gameweek 23. It was a scoreline that flattered Dire Dawa. In reality, Hadiya had more shots in the game with sixteen attempts compared to Dire Dawa’s six. The game was ultimately won in the opening and closing ten minutes of the game where all the game’s goals were scored. While Hadiya held the upper hand for the remaining seventy minutes of the game, this did not translate to a goal as most of Hadiya's shots were ineffective long-range attempts as well as poor connections to crosses into the box. Dire Dawa City were the deadlier off both sides at the end of the day, with Henok Ayele and Abdulramak Mubarek both grabbing braces. Mubarek had a versatile performance: with the winger grabbing his first goal via a header, before recording his second goal and his assist via his pace on the counter on the right-hand side. Henok Ayele has emerged as one of Dire Dawa’s most important players, the forward has now scored in the last five games for Dire Dawa after his brace to make it six goals in five games for Ayele.\n\n![](/images/uploads/dire-hadiya.jpg)\n\n> *Henok Ayele (Image: Ethiopian Premier League Share Company)*\n\nDire Dawa’s win puts them further away from the relegation zone and lifts them up from the 13th place spot they have been rooted to for a long time. They are now four points away from the relegation zone. This win against Hadiya has been a continuation of the good form that Dire Dawa has displayed over the last five games. Dire Dawa have collected ten points in their last five games, the fourth-best total in the league for this time period. Hadiya on the other hand are on a downward trend with no wins in their last three games. After a good spell in Adama, Hadiya have lost their first two games in Bahir Dar, they will look to turn this around when they face Ethiopia Coffee.\n\n\n\n## Ethiopia Coffee vs Wolkite City\n\n\n\n   Ethiopia Coffee came out on top in what was one of the most entertaining Ethiopian Premier League matches of the season.  The early stages of the game were characterized by the re-emergence of one of Ethiopia Coffee’s biggest Achilles heel this season as mistakes when playing out from the back cost them on multiple occasions. Specifically, Abebe Tilahun was at the center of two big mistakes through dispossession and loose touches in the early minutes; one of these was converted into a goal by Challa Teshita. Getaneh Kebede doubled Wolkite’s lead through a trademark finish off a direct freekick. Coffee were given a lifeline when they received a penalty through a sloppy handball by Wolkite's Behailu Teshager. Nassir promptly halved the Wolkite lead. Coffee’s defense continued to look vulnerable, however, with Kebede allowed too much space between defenders to run into to slot it past the keeper for Wolkite’s third. Coffee’s defensive woes did not end there, Remedhan Yusuf exploited space in behind to pump a ball towards Challa Teshita in the fifty-sixth minute, Teshita was caught in two minds between taking a shot and passing it to Getaneh Kebede and ended up missing the chance that may have put the game to rest. Coffee made Wolkite rue these missed chances as the Ethiopian Premier League team witnessed one of the greatest comebacks of recent memory starting from the seventy-eight-minute mark. Nassir was involved in all four Coffee goals on the day, with all three comeback goals coming from his area of operation in the left-half space. Nassir drew defenders to him before laying it off to Fuad Fereja and Asrat Tonjo for the second and fourth goals respectively. \n\n![](/images/uploads/bunna-wolkite.jpg)\n\n> *Abubekir Nassir (Image: Ethiopian Premier League Share Company)*\n\nAbubekir Nassir now claims the top spot in the goal contributors table, with fifteen goal involvements this season. Challa Teshita also enters the top ten with seven goals and one assist.  Ethiopian Coffee have had a stronger second half to their campaign, whereas Wolkite City have benefitted from their strong start to their game. Wolkite had a strong first seven games where they averaged nearly two points per game, but have since averaged a worrying 1 point per game (this would have them ranked in 12th place over the last fifteen matches).\n\n\n\n## Bahir Dar City vs Fasil Kenema\n\nIt is early days in Bahir dar, but it seems like the curse of the home team for this season has continued with Bahir Dar City, with the home team only collecting a single point from its first two games. To be charitable to Bahir Dar City, their first two fixtures were not kind, as they faced two teams high up the table in Welayta Dicha and Fasil Kenema. Still, Abraham Mebrahtu’s side were expected to be one of these sides that were at the summit at the table. Instead, they find themselves at the foot in 13th place, just 3 points away from the relegation zone. They will need to quickly turn around their form if they are to avoid a shock relegation as based on their last five games, they are rock bottom in the league with just 2 points from a possible fifteen. Goal scoring has become a major problem for this side, with the team managing to find the back of the net once in the past five games. The team does not have reliable goal scorers, topscorer Fitsum Alemu has only scored twice in their last nine games.\n\n![](/images/uploads/fasil-bahir.jpg)\n\n\n\n> *Fikadu Alemu (Image: Ethiopian Premier League Share Company)*\n\nThe match against Fasil put these problems into sharp focus as Bahir Dar was able to limit Fasil Kenema’s chances at the expense of their own chance creation. Ali Suleiman had one of Bahir Dar’s biggest chances in the twenty-eight-minute but he dragged the ball wide of the goal. Fasil was fortunate to get the winner as it came from a spot-kick, Minaf Awol was deemed to have blocked a shot with his arm in an unnatural position, and substitute Fikadu Alemu converted the penalty to get Fasil Kenema within eight points of league leaders Saint George.\n\n\n\n## Defense Force vs Sidama Coffee\n\n\n\nAddisu Atula and Yigezu Bogale both had impressive performances when Defense Force met Sidama Coffee with both contributing three goals on the day. Defense Force had too much firepower for Sidama, with additional goals from Teshome Belachew and Biniam Belay winning Defense the game 5-3. Sidama had issues with long balls into the box early on in the game, which gave former Sidama player Belay as well as Belachew the opportunity to score. Sidama’s first and Defense’s third goals were similar, both being cutbacks that were sidefooted into the net.\n\n![](/images/uploads/mekelakeya-sidama.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nDefense Force have rocketed up the league table in recent weeks with the help of an unprecedented purple patch. Their current form is in stark contrast to the rest of their season: they have scored 11 goals in the past three games, half of their total for their entire season. This form has seen the side go from 12th place (one point from the drop zone) to their current position in seventh place and seven points from danger. The attacking quartet of Addisu Atula, Biniam Belay, Israel Eshetu, and Teshome Belachew have been a key part of this resurgence as these four have linked up to produce most of these goals. Yordanos Abay, who took charge after Yohannes Sahle’s illness left the main coach sidelined, has managed to get the most out of Defense’s attacking unit. Staying on manager news, the defeat for Sidama has resulted in the sacking of Gebremedhin Haile after a year-long spell at the club. The veteran manager has not been able to compete with league leaders Saint George as Sidama are currently seventeen points short. Still, Sidama has had an improved showing from their ninth-placed finish in the 20/21 season. Gebremedhin will not be short of suitors as he has had successful stints at Defense Force and Mekelle City among others.",
  "title": "BKEthPL Gameweek 23 In Review",
  "slug": "bkethpl-gameweek-23-in-review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "thumbnail": "/images/uploads/adama-fans1.jpg"
}