{
  "layout": "blog",
  "date": "2022-05-21T02:05:25.496Z",
  "body": "## Sebeta Win Back to Back \n\nSebeta City and Wolkite City entered their gameweek 24 fixtures in contrasting moods. Sebeta had just come off of a rare win in the league with their crucial 6 pointer victory against Jimma Aba Jifar. Wolkite on the other hand, were on the receiving end of what would have been a demoralizing comeback at the hands of Ethiopia Bunna in gameweek 23.\n\n\n\nThe game was an entertaining match, with both sides creating a great deal of chances. Wolkite registered twelve shots in the game compared to Sebeta’s ten. Sebeta had the best chance of the first half when an early cross from the right by Getu Hailemariam was laid down for Abdulhafiz Tawfik who hit the post with his shot. Fans would have to wait until the 60th minute for the opener as Getaneh Kebede continued his good form by getting on the scoresheet again. It was a goal that showed off the veteran forward’s smart positioning as he set himself up well to head in a deflected shot for his 12th goal of the season to become the joint top goalscorer of the league.  Kebede has picked up form in the second half of the season with eight of his goals coming in the second half of the season. It did not take Sebeta long to draw the game level as Getu on the right yet again whipped in a dangerous early cross, this time for Samuel Salisso to get on the end of for a headed goal. Questions will be asked as to how Seid Habtamu let the ball into the back of his net as the header from Salissu was placed rather centrally. Sebeta's winning goal came in the seventy-ninth minute from a quick counter, the result of a well weighted pass from Tawfik as well as a well timed run from Shubisa, who cooly chipped the ball over the keeper.\n\n![](/images/uploads/wolkite-sebeta.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nWith this win, Sebeta have gotten back to back wins for the first time this season. These past two matches have accounted for 50% of Sebeta’s wins this entire season. This pick up in form has come at an unfortunate time for Sebeta as most sides near the bottom of the table have seen an uptick in form as teams look to avoid relegation. In a points table based off of the last five games,  Defense Force, Dire Dawa City, Sebeta City and Jimma Aba Jifar all occupy the top six positions. Teams stuck in the relegation zone like Jimma and Sebeta will thus look to take advantage of teams that are in a bad patch of form such as Adama City and Wolkite City to get out of their current predicament.\n\n\n\n## Fasil and Saint George Locked in a Title Race\n\nLast week saw a combination of events that saw the possible reignition of the  title race as Saint George dropped points whereas Second place Fasil Kenema picked up all three. Saint George thus had to win against Jimma Aba Jifar this week to prevent conceding more of their lead to Fasil. It was a tight game in the end with Jimma showing a spirited performance; it took an own goal by Tesfaye Melaku to give Saint George the win. It was a day to forget for Jimma's fullbacks, the aforementioned Melaku scored the own goal whereas leftback Markos Alazar earned himself a red card in the fifty second minute. Saint George still have a strong record over these recent weeks, registering thirteen points from their past five games. However, these recent wins have been tighter, only scoring six goals in the past five games compared to thirteen in the stretch of five games prior. The Horsemen’s defense is still imperious as ever, keeping cleansheets in all of their past five games.\n\n![](/images/uploads/fasildefense.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nFasil also had to overcome a tough obstacle to keep pace with the league leaders, they faced a Defense Force side who are the most in-form team in the league apart from Saint George. Defense Force came out all guns blazing with Israel Eshetu giving Samaki Mikel a hard time with a looping shot within the first sixty seconds of the game. Fasil set up with an unusual center back pairing, with striker Mujib Kassim being deployed in the position he got his start in. Defense Force got the opener through a familiar strategy, they pumped a long ball into the box. Biniam Belay did well to put under his control before he was brought down by Coulibaly Kadir to win the penalty. Center Back Aminu Nesru converted the penalty. Bereket Desta was the architect of Fasil Kenema's equalizer in the ninth minute when he stabbed a clever ball towards Shimekt Gugsa, who scored the goal with the help of a slight deflection. Samaki Mikel was one of Fasil’s most important players, as he prevented a myriad of Defense’s attempts, one of which was a good long range effort from Mintesinot Adane in the twenty-fourth minute. Defense Force had more threat on the day overall, with them producing eleven shots compared to Fasil’s five. They could not convert their chances however and it was Fasil who came out on top. Substitute Natnael Gebregiorgis scored the winner for Fasil after receiving a cutback, this time via the right from Alembirhan Yigzaw in the seventy-fourth minute.\n\n\n\n\n\n## Bahir Dar Win First Home Match\n\n\n\nIt was third time lucky for Bahir Dar City as Abraham Mebratu's side got their first win at home on their third attempt in what was a match between two underachievers this season between them and Adama City. Bahir Dar occupied thirteenth place prior to the match, only three points away from the relegation zone, Adama were higher in tenth place but were only one point better off than Bahir Dar. \n\n\n\n\n\nThe moment that ultimately decided the game came early on in the fifth minute. Adama keeper Sakuba Kamara was caught in no man's land when he came off of his line in a failed bid to dispossess Ali Suleiman. Fuad Fereja took advantage of this and quickly got the ball to Temesgen Derese, who put the ball in the back of the net. Adama got one of their biggest chances of the game immediately after from kickoff when Dawa Hotessa got on the end of a long ball to get to a one on one situation the Fasil keeper,  but his shot was cleared off the line by Fetudin Jemal.  Abubekir Nuri was reliable whenever he was called upon, Adama created a fair amount of chances in the first half so the Bahir Dar keeper had a role to play in keeping his team in the game. One of these Adama chances was gifted to Abdissa Jemal due to a poor headed clearance by Bahir Dar, Nuri did well to save his shot in the fourteenth minute. Adama did put the ball in the back of the net in the twentieth minute, but Thomas Simretu was only able to get his shot away with the assistance of an offside Ame Mohammed and the goal was ruled out. The second half did not see many chances and Bahir Dar hung on for their first win in five games.\n\n![](/images/uploads/bahirdaradama.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nThis win sees both sides swap positions with Bahir Dar now occupying tenth place, five points away from the relegation zone whereas Adama have been dragged down to thirteenth, three points away from relegation. Bahir Dar still has glaring issues in attack to fix if they are to pick up form for the end of the season, Temesgen Derese’s goal was only Bahir Dar's second goal in their last five games. On a more positive note, Bahir Dar was able to limit the chances Adama had in the second half and managed the game well.",
  "thumbnail": "",
  "title": "BKEthPL Gameweek 24 In Review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "slug": "bkethpl-gameweek-24-in-review"
}