{
  "layout": "blog",
  "date": "2022-04-23T00:10:51.797Z",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "title": "BKEthPL Gameweek 19 In Review",
  "body": ">  *(Image: Ethiopian Premier League Share Company)*\n\n## Saint George Hit a Speedbump\n\n\n\nLeague leaders Saint George dropped points for the first time in five games after a draw against Defense Force when the two historic teams met in Adama. The Horsemen will feel hard done by to not come away with three points as they had the better of the chances on the day. Defense force goalkeeper Clement Boye had a game to remember as he produced crucial saves to deny the Horsemen, who registered twelve shots on the day.\n\n![](/images/uploads/saint-george-6.jpg)\n\n\n\n> *Players Argue a Contentious Decision (Image: Ethiopian Premier League Share Company)*\n\nSaint George's quantity of shots was not exceptionally large (with 8 being off target and only 4 shots being on target), but the quality of these chances Saint George created was high. Abel Yalew missed a huge chance in the fifty-eighth minute as he was face to face with an open net when receiving a cross. It was unfortunate for Yalew that his body was positioned awkwardly and the winger slipped before getting the shot away. The employment of Henok Adugna on set pieces created a lot of dangerous opportunities for Saint George and the biggest chance of the game came through his combination with Frimpong Mensu. Frimpong got to the end of Henok’s free-kick in what should have been the fifth goal in as many games for the defender. While replays show that the ball had clearly crossed the line, the linesman did not catch this and the game finished goalless.\n\n\n\nSaint George will feel better knowing that they have a buffer of seven points on top with Welayta dropping points yet again. Whether this result is a minor speed bump or a symptom of something bigger, we will find out when they play one of the biggest matches of their season against Sidama Coffee. Sidama has the opportunity to close the gap with Saint George to five points whereas Saint George will fight to preserve their unbeaten run this season. \n\n\n\n## Saladin Back to his Best\n\nSaladin Said scoring a hattrick is not alien to Ethiopian football, with the striker having terrorized opposition defenses for decades while leading Saint George's attack. Now 34, there were some question marks regarding Saladin's durability and if he was still physically up for the Ethiopian Premier League. The 2013 African Cup of Nations hero found himself without a club after his acrimonious departure from Saint George which saw him being frozen out of the team. His experience could prove vital to Sidama Coffee who in the past five years have steadily built a club that are competitive for league titles. Saladin has won virtually everything during his time at Saint George and Coach Gebremedhin Haile, himself a very successful manager, knows the benefits that Saladin’s winning mentality will bring to his new team.\n\n \n\n![](/images/uploads/img-20220422-wa0001.jpg)\n\n> *Hattrick Hero Said (Image: Ethiopian Premier League Share Company)*\n\nSaladin will be looking to exact revenge on his former club as Sidama face Saint George in their next game. Sidama will have an opportunity to take advantage of a rare wobble as Saint George dropped points against Defense Force. Sidama have been victim to a poor start of the season. Over the last 10 games, however, Gebremedhin’s side are on twenty-two points, only two points away from Saint George for this period. \n\n\n\n## Adama Still Looking for a Win at Home\n\n\n\nAdama’s struggles at home continue, with their latest match seeing them lose 2-1 to a Hadiya team in good form. The defeat saw Hadiya overtake Adama as the home side slipped further from the summit of the table and closer to the bottom. What seemed unthinkable not too long ago seems more likely nowadays as Adama has the joint third-lowest points total in the league over the last five games. So far, in the four games that Adama has played at home, they have been only able to collect three points.\n\n\n\nIt was long-time Ethiopian veteran Oumed Oukri who ran the show in Hadiya Hossana’s win against home side Adama City. A lack of defensive awareness on a set-piece from Adama saw Oukri score the first goal as Abdissa Jemal and Addis Tesfaye failed to deal with a header from a free-kick. This allowed Oukri to get a shot off for the opener. Oukri was also instrumental in the 86th-minute winner as it was his run that created the chance for Ramkel Lock’s goal. A positive note for Adama was that Striker Ame Mohammed has managed to score a goal in his second consecutive game.\n\n![](/images/uploads/img-20220422-wa0003.jpg)\n\n> *Oumed Oukri (Image: Ethiopian Premier League Share Company)*\n\nSince their last impressive performance (a 3-1 win against Dire Dawa), Adama has had the tendency to feature in dull games: part of their five-game winless runs have been two one-all and two nil-nil draws. Still, there are positives to take from Adama’s recent games, as it displays that Adama are difficult to beat. Adama are always competitive in the matches they play and with a little work, could emulate the style of wins that Welayta Dicha have produced this season to get up to fourth.\n\n\n\n## Addis Abeba and Adongo Show Signs of Growth\n\n\n\nAfter what was a poor showing in Dire Dawa, Addis Ababa have looked more at home in Adama. While the capital city side have not set the world alight in this round of fixtures, five points from four games is an improvement from the performances the team was displaying in Dire Dawa, where they collected 3 points from five games. Richmond Adongo has been a key player for this Addis Abeba side. One of the hottest strikers in the league at the moment, the Ghanian has scored four goals in his last three games. He is now on nine goals and is the second top scorer in the league.\n\n![](/images/uploads/richmond2.jpg)\n\n> *Richmond Adongo Celebrates a Brace (Image: Ethiopian Premier League Share Company)*\n\nAddis’ opponents were a Fasil side in transition,  separating from title-winning coach Seyoum Kebede and now under interim coach Hailu Negash. Fasil’s leaky defense enabled Richmond Adongo to grab a brace. Fasil were much brighter offensively, with the dangerous duo of Surafel Dagnatchew and Okiki Afolabi involved in both goals as the former created the chances for the two goals and the latter put the ball in the back of the net on both occasions.\n\n\n\nAddis Abeba’s renewed form has put some distance between themselves and the bottom two of Jimma and Sebeta by seven points. It consequently has tightened the race to avoid the last relegation spot. Defense Force and Dire Dawa are only one point away from Addis and teams all the way up to seventh-placed Hadiya are not safe either as they are only a maximum of five points away.\n\n\n\n## Ethiopia Bunna Resurgent \n\n\n\nEthiopia Coffee look to be on the right track with back-to-back wins after what was a long spell of poor result for  Kassaye Arage’s side. Prior to these wins against Welayta and Sebeta, Ethiopia Coffee were on a five-game winless streak. The most memorable of these defeats included a 4-0 mauling from arch-rivals Saint George.\n\n![](/images/uploads/img-20220422-wa0002.jpg)\n\n> *Bereket Amare On His Way to His Second Cleansheet (Image: Ethiopian Premier League Share Company)*\n\nThe difference in their latest match against Welayta was Robel Teklemichael, who scored following a deft cross from Abubekir Nassir. William Solomon also played a big part in creating the goal through his run on the wing.  Ethiopia Coffee’s man of the match however would have to be Goalkeeper Bereket Amare, who helped his side get all three points by shutting out Welayta’s many dangerous attempts. Bereket Amare has impressed since coming off the bench and into the starting eleven to replace Abel Mamo after the veteran goalkeeper faced a troubled spell. So far Amare is proving to be a good fit for Coffee as they have won both matches with him in the starting eleven, conceding zero goals in the process. No doubt, it will not be long before this young keeper catches the eye of Wubetu Abate and the national team.\n\n\n\nCoffee are still underperforming in comparison to the goals they set for themselves at the beginning of the season, currently being positioned in sixth place and fourteen points away from 1st place Saint George. The aim for Kassaye may be a repeat of last year’s position of second place. This goal may prove lofty, with second place currently being occupied by Hawasa seven points away. If Amare can keep up his bright start and Abubekir Nassir can keep up his goal contributions (he is currently at 10 contributions after the latest game), Coffee fans can be more hopeful about how they finish the season.",
  "slug": "bkethpl-gameweek-19-in-review",
  "thumbnail": "/images/uploads/img-20220422-wa0000.jpg"
}