{
  "layout": "blog",
  "date": "2022-05-11T02:11:13.341Z",
  "title": "BKEthPL Gameweek 22 In Review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "body": "## Bahir Dar Vs Welayta Dicha\n\nBahir Dar went into game week 22 hoping to utilize their home advantage to improve their form, in contrast to previous home sides Adama City and Dire Dawa City, whose form deteriorated on their home grounds. Bahir Dar City have been underwhelming this season, with the team failing to push on following Abraham Mebrahtu’s hire after finishing what was perceived as a disappointing 7th place last season. Bahir Dar have only regressed further this season, as they are currently sitting in 10th place. Welayta on the other hand were looking to rekindle some of the impressive form they displayed in Dire Dawa that has since fizzled out. Welayta were just three points off of Saint George at the end of games at Dire Dawa, by the end of the games in Adama, this gap widened to 13 points after collecting only three points the entire round.\n\n![](/images/uploads/bahir-welayta.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n The game was one of few opportunities in the early stages, with hardly any clear-cut chances created in the first 30 minutes. Welayta missed the best chance of the half in the 45th minute. This chance was created as a result of a good counter, with Kalkidan Zelalem making a run and then chipping the ball to Yared Dawit who was too awkwardly positioned to put the ball into the empty net. The early stages of the second half were characterized by a similar dearth of goalscoring opportunities, with the game not opening up until the final thirty minutes. Ali Sulieman nearly chipped the ball over the keeper after the end of a patient move by Bahir Dar in the sixty-fourth minute. Defender Fetudin Jemal was one of Bahir Dar’s biggest threats on the day, with the player running from deep into space with the ball and shooting from range twice and getting close on both occasions(one of these efforts hit the post). The Welayta keeper Tsion Merid was particularly busy in the latter stages of the game as he saved three well-worked attempts from Bahir Dar (with Fitsum Alemu and Temesgen Derese causing the most problems).\n\n\n\n## Adama City vs Saint George\n\n\n\nAdama City, who have just completed a torrid spell of games at their home city at the Adama Science and Technology University Stadium, had the opportunity to have a fresh start this week as they played away from home for the first time in five games. Unfortunately for them, their first away game was against the best team in the league, Saint George. The Horsemen had only dropped two points from their last five matches prior to this game, whereas Adama have only managed to get 3 points in the past five, which is relegation form.\n\n![](/images/uploads/saint-george-adama.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nIn what is becoming a trend, Saint George opened the scoring from a Henok Adugna set-piece delivery. The fullback’s free-kick was redirected by Amanuel Gebremichael before being flicked goalwards by Canaan Markneh, who scored in his second match in a row. Adama were given a huge chance to equalize when Mignot Debebe had a loose touch on the ball which allowed Ame Mohammed to intercept and Abubekir Wondimu the space to shoot on the left, Saint George keeper Lukwango Charles was alert to the threat and came off his line to block the attempt. Saint George continued to threaten throughout the first half, with Amanuel Gebremichael proving dangerous on the break and Henok Adugna whipping in dangerous set pieces, but good work from Adama keeper Sakuba Kamara and his defense kept them out. It was all Sidama after the fifty-minute mark. Most of these shots came from outside the box via Sidama’s main threat on the day Dawa Hotessa. Saint George’s threat on the counter never subsided; however, this gave the horsemen a hattrick of chances to wrap the game up. A good long ball from deep by Natnael Zeleke reached Gebremichael, who set up a shot in the box via a clever backheel but Kamara saved the shot from Bereket Wolde. Gebremichael set up another chance towards the end of the match, this time for Dagmawi Araya and Bulcha Shura who failed to convert. Luckily for the horsemen, one goal was enough on the day.\n\n\n\n## Fasil Kenema vs Sidama Bunna\n\nWith Saint George running away with the league title, clubs at the top are now aiming to book their place in continental competition via a second-place finish. Fasil, Hawassa, Welayta, and Sidama seemed finely poised to compete for second place as they were all within a point of each other before Fasil and Sidama faced each other.\n\n![](/images/uploads/fasil-v-sidama.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nThe game between the two sides was one of two halves where Sidama Bunna had the better showing in the first half but were in turn dominated in the second. Yigezu Bogale was on the end of the best opportunities to score for Sidama, as he fluffed an excellent one-on-one with the keeper in the twenty-third minute. Yigezu came close again after receiving a cross while being free in the box but it just was not the striker’s day and his shot went wide. The usually deadly Bezabih Meleyo hit his shot directly at the Sidama Goalkeeper Teklemariam Shanko in the sixty-fourth minute. Fasil’s goal finally arrived in the seventy-fourth minute with the aid of a little fortune. Bereket Desta's shot deflected favorably towards Fikadu Alemu in the box, who redirected the ball towards the back of the net. \n\n## Hadiya Hossana Vs Mekelakeya\n\nBiniam Belay had a brilliant match pulling the strings as he led his Defense Force side to victory. The wide player created the first goal via a clever through ball for Israel Eshetu, who caressed the ball past Girma Bekele. Biniam Belay registered his second assist of the game via an inswinging corner, which Addisu Atula headed in for the second goal. Hadiya Hossana did not go down without a fight, however. Samson Tilahun assisted Habtamu Tadesse for a goal, but this was not enough for a comeback.\n\n![](/images/uploads/defense-hadiya.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nDefense Force and Hadiya have similar form over the past five games, with both registering eight points. This is a positive development for Defense force and their quest to distance themselves from relegation. They have now put five points between them and the relegation zone. How the 9-12th placed positions develop will be fascinating to watch as the teams are all separated by a single point and with big teams such as Adama and Bahir Dar occupying these spots.\n\n\n\n<!--EndFragment-->",
  "slug": "bkethpl-gameweek-22-in-review",
  "thumbnail": "/images/uploads/74419593_2327028597407967_5636164107980767232_n.jpg"
}