{
  "layout": "blog",
  "date": "2022-06-18T04:16:04.354Z",
  "title": "BKEthPL Gameweek 26 In Review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "body": "> *(Image: Ethiopian Premier League Share Company)*\n\n## Saint George Vs Bahir Dar\n\nComing into the game, Bahir Dar was looking to at least put up a strong end to what has been an abject season. The side was expecting to push on from last season’s seventh-place finish after the appointment of former National Team manager Abraham Mebrahtu as well as the acquisition of several strong signings such as Ali Sulieman. Saint George have had an impressive season so far but were at the risk of letting their commanding grip over first place slip if they were to drop additional points. Saint George will have been affected by the short resting period for their players who are part of the Ethiopian National Team. The Walias registered a historic win over Egypt just four days prior to this game. Leaders Saint George had Mignot Debebe, Gatoch Panom, and Amanuel Gebremichael in the starting eleven of the side that beat Egypt, while Bahir Dar Kenema only had Fasil Gebremichael. It was perhaps not a coincidence that it was one of the players that was not away on international duty, Osei Mawuli, who was one of the top performers on the day.\n\nThe Ghanian was particularly dangerous in the early stages of the first half, with the Saint George defense affording Mawuli too much space outside the box which enabled the forward to attempt dangerous shots.  He forced a good save from the George keeper Lukwago Charles in the 9th minute. Mawuli found himself in a similar situation in the 28th minute after an excellent interception high up Saint George’s half by Alelign Azene. Mawuli beat the keeper this time to score the opener. Mawuli was still hungry for more goals, and came close yet again just four minutes later, receiving the ball from a cutback from the right before producing an outswinging shot that peeled just wide away from goal.\n\n![](/images/uploads/bahir-dar-vs-saint-george.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nSaint George were gifted a way back into the match as Fasil Gebremichael rashly went off his line in an attempt to control a loose ball. Fasil instead spilled the ball for Cherinet Gugsa, who was in turn brought down by Ali Suleiman in the box. The referee pointed to the spot and Haider Sherifa scored the leveler from the resulting penalty kick.\n\nSaint George continued allowing Mawuli space in the second half, as the Ghanian continued to be a threat. Yet another shot from outside the box from Mawuli from outside the box in the 49th minute was not far off the mark. On the whole, Saint George were more assertive in the second half. In the 53rd minute, Saint George were gifted a golden opportunity via a poor backpass from Ali Suleiman fortunately for the Horsemen, Amanuel Gebremichael did not have his shooting boots on as he blasted the ball wide from inside the box. \n\n![](/images/uploads/k.markneh.jpg)\n\n*(Image: Ethiopian Premier League Share Company)*\n\nSaint George piled on the pressure in the 60th minute as they pushed their players into the opposition's half, this culminated in a good cross in from Suleiman Hamid. This cross bypassed Fasil Gebremichael who was yet again poorly positioned to deal with an aerial ball which allowed Kanaan Markneh to put the ball into an empty net.  There were still more twists to be had in the game, as in the 76th minute Girma Dissasa was brought down by Saint George’s Abel Yalew as he was getting inside the box. Mawuli scored his second goal to level the game from the spot-kick.\n\nThe result sees Saint George's lead over Fasil Kenema narrow to just 3 points after the Emperors won their game later on in the week. The league leaders are 3 points ahead with four games left to go, a position that looks perilous, especially in contrast to the comfortable situation the Horsemen were in a few months ago with Saint George 10 points ahead with 9 games to go. 7 points dropped from their past five games in addition to the six consecutive wins that Fasil Kenema have strung along under interim coach Hailu Negash has seen this lead narrow. A major contributor to Saint George’s dip in form is the decrease in their goalscoring output:  the Horsemen have scored  4 goals in their last five compared to the 11 goals that they scored in the five games before that. This draw does not really change much for Bahir Dar. Mebrahtu’s team is still only two points above the relegation spots, a big issue for this side is one of consistency. Bahir Dar has not been able to pick up consecutive wins since matchday seven. In fact, Bahir Dar owe much of their current point tally to the opening seven weeks as they collected 13 of their total of thirty points in this time period.\n\n![](/images/uploads/bahir-dar-vs-saint-george-2.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## **Sidama Coffee vs Arba Minch City**\n\nBoth sides came into this match with similar form: Sidama collected 6 points in their last five games whereas Arba Minch collected 5 points in this time period. Sidama won their last two games following their decision to sack head coach Gebremedhin Haile. \n\nArba Minch started the game dangerously, Erick Kapayto claimed that he was clipped by Firew Solomon in the 6th minute but these claims were waved away by the referee. Sidama had the better of the chances in the first half.  Yigezu Bogale in particular looked dangerous for Sidama, as he received a good through ball from Firew Solomon in the 17th minute which allowed him to run with the ball for a one-on-one with the keeper. His attempt to place the shot was tame and close to the keeper. The chances kept arriving as Bogale got yet another in the 27th minute, this time it was a through ball from the left-hand side. Bogale peeled away from the defense and attempted to take advantage of Tegegn's positioning off of his line by chipping the ball over him. His chip never had enough height to threaten the keeper. Sidama continued to litter the Arba Minch goal with relatively inoffensive shots throughout the first half. Another instance of this was Yakub Mohammed finding himself free in the Arba Minch box only to direct his header straight at the Arba Minch keeper Yisak Tegegn in the 30th minute. Despite all this pressure from Sidama, it was Arba Minch that drew first blood in the 32nd minute. Endalkachew Mesfin delivered an excellent early cross deep from the midfield on his left-hand side, Eric Kapayto was able to get a good leap and redirect the ball towards the back of the net.\n\n![](/images/uploads/arbaminch-vs-sidama.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nArba Minch was only able to hold their lead for four minutes, as Arba Minch switched off when Sidama took a quick free-kick. This allowed Melaku Elias enough space on the right to cut the ball back from the byline. This cross made its way to Saladin Seid, who was never going to miss from close range. The first half continued its hectic latter stages as a loose touch from Yakubu Mohammed in his own defensive third was then followed by a rash tackle in the penalty by Mohammed as the center-back overcommitted in an attempt to regain the ball. The keeper nearly got to the end of the penalty, but Kapayto had too much power on it for his second goal. Yakubu Mohammed made the game even more difficult for his side when he picked his second yellow card in the 55th minute. Saladin nearly equalized with an excellent attempt from a tight angle after a good long ball from Dawit Tefera, but his low volley was dragged just wide of the far post in the 63rd minute. \n\nThis is a massive three points for Arba Minch City, as it has lifted them two places up to seventh place. Perhaps even more importantly, they are now 6 points away from the relegation zone with just four games to go, putting themselves in a comfortable position for the rest of the season. Sidama does not have much to play for at this point in the Season. Second place, which is a ticket to the CAF Confederation Cup, is 12 points away whereas they are almost mathematically guaranteed to stay up this season.\n\n![](/images/uploads/arba-minch-vs-siama-2.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## **Ethiopia Coffee Vs Adama City**\n\nEthiopia Coffee went into the game against Adama City facing the same issues as Saint George, with a number of its important players playing this match with minimal recovery time after duties with the Ethiopian National Team. Abubekir Nassir, Asrat Tunjo, and, Amanuel Yohannes all started for the Walias the previous week, while Dawa Hotessa missed this game for Adama after picking up a knock on international duty.\n\nAdama City had the better of the chances in the early stages of the game, taking advantage of the space that Ethiopia Coffee’s highline created to pump in through balls for their pacy attackers. This was how Adama’s first goal was created as a long ball from deep in their own half by full-back Jemil Yakob bypassed the entire Coffee defense and made its way to Ame Mohammed who slotted the ball into the back as early as the first minute. Adama created a similar type of chance in the 7th minute, this time the long ball originated from the middle of the park. Abdissa Jemal utilized good pace to get on the end of a ball launched by Tsigeab Yosef but his shot went wide of the far post.\n\n![](/images/uploads/bunna-vs-adama.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nEthiopia Coffee made it back into the game after a poor first ten minutes. Good link-up play for Bunna between Abel Endale, Amanuel Yohannes, and Abubekir Nassir culminated in a clever flick from Nassir towards Endale in a promising position inside the box, but the forward could not apply power or good placement on his effort. Endale and Nassir linked up again in the 32nd minute, with Endale turning provider this time. Coffee’s number 9 chipped a ball into the box, Nassir did well to leap and land a solid header on the cross but the effort was too high as the ball smacked the crossbar.\n\nAdama could have blunted Coffee’s momentum and killed the game in the 60th minute when another through ball (this time from Abdissa Jemal) put Ame Mohammed through in another one-on-one with Coffee keeper Bereket Amare, this time the striker could not keep his effort on target as he blasted his effort over the post. Things went downhill for Adama from here: a self-inflicted wound led to the Bunna opener as a poor backpass by Yohannes Geremey put Alazar Shimelis through with the keeper. Shimelis elected to pass it to Nassir who had an easy tap-in goal. The second goal was created by Nassir’s individual brilliance as Nassir turned two defenders inside out on the left half-space before placing his shot past Adama keeper Sakuba Kamara after Tunjo put the striker in via a clever through ball. \n\n![](/images/uploads/nassir-vs-adama.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nThis result leaves Adama City perilously close to the bottom three, with Adama just three points away from the relegation zone. The only solace for Adama will be that there are currently three teams between them and the drop zone. Looking at the last five matches played, all these teams have collected a similar amount of points: Addis Ababa City having the best points tally with seven, Dire Dawa and Bahir Dar with five points, and Adama City having the lowest points at four. All signs indicate that the race to avoid relegation could go down to the wire this season. Ethiopia Coffee continued their resurgence in late-season form with this result, making it four wins in five. Nassir is now the joint top scorer in the league after his brace.\n\n<!--EndFragment-->",
  "slug": "bkethpl-gameweek-26-in-review",
  "thumbnail": "/images/uploads/bahir-dar-fans-v2.jpg"
}