{
  "layout": "blog",
  "date": "2022-04-05T02:14:42.537Z",
  "title": "Can Ethiopia Coffee derail St. George's undefeated streak in the Sheger Derby?",
  "body": "> *(Image: Ethiopian Premier League Share Company)*\n\nThe first day of Ethiopian Premier League game week seventeen action pits the two Addis Ababa giants Saint George and Ethiopia Coffee against each other in the Sheger Derby. The gap between the two rivals is the widest it has been in a long time, with Saint George sitting at the top of the league table, thirteen points ahead of Coffee. Few could have predicted how divergent the fates of the two teams would be at the beginning of the league campaign, with both teams finishing only a single point off of each other at the end of the 2020/21 season. If anything, Ethiopia Coffee were favored to improve on last season's results as they had some stability with legend-turned-manager Kassaye Arage at the helm. He established a brand of football that is possession-based, with star player Abubekir Nassir leading the lines. \n\n![](/images/uploads/bunna-fans.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nOn the contrary, Saint George had a volatile managerial situation in recent years, with Ernst Middendorp, Mahir Davids, and Zlatko Krmpotic all having brief stints at the club. With the hiring of Zerihun Shengata as interim manager in late 2021, things began to look up. Zerihun was with the youth set-up before being elevated to vice manager in March 2021. Despite his impressive tenure at the club, Zerihun's future as a potential permanent manager remains uncertain. Saint George are expected to decide on a manager at the end of the season. Ethiopian National Team coach Webetu Abate has been linked to the job but has extinguished the rumors by saying his focus is only on the national team.\n\n![](/images/uploads/img-20220405-wa0009.jpg)\n\n**Form**\n\nIn the past five games, Saint George have collected eleven points with a goal difference of +8, placing them second among all teams in this period. Ethiopia Coffee have collected six points in the past five games with 0 goal difference (ninth in the league for this period). \n\nCoffee have remained committed to Kassaye's possession-based play, with an average possession of 60% over their last five matches. They are not creating many chances with this possession though, producing only 1.8 shots on target per match while conceding 3 shots on target over the same period. On the other hand, the Horsemen averaged 6.6 shots on goal per game and allowed 3.4 shots on goal. Saint George has scored eleven goals in the last five games, making them the league's top scorers.\n\n![](/images/uploads/img-20220405-wa0005.jpg)\n\nCoffee head into this derby with no wins in their last four games, with three games ending in draws. Saint George rebounded from two consecutive draws with two wins in a row, and the Horsemen are looking to make it three to hold off an impressive Welayta Dicha, who are only three points behind the leaders. Their most recent fixtures saw Saint George extend their lead at the top of the table with a 3-1 win over Sebeta City while Coffee had to settle for a 1-1 draw with Sidama Coffee.\n\n![](/images/uploads/img-20220405-wa0007.jpg)\n\n**Previous Matchups**\n\nThe Horsemen have extended their dominance into recent matchups as well, winning three of their last five matches against Coffee. Ethiopia Coffee have only managed to win one of their last five games against Saint George. This win came in a thrilling 3-2 victory last season. Coffee fans will be hoping that Abubekir Nassir will be able to replicate his performance from that win where he scored a hattrick. The 21-year-old has been having a solid season, netting eight-goal contributions despite his side's lackluster season. \n\n  A player that Ethiopia Coffee will have to look out for is Haider Sherifa. The midfielder tends to show up against Coffee, with him scoring a brace in his last game against them (a 4-1 win in week 2 of this season). Sherifa has also been picking up form as of late, with two assists registered in his last two games.\n\nSaint George have been historically dominant in head-to-head matchups, winning twenty of the forty-three matches. Ethiopia Coffee have managed to win seven of these matches. Today’s game will be special in that it will be one of the few Sheger Derbies to be played outside the capital. Adama Science and Technology Stadium will host the passionate fans of Coffee and Saint George for the match on April 5th, 2022 at 3 PM East African Time.",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "slug": "can-ethiopia-coffee-derail-st-georges-undefeated-streak-in-the-sheger-derby",
  "thumbnail": "/images/uploads/img-20220405-wa0003.jpg"
}