{
  "layout": "blog",
  "date": "2022-04-08T02:32:15.010Z",
  "author": "Brook Tefera @Bk_tefera",
  "body": "\n\nAddis Ababa has been making preparations to receive one of the most prestigious club competition trophies this coming Sunday with the UEFA Champions League Trophy making its way to the Ethiopian Capital. The trophy will be accompanied by Dutch and AC Milan Legend Clarence Seedorf. \n\nThe prestigious trophy will be on display at Sheraton Addis on Sunday, April 10th. Heineken, a long-time sponsor of UEFA’s flagship competition, has organized a tour of the trophy spanning over 30 countries throughout Africa, Asia, North America, and South America. According to the event's organizers, the trophy will be on display in Addis Ababa for only the second time.\n\n![](/images/uploads/img-20220407-wa0000.jpg)\n\nThe first instance that the trophy made its way to Addis Ababa was in 2018 when Brazilian legend Ronaldinho toured the capital alongside the trophy. The Brazilian icon was given a hero’s welcome upon his arrival at Addis Ababa Stadium. He played with the Ethiopian Under-20 national team for a short match after which he greeted and mingled with jubilant football fans in the stadium. \n\n![](/images/uploads/img-20220407-wa0002.jpg)\n\n\n\nSimilarly, Seedorf will participate in an exhibition match alongside retired Ethiopian footballers and the Under-23 Team at Abebe Bikila Stadium. After completing a one-day stay in Addis, the UEFA Champions League Trophy will travel to Nigeria. The organizers hope such events will encourage young players to pursue careers as professional football players.\n\nSeedorf is considered one of the most successful players in UEFA Champions League history. Not only is the Dutch player a four-time UEFA Champions League winner, he is also the first (and currently only) player to have won the Champions League with three different clubs – once with Ajax in 1995, once with Real Madrid in 1998, and twice with AC Milan, in 2003 and 2007. A product of the famed Ajax Youth Academy, Seedorf made his professional debut at the age of 16. He has made 87 appearances for the Dutch National Team and has won 20 major club trophies.\n\n![](/images/uploads/img-20220407-wa0001.jpg)\n\nAddis Ababa is not a stranger to these trophy tours, as Coca-Cola has held two World Cup tours in 2010 and 2018. The FIFA World Cup trophy was put on display for observers at Millenium Hall instead of Sheraton Addis, the selected venue for viewing the Champions League trophy.\n\n\n\n\\*\\*This Article is not a paid promotion. Doors will open at 1 PM East African Time and a ticket is required to attend the event. Contact the event organizers for tickets.\n\n\n\n<!--EndFragment-->",
  "title": "Clarence Seedorf and UEFA Champions League to arrive in Addis on Sunday",
  "slug": "clarence-seedorf-and-uefa-champions-league-to-arrive-in-addis-on-sunday"
}