{
  "layout": "blog",
  "date": "2022-03-26T21:44:43.085Z",
  "body": "Comoros beat Ethiopia 2-1 in an entertaining return from AFCON from both sides.\n\n<!--StartFragment-->\n\nThe Indian Ocean island nation welcomed Ethiopia for the first time in an international friendly on Friday. The tropical rain did not stop fans who were excited to see their team for the first time on the pitch after their historic AFCON performance.\n\n\n\nEthiopian Head Coach Wubetu Abate made four changes to the lineup from the last game against Burkina Faso. Fasil Gebremichael replaced Teklemariam Shanko between the sticks. Mignot Debebe got the nod ahead of Aschalew Tamene who has been having an underwhelming season with his new club Fasil Kenema. Shemeles Bekele returned to captain the Walias in the absence of Getaneh Kebede. Kebede’s absence was filled by the winger Amanuel Gebremichael. Abubeker played in his preferred striker position only for the second time for the national team. Wubetu also gave a much-anticipated debut for youngster Bereket Desta,  who has been having his breakout season at Fasil Kenema. One of the biggest changes brought under Abate’s tenure has been the trimming down of the average age of the Walias’ squad. \n\n\n\nCheered on by a packed stadium, the home side got off to a perfect start as Faiz Mattoir scored from inside the box to give Comoros the lead in the seventh minute. The Walias could not overcome the early momentum and pressure from Comoros and a woeful clearance from the Ethiopian defense saw the ball drop in front of Mattoir, who converted with a skillful half volley. Following the goal, Wubetu’s front three of Abubaker Nassir, Dawa Hotessa, and Amanuel Gebremichael proved to be a dangerous trio and gave the hosts all manner of problems in attack. The forwards consistently showed good combination play but failed to find the finishing touch on multiple occasions. The new national team captain, Shemeles Bekele played a key role in getting the ball to the forwards out wide, with Dawa Hotessa consistently dropping deep to drag defenders out of position and create space behind the Comoros backline for Nassir and Gebremichael to run into.\n\n\n\nAbubaker Nasir had one of the best chances of the match unfortunately, the Ethiopia Coffee striker’s shot was tame which allowed the goalkeeper to save the attempt with ease. Moments later, Amanuel Gebremicheal also wasted a glorious chance for Ethiopia as his shot hit the side netting from a good scoring position. The first half ended with only one goal with the Walias feeling that they should have scored a goal.\n\n\n\nAs the match wore on, Ethiopia ran out of ideas. Comoros, who were good on the transition, seized an opportunity in the 68th minute to double the lead. Abdallah Mohammed had the space and time to lash his shot from the corner of the penalty box. The shot took a slight deflection which wrong-footed goalkeeper Fasil Geberemichael to creep into the net. \n\n\n\nThe final 25 minutes saw Comoros pegged back by the Walias’ dominance on the ball, nerves had kicked in after the second Comoros goal however and Ethiopia's finishing had become erratic. Ethiopia's dominance finally paid off in the 80th minute when Surafel Daganchew shot an absolute rocket from distance, which left the Comoros goalkeeper with no chance. The final minutes were tense for Comoros and its home fans as Ethiopia were continually threatening  Comoros’ defense. It was to no avail, however, and the match ended 2-1.\n\n\n\nEthiopia’s head coach Wubetu Abate was asked about his team's performance and plan going forward following the match. He replied to the local media “we aim to qualify for the 2023 African Cup of Nations. That is why I wanted to give a chance to the young players in the squad to gain experience. Despite the result, I think we played well. Conceding early gave our opponents confidence and we could not convert the chances we created. I am pleased with the performance of the team. Our efforts deserved more than the scoreline.”\n\n\n\n\n\n<!--EndFragment-->",
  "title": "Comoros Edge past Ethiopia in Free Flowing Friendly",
  "author": "Ebawak Tesfaye @negussu_",
  "slug": "comoros-edge-past-ethiopia-in-free-flowing-friendly",
  "thumbnail": "/images/uploads/img-20220326-wa0001.jpg"
}