{
  "layout": "blog",
  "date": "2022-06-09T01:17:00.515Z",
  "body": "> (Image Source: EFF)\n\nThe Walias' domination of the ball was in vain on Sunday as Ethiopia’s 73% possession was not enough to avoid defeat against Malawi’s flames courtesy of two first-half penalties by Orlando Pirates striker Gabadinho Mhango.\n\n\n\nThe pressing questions that were facing the team before the start of the qualifiers still remain unanswered. It has been four months since the Walias returned from AFCON, yet Wubetu still has not found balance in his team selection. The head coach will feel hard done by as his side's good performance was betrayed by two penalties conceded via needless tackles from his two center backs.\n\n\n\nWubetu's squad has significantly been altered from the one he picked for AFCON 2021 (with more than one-third of the squad being replaced), yet the starting eleven for Sunday's game was more or less unchanged from the one used in last year's tournament. The two major exclusions are Aschalew Tamene, who has been replaced by Mignot Debebe, and the omission of all-time leading scorer Getaneh Kebede from the selection. The former Captain's absence is due to a 'communication breakdown between the pair' as per Wubetu. Aschalew has been lackluster this season, the Fasil Kenema defender has been unable to pick up his form after his move away from Saint George. \n\n![](/images/uploads/img-20220608-wa0006.jpg)\n\n> (Image Source: EFF)\n\nFasil Gebremichael’s selection as starting keeper on Sunday will be a move that perplexes many. Fasil has been pushed out of his starting spot at club level by Abubeker Nuri. He was not match-fit and not ready to represent Ethiopia on Sunday. Although Wubetu does not have a large or even a good pool of goalkeepers to choose from, his decision to go with Fasil was not rewarded seeing as the goalkeeper failed to make simple and successful passes under pressure during build-up play; he lost possession numerous times throughout the game. A calm and collected goalkeeper who is good with his feet and can find a pass to break the opposition's line of press is required in Wubetu's possession-based system.  \n\n\n\nDuring Wubetu's tenure, the goalkeeping department has been chopped and changed constantly. Fasil Gebremichael is the only AFCON 2021 returnee, while former starting keeper Teklemariam Shanko and veteran Jemal Tassew have been sidelined due to a dip in form and age respectively. Bereket Amare and Dagim Tefera, the replacements, play in clubs where they are comfortable playing out of the back. The lack of experience from these two keepers may be a factor that limits Wubetu’s confidence in putting them into the starting eleven in the near future.\n\n\n\nA goalkeeper who has an assured defensive unit in front of him will have the comfort and confidence to make the right decisions. Yared and Mignot Debebe on Sunday did not work as neither complemented each other as a central defensive partnership. Mignot did not compensate for Yared's sluggish pace, nor did Yared compensate for Mignot's lack of defensive awareness. Both do not possess the aerial prowess needed to play a high line, and Mignot's role in the build-up was minimal. The pair were at fault for both goals scored on Sunday as they both conceded penalties after rash challenges. It is to be recalled that Yared was sent off in the opening game of AFCON against Cape Verde for a last-man tackle. Similarly, on Sunday, both Yared’s and Mignot's lunging tackles inside the box lead to two unnecessary penalties in the first half. Ethiopia’s midfield did not help the center backs as the midfield did little to shield or contest the direct balls that led to these dangerous situations in the penalty box.\n\n![](/images/uploads/img-20220608-wa0004.jpg)\n\n> (Image Source: EFF)\n\nThe issues were not limited to the defensive unit. In the first half, the midfield also struggled to help the defense build out of the back and, as a unit, looked a little bit off in possession. Further up the pitch, the team lacked penetration. Mesud Mohammed and Surafel Daganchew made way for Gatoch Panom and Shemeles Bekele after halftime, which led to the Walias progressing the ball quicker. Malawi sat deep and remained compact against the Ethiopians as they were probably aware that the Walias typically struggle against opponents that set up this way. Employing Gatoch in a more defensive role gave the team a little bit of a different dynamic. Gatoch is one of the best defensive midfielders in the Ethiopian Premier League and one of the few players that has the strength and physicality needed to control the middle of the park. However, his utilization under Webetu has been minimal. The 45-minute outing on Sunday was his first appearance in a competitive match for the Walias. At the club level, Gatoch is having an outstanding season with Saint George and looks to have settled into the BetKing Premier League after returning from his foreign football journey which saw him play in Russia and Egypt. \n\n\n\nEthiopia has some good news for the game on Wednesday as Liverpool superstar Mohammed Salah will be out for their game with a hamstring injury. Defender Hadi El-Medini is also a doubt for the Egyptians. On the Ethiopian side, Surafel Dagnatchew has been ruled out of the game whereas Yared Baye may also be a doubt. Egypt and Malawi both top the group with three points whereas Ethiopia are stuck at the bottom alongside Guinea with 0 points. The Walias' quest to secure their first point/s for this campaign will be made harder by the fact that they will not be able to play on home soil. Ethiopia will instead remain in Malawi to host the Egyptians at Bingu National Stadium after Bahir Dar Stadium’s CAF accreditation was stripped.",
  "title": "Does Ethiopia Have What it Takes to get past the Pharaohs?",
  "slug": "does-ethiopia-have-what-it-takes-to-beat-the-pharos",
  "author": "Ebawak Tesfaye @negussu_",
  "thumbnail": "/images/uploads/img-20220606-wa0001.jpg"
}