{
  "layout": "blog",
  "date": "2022-02-18T02:23:26.565Z",
  "title": "Early Blitz Enough for Mekelakeya to See off Adama City",
  "slug": "early-blitz-enough-for-mekelakeya-to-see-off-adama-city",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "thumbnail": "/images/uploads/mekelakeya2.jpg",
  "body": "> *Addisu Atula celebrates scoring the opening goal(Image: Ethiopian Premier League Share Company)*\n\nMekelakeya's dominant twenty-minutes was enough to beat Adama City on the third day of BetKing Premier League action.\n\nMekelakeya looked in worrying form three weeks ago, with no wins in five games and being only four points away from the bottom two. They had shown improvements in recent games (gaining points against Wolkite and Sidama) and hoped to carry this positive streak against Adama. Adama meanwhile, were looking to shake off their habit of drawing games this season, with eight(61%) of their games this season ending in stalemates. This would be a much tougher proposition for Adama with Top Scorere Dawa Hotessa injured. \n\nMekelakeya had a flying start to the game with a header by Girum Hagos ending up in the back of the net within the first minute, it was disallowed for a foul which looked to be the wrong decision on replays. Mekelakeya were again denied a goal-scoring opportunity in the eighth minute, with the Official waving away penalty calls when Teshome Belachew looked to be clipped. \n\nMekelakeya did not have to wait too long to get their goal though. A cleverly worked free-kick routine led Adama keeper Jemal Tassew to spill his shot, leaving it to Addisu Atula to skillfully volley the shot into the back of the net in the tenth minute of the match.\n\nMekelakeya continued to have the best chances of the first half, with most of these opportunities continuing to be created by set pieces. Girum Hagos looked threatening twice from direct free-kicks in forty-ninth and fiftieth minutes.\n\n![](/images/uploads/adama1.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nAdama improved in the second half, with the team coming closest to a goal in the sixtieth minute when a blistering shot from Yoseph Yohannes from quite a distance struck the crossbar.\n\nAbdissa Jemal was able to put in a good shift as a target man for Adama in the second half causing Mekelakeya problems by getting on the end of long balls and crosses. The striker came particularly close to scoring in the Eighty-Eighth and ninetieth minutes.\n\nAdama will have to look below them when they face twelfth-place Dire Dawa City, a loss to them could see Adama pulled closer into the relegation spots.  Mekelakeya meanwhile will face a tough challenge in the next Gameweek, playing an in-form Hawassa City."
}