{
  "layout": "blog",
  "date": "2022-08-25T20:58:18.856Z",
  "title": "Ethiopia faces off with Rwanda for a place in CHAN 2023",
  "body": "Ethiopia is 180 minutes away from qualifying for the African Nations Championship (CHAN) for the first time since 2016. The Walias cruised past neighbors South Sudan with a 5-0 win over two legs to advance to the final round of qualifiers. Rwanda on the other hand automatically qualified for the last phase with 13 other countries. The final tournament is set to take place in Algeria from the 8th to the 31st of January 2023. \n\n\n\nDue to ongoing CAF sanctions on Ethiopia's stadiums, the first 'home' match on August 26th will be at the Benjamin Mkapa Stadium in Dar es Salaam, Tanzania. The Ethiopian National team has used this Stadium as a home ground for most of this calendar and have registered two wins against South Sudan and Egypt here.  The return leg will take place in Huye, Rwanda on September 3rd. \n\n![](/images/uploads/271997042_2124050251109907_6369249449958584988_n.jpg)\n\n> Source: EFF\n\nThe two teams are closely positioned to each other in terms of the FIFA World Rankings. Rwanda ranks slightly higher at 135 while Ethiopia is the 137th best team in the world. Rwanda have struggled as of late, failing to win any of their last 5 competitive games: the team drew once and lost the remaining four. Form thus seems to be on the side of the Ethiopian National Team who have two wins and one draw in their last five competitive games, with one of these wins being a historic victory over the Egyptian National Team. \n\n\n\nThe Walias have been preparing in Adama ahead of the first leg on Friday. The EFF was able to secure two friendly matches against Uganda in early August. In the first game, Ethiopia were able to beat Uganda 1-0 through Bezayew Meleyo's last-minute goal while drawing the second game 0-0. Ethiopia’s recent matches have seen the side improve its defense, with the team not conceding any goals within its last five games.\n\n\n\n![](/images/uploads/img-20220522-wa0007.jpg)\n\n> Source: EFF\n\nWubetu Abate's men have landed in Tanzania ahead of the game. The head coach told Blue Nile Sport that everyone who has traveled to Tanzania is in good condition and the team will have its final training session on Thursday night after a light workout in the morning. Yared Baye has not traveled with the squad due to an injury sustained while playing against Uganda. Yared has been replaced by his club teammate Aschalew Tamene. Similarly, Surafel Dagnachew has not reported back after sustaining an injury in early August, with his replacement being 2021/22 BetKing Ethiopian Premier League Rookie of the Year Wondimagegn Hailu from Hawassa Kenema FC.",
  "thumbnail": "/images/uploads/img-20220825-wa0000.jpg",
  "slug": "ethiopia-faces-rwanda-in-the-final-qualification-rounds-for-a-chan-ticket",
  "author": "Ebawak Tesfaye @negussu_ "
}