{
  "layout": "blog",
  "date": "2022-01-10T09:19:14.453Z",
  "body": "*(Image: KENZO TRIBOUILLARD/AFP via Getty Images)* \n\nThe Walias failed to threaten the Cape Verde goal in their Group A African Cup of Nations defeat last night in Yaounde. Reduced to ten men early on, it was an uphill climb for the rest of the game and they never looked likely to pull back an equalizer after Julio Tavares headed home the only goal of the encounter. Despite this, the team looked relatively compact for a ten men side featuring no Europe based professionals.\n\nWith plenty to take away from the interesting clash, Blue Nile Sport analyzed the game and looked at the positives the Walias can take away.\n\nDefensive errors have been a blemish on Ethiopia’s game in recent months, with goalkeeping howlers proving especially costly for Ethiopia in recent world cup qualifiers. Teklemariam Shanko, who conceded one such goal away to Ghana and recently transferred to Sidama Coffee FC from Ethiopian Coffee where he became surplus to requirements, has kept his place as Coach Wubetu Abate’s number one goalkeeper, much to the chagrin of Ethiopian football fans.\n\nBut Teklemariam repaid his coach’s faith in him with a formidable showing against Cape Verde, making a number of crucial saves to keep his team in the game.\n\nWubetu encourages his goalkeepers to pass the ball into play from the back. Teklemariam made 24 passes with a 67% passing accuracy, which kept him active all game. A spectacular clearance onto the post from a misguided clearance by teammate Mignot Debebe, was the highlight of his four saves.\n\nJust four months after his blunder against Ghana had him subbed off at half time, Teklemariam seems to have regained his confidence, focus and is at full fitness. Regaining his starting position just ahead of the AFCON, he is set to start on Thursday ahead of Bahir Dar Kenema ‘keeper Fasil Gebremichael who had briefly taken his place in the lineup late last year.\n\n“Mistakes happen in football,” Wubetu said at a presser when asked why he had kept his faith in Teklemariam. “Rather than focus on individual errors, I build on the positives. I won’t let outside noise demoralize my players.”\n\nThere are definitely lots of positives for the Ethiopian goalkeeper, who was arguably the country’s best performer on the night.\n\nMeanwhile, brought into the starting lineup ahead of the biggest game of his life, 24-year-old Ethiopian Coffee midfielder Amanuel Yohannes ran his socks off in the middle of the park for the Walias. His 87% pass completion rate among the stats that highlighted his efficiency on the pitch.\n\n![](/images/uploads/amanuel.jpg)\n\n> Image: Confederation of African Football\n\nAmanuel is a good passer of the ball and is renowned in Ethiopia’s local league for his tactical awareness. He is often keen on recycling the ball in the midfield, which compensates for his lack of attacking prowess. When Wubetu decides to go with a 4-3-3 possession-based game, Amanuel tends to be among the first names on Ethiopia’s team sheet.\n\nAmanuel Yohannes averages 60+ passes a game when he puts on the colours of Ethiopian Coffee. His club side typically base their football on possession which has made him a perfect fit with Wubetu’s plans. Renowned for his high work rate at Coffee where he operates as their midfield conductor. He appeared to be comfortable with the pace of the game against Cape Verde and in his element even when under pressure. He did end up being overworked a little, due in no small part to his midfield partner Mesud Mohammed being sacrificed for defender Mignot Debebe after the early sending off of Yared Baye.\n\nAmanuel impressed with his one-touch passes, his movement into the space between opponents and his playing as a midfield cog in front of the backline.\n\n![](/images/uploads/ramadan.jpg)\n\n> Photo by KENZO TRIBOUILLARD/AFP via Getty Images\n\nLast but not least, Wolkite City’s Ramadan Yesuf. The left back who will turn 21 in February played like a season veteran throughout the game. He worked hard, making himself available for overlapping runs and continuously found space in dangerous areas of the pitch. Ramadan plays as a traditional fullback with positional discipline and technical ability both on and off the ball. Cementing his reputation as the best left back in the Ethiopian Premier League, his showing in the AFCON opener will ensure his stock rises even more.",
  "title": "Who were Ethiopia's best performers against Cape Verde?",
  "author": "Ebawak Tesfaye @negussu_",
  "thumbnail": "/images/uploads/index.jpg",
  "slug": "ethiopia-performers-cape-verde"
}