{
  "layout": "blog",
  "date": "2022-07-27T00:37:28.937Z",
  "title": "Ethiopian Premier League Transfer Roundup: Ethiopia Coffee Show Signs of Ambition",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "body": "<!--StartFragment-->\n\nThe Ethiopian Transfer window finally opened on the 8th of July, a week after BetKing Premier League action had ended. Clubs have been quick to do business as a flurry of player transfers have been completed in the first two weeks of the window. One of the busiest sides in the window so far has been Ethiopia Coffee. Following a sixth place finish this season, the club have decided to ditch their patient approach with coach Kassaye Arage and instead have elected to rebuild the foundations of the club from scratch. Ethiopia Coffee have let go of Arage and have replaced the head coach with Temesgen Dana. Dana led Wolkite City for 18 games after the club let head coach Paulos Getachew go in the first half of the season. Dana’s record at Wolkite has not been anything special with 22 points collected from 18 games for a points per game of 1.22, picking up slightly less points per game than Paulos Getachew (1.33 points per game). Promptly, there have been concerns raised at this appointment from vocal sections of the Ethiopia Coffee fanbase. \n\n\n\nIn spite of this, Ethiopia Coffee have not wasted any time in supporting their new manager. The club has been aggressive in the transfer market in both their incomings and outgoings so far. Of the signings that Coffee have made as of this writing, two are from Dana’s former Wolkite side, with one of Wolkite’s best offensive players Challa Teshita moving to Coffee in addition to youngster Abdulkarim Worku. From Sebeta City, Coffee have signed left-back Hailemichael Adefris and midfielder Abdulhafiz Tawfik. Most exciting for fans, Ethiopia Coffee have signed Hawassa City starlets Mesfin Tafesse and Brook Beyene. The two were deadly for Hawassa last season with Brook Beyene, in particular, having the highest goal contributions in the league at 20 goals and assists. Beyene, Tashita, and Tafesse will no doubt have been brought on to replace the goals that were provided by Abubekir Nassir following his departure to Mamelodi Sundowns this season. The undisclosed transfer fee that Coffee have received from Sundowns will enable Ethiopia Coffee in their transfer splurge. Coffee have not only produced high-profile signings but have also signed promising youth in the form of Antene Tefera, who impressed as top scorer in the state championships. Following Tefera to Ethiopia are his as teammates at Shakiso City: Birhanu Wolito and Yegnaneh Tarik. Finally, Mesud Mohammed returns to his former side after a spell at Jimma. The veteran can provide experience to this youthful Ethiopia Coffee side in the midfield. \n\n![](/images/uploads/mesfin-tafesse.jpg)\n\n> (Source: Ethiopia Coffee Official Facebook Team Page)\n\nTo create space for these new incomings, Coffee have purged many of the squad that was assembled over the course of Kassaye Arage’s tenure, only retaining players that the club deems to be key. Among the departures are high-profile starters such as William Solomon, Tafesse Solomon, and Abel Endale. \n\n\n\nOn the opposite side of the spectrum, Bahir Dar City have elected to remain patient with Head Coach Abraham Mebrahtu following a desperately disappointing Premier League campaign that saw The Waves of Tana battling relegation in the latter stages of the season. Bahir Dar have shown their backing of Abraham Mebrahtu this window, signing eight players at the time of writing of this article. One of the major weaknesses of Bahir Dar last season was their inability to put the ball in the back of the net. The side was only able to score 29 goals in 30 games last season. The acquisition of forwards Fitsum Tilahun from Addis Ababa City, Habtamu Tadesse from Hadiya Hossana, and Durissa Shubisa from Sebeta City should improve Bahir Dar’s output for next season. Tilahun registered 9 goals and 4 assists while Shubisa scored 3 and assisted 3 for a Sebeta side that did not create many chances. Habtamu Tadesse, meanwhile, was Hadiya’s top goalscorer with 8 goals last season. In defense, Bahir Dar have taken a gamble by swapping Minaf Awol for Fasil Kenema’s Yared Baye as well as signing two Premier-League untested left backs in Tafesse Tamirat from newly promoted Ethiopian Insurance and Fraol Mengistu from 2nd-division team Halaba City. \n\n![](/images/uploads/bahir-dar-signings.jpg)\n\n\n\n> (Source: Bahir Dar City Official Facebook Team Page)\n\n\n\nAnother team that have kept busy during the opening stages of the transfer window are Hawassa City. The fourth-placed side have been weakened by the departures of Biruk Beyene and Mesfin Tadesse to Ethiopia Coffee. The attacking duo were involved in 28 of Hawassa’s 38 goals last season. One of the players brought on as a replacement is experienced forward Mujib Kassim. Kassim left Fasil Kenema after a strong end to his season, scoring 5 goals in his last 4 games.  It is yet to be seen if he can replicate this form over an entire season in his second stint of BKETHPL football after his return from Algeria, but the player has shown glimpses towards the end of last season that he can replicate his excellent output in 2020/21. Hawassa have also signed Addisu Atula who impressed as Defense Force’s top scorer, scoring 6 goals from the wing. The rest of Hawassa’s transfers have mainly focused on bolstering their defensive unit, with the signing of defensive midfielder Eyob Alemayehu from Jimma, Fasil right back Seid Hassen, and Sebeta center back Bereket Samuel.\n\n![](/images/uploads/hawassa-signinga.jpg)\n\n\n\n> (Source: Hawassa City Official Facebook Team Page)\n\nChampions Saint George are expected to dip into the market to strengthen themselves for continental competition as well as to make sure they are not outpaced by ambitious PL rivals. A major decision for Saint George is whether Zerihun Shengata will remain as Head Coach for the club next season or whether he will be replaced. The interim coach has impressed in his spell at the club, bringing home the league for the first time since 2015. The Saint George board have still hinted at interest in bringing a foreign coach for the upcoming season. On the player’s side, the Horsemen have brought in Ethiopian National Team left back Ramadan Yusuf from Wolkite City as well as attacking midfielder Biniam Belay, who was an important creative cog in his Defense Force side. Midfielder Dawit Tefera also joins from Sidama Coffee to possibly replace outgoing Kenan Markneh as a goalscoring midfielder.  In addition to new arrivals, the Horsemen are working to tie down important players to new contracts. These include the likes of Abel Yalew, Henok Adugna, and Amanuel Gebremichael.\n\n![](/images/uploads/ramadan-yusuf.jpg)\n\n> (Source: Saint George Official Facebook Team Page)\n\nDefense Force have shown their ambition with the opening of the transfer window. The club kicked off the transfer window by releasing head coach Yohannes Sahle despite a 9th-place finish in the league. A reason for the dismissal may have been that Defense Force were abject for large periods in the second half of the season. The only exception of this was the period in late April/early May, where the club collected 12 out of their season total 37 points.  Coincidentally, these were games that took place while Sahle was away from the team due to an illness. Yordannes Abay, the man who led the Defense force through this purple match, has decided to leave the club, opting to instead join his former club Dire Dawa City. Defense Force meanwhile have appointed Fasil Tekalign, who was manager of Adama City until the latter stages of last season. It is a curious appointment as Defense finished above Adama this season, and were above them when Tekalign was dismissed from Adama.\n\n The club have shown their ambition by signing nine players in the market so far. While the club have lost a crucial attacking player in Biniam Belay, they have dipped into the market to add offensive firepower in Bereket Desta, who has shown that he is capable of being a creative outlet in his time at Fasil Kenema. Samuel Salissu from Sebeta, Minyilu Wondimu from Welayta Dicha, and Kenan Markneh from Saint George may prove to be shrewd offensive signings for Defense. In the middle of the park, Defense have signed Tesfaye from Hadiya, and Henok Dilbe from Hawassa. Defense have continued their raid on Fasil Kenema by signing another one of their regular starters in fullback Amsalu Tilahun. They have also signed promising goalkeeper Dagim Tefera who has moved from Hawassa after managing to pick up a decent number of starts for Hawassa City this season. The youngster will hope to make the starting goalkeeping spot his own at Defense Force.\n\nRunners-up Fasil have had to focus on replacing the aforementioned Bereket Desta, Amsalu Tilahun, and Seid Hassen. In place of Tilahun and Hassen, Fasil have signed Tesfaye Negash from Wolkite, and Wondimagegn Markos from Jimma. These two players will allow Fasil to play with more versatility at the back as the former is an offensive fullback that is comfortable playing further up the pitch while the latter is able to tuck inside and play as a center back. Further up the pitch, the Emperors have acquired winger Habtamu Gezahegn from Sidama Coffee and offensive midfielder Tafesse Solomon from Ethiopia Coffee. Gezahegn was Sidama’s second highest goal contributor with 9 Goals plus Assists for last season. Gezahegn seems to be the replacement for Bereket Desta but played primarily on the left last season while Gezahegn was primarily deployed as a right winger.\n\n![](/images/uploads/fasil-fasil.jpg)\n\n\n\n> (Source: Fasil Kenema Official Facebook Team Page)\n\nSidama Coffee have picked up their pace in the window after a slow first week. The side have signed Addis Ababa duo Endale Kebede and Muluken Addisu.In the midfield, they have strengthened with the signings of Abel Endale from Ethiopia Coffee as well as former player Ababayehu Yohanes who rejoined Sidama after only a year away from the side. Striker Tsegaye Abera also joins the club from Arba Minch while Sidama have strengthened their back line by signing Equatorial Guinea’s Felip Ovono. The last time Ovono was in the Premier League, it was a successful spell that saw the keeper lift the league trophy with Mekelle City in the 2018/19 season. The club were also heavily linked with former Ethiopia Coffee player William Solomon. Issues arose when Sidama announced they had signed Solomon only for Adama City to announce Solomon as their player a couple of days later. This transfer will remain in limbo until the governing body passes a decision on the player’s rightful club. \n\n![](/images/uploads/sidama-signing.jpg)\n\n> (Source: Sidama Coffee Official Facebook Team Page)\n\n<!--EndFragment-->",
  "thumbnail": "/images/uploads/bunna-transfer-2.jpg",
  "slug": "ethiopian-premier-league-transfer-roundup"
}