{
  "layout": "blog",
  "date": "2023-01-14T02:02:26.161Z",
  "title": "CHAN 2023 Preview: Can Ethiopia Progress Past The Group Stage of An African Tournament For The First Time in Five Decades?",
  "body": "> *Image Source: Ethiopian Football Federation*\n\nThe Ethiopian National Team is set to make its return to the African Nations Championship campaign when it faces Mozambique at Baraki Stadium in Algiers, Algeria. The Walias, who are returning to CHAN for the first time since 2016, failed to qualify for the last two editions of the tournament.\n\n![](/images/uploads/img-20230113-wa0001.jpg)\n\n> *Image Source: Ethiopian Football Federation*\n>\n> *Ethiopian National Team Coach Wubetu Abate(Left) and Captain Mesud Mohammed (Right)*\n\nIn their previous two appearances in CHAN, Ethiopia saw themselves eliminated in the group stages after consecutive winless campaigns.\n\nThe Walia's recent form has set the National Team up well for success in the tournament, with the side beating Rwanda and Sudan in the qualification rounds. The Walias have only been beaten once in their last eight matches, with their solid defense being a major component of this good form (the National Team has kept five clean sheets in the last eight matches). The solitary loss came in their last two-legged friendly match against Morroco’s CHAN team. The team is now placed in group A with Algeria, Libya, and Mozambique.\n\nWubetu Abate, who has been coaching the team since 2020, said the team has been dealing with several injuries in recent weeks. Dawa Hotessa has sustained a knee ligament tear, Abate told reporters. Other players dealing with injuries include Amanuel Yohannes, Yared Baye, and Asrat Tunjo. The team received unexpected news in December when striker Getaneh Kebede, who scored 33 goals in 65 games for the national team, announced his retirement after a spell away from the National Team as a result of a confrontation with Coach Abate. Getaneh Kebede was selected for the 48-man CHAN shortlist and was expected to lead the line before his surprising announcement. \n\nAbate believes that despite the injuries and the retirement of Getaneh Kebede, Ethiopia has the capability to perform well in the tournament. “We have a lot of potential and can do well in the tournament. We have a good squad that can compete with the best teams in Africa. We have been working hard and are confident of our chances, we will do our best to make the country proud.”Abate stated. The Ethiopian National team has been making preparations for the tournament by playing and training in Morroco ahead of the tournament. Abate believes his team is well-prepared and has the potential to go far in the tournament. \n\n# Players To Watch\n\n![](/images/uploads/img-20230113-wa0002.jpg)\n\n### Yigezu Bogale\n\nYigezu was excellent at club level last season, with the striker winning the golden boot with 16 goals in 27 games at Sidama Coffee. Bogale has found the back of the net 6 times in 12 games this season. Bogale’s performances will be crucial for Ethiopia’s attacking output due to most of the established attacking players being injured (Hottessa, Gebremichael) while others are absent/ineligible to be selected for the squad (Kebede, Nassir, Bekele).\n\n### K﻿itka Jema\n\nThe playmaker has registered  3 goals and 3 assists this season. Jema helped his team, the newly promoted Ethiopia Medhin, get to the top of the league just 5 months after getting promoted to the top tier league. He is a great lock-picker, and his vision allows him to make passes that most players in the Ethiopian Premier League can only dream of.\n\n### Cherinet Gugsa\n\nThe 22-year-old winger has been impressive for Saint George and has 5 goals and 2 assists in 14 games. He is averaging a goal involvement every other game in the Premier League. His creative passing and dribbling abilities will cause headaches for opposing defenders.\n\n### Gatouch Panom \n\nA key figure in midfield for Ethiopia and player of the year in the 2021/22 season will bring his immense experiences to guide the national team. Gatouch Panom and Aschalew Tamene are the only players in the current squad who were also a part of the CHAN 2016 team. The veteran midfielder will be a key component of the defense, as Gatouch excels at breaking up the opponent’s game.",
  "author": "Tomas Kassahun",
  "thumbnail": "/images/uploads/img-20230113-wa0000.jpg",
  "slug": "ethiopia-hopes-to-overcome-challenges-and-on-good-performances-for-chan-2022-campaign"
}