{
  "layout": "blog",
  "date": "2022-01-09T20:56:11.235Z",
  "title": "Ten man Ethiopia lose AFCON opener to Cape Verde",
  "slug": "ethiopia-lose-to-cape-verde-afcon",
  "author": "Blue Nile Sport staff",
  "body": "Ethiopia lost out 1-0 to Cape Verde in Group A action at the Olembe Stadium tonight, after playing the lion's share of the match a man down. The lone goal came in stoppish time of the first half, when a Gerry Rodrigues cut back across the Ethiopian goal was headed home by Julio Tavares.\n\nTwelve minutes into the match, Fasil Kenema centerback Yared Bayeh earned himself a dismissal after VAR was used to review his last ditch challenge on Tavares to overturn what had initially been a yellow card.\n\nFrom then on, it was an uphill climb for the Walias, who withdrew Mesud Mohammed minutes after the sending off for Mignot Debebe in an attempt to maintain their defensive shape. \n\nMignot almost opened the scoring for the Blue Sharks, when he redirected a cross towards his own goal. A combination of the post and Teklemariam Shanko's fully extended left glove spared his blushes.\n\nCape Verde dominated the play and pushed to take advantage of their numerical superiority. Shortly after the half hour, Suleman Hamid did well to prevent a tap in goal by Tavares, the following play saw the ball fall to Rodrigues who went for goal and saw his effort parried away for a corner by Teklemariam. \n\nEthiopia nearly preserved the deadlock through to the end of the half until Tavares beat a ball watching Aschalew Tamene with his diving header which Teklemariam could do nothing about. \n\nThe Walias showed little signs of being able to comeback into the fixture and lacked creativity in the middle of the park. Teklemariam made a couple more stops to keep his team in the fixture, including a sweetly struck shot on target by Kenny Rocha Santos minutes into the second half. \n\nEthiopia managed to produce only a single effort on target, and later withdrew Getaneh Kebede and youth prodigy Abubeker Nasir for Firew Solomon and Algeria based striker Mujub Kassim but to no avail.\n\nWubetu Abate's charges will look to pick themselves up ahead of their crunch match against the hosts on Thursday.",
  "thumbnail": "/images/uploads/27lpze3l.jpg-small.jpg"
}