{
  "layout": "blog",
  "date": "2022-01-10T07:27:21.522Z",
  "title": "AFCON: Ethiopia honour 1962 legends with star spangled kit",
  "slug": "ethiopia-honor-afcon-legends",
  "author": "Staff",
  "thumbnail": "/images/uploads/star.png",
  "body": "*(Image: Ethiopian Football Federation)*\n\nEthiopia debuted a new national team kit for their African Cup of Nations opener last night, which ended in [defeat](https://www.bluenilesport.com/articles/ethiopia-lose-to-cape-verde-afcon) to the Blue Sharks of Cape Verde. While the traditional tricolor green shirts, yellow shorts and red socks pattern of the country's national flag was kept, an additional detail which may not have caught the eye adorned the team's green jersey.\n\nIt wasn't the puzzling choice of black lettering on their dark green jerseys, which rendered the player names barely legible. For the first time in the country's footballing history, the Walias took to the pitch wearing kits with stars sewed atop of their badge, a tribute to Ethiopia's legendary 1962 AFCON winning team.\n\nDespite being among the continent's weaker sides and making only their second major tournament appearance in four decades, Ethiopia was among the pioneers of the African game and a founding member of the Confederation of African Football (CAF) alongside Sudan, South Africa and Egypt. Named as hosts of the third AFCON tournament, by which time only seven national teams had been registered for the qualifiers, Ethiopia defeated Tunisia in the semifinal and the then two time African champions Egypt by the same 4-2 scoreline to become African champions for the first and only time. \n\n![](/images/uploads/1962-squad.jpg)\n\n> Despite decades of mediocrity, Ethiopia's crowning achievement in 1962 earns them the right to wear a star atop their crest alongside the likes of Cameroon, Ghana, Algeria and Egypt. \n\nThe Pharaohs of Egypt, winners of a record seven AFCON titles have seven tiny stars dotted around the team crest on their kit to honour each and everyone of them, including two crowns won in 1957 and 1959 when AFCON final tournaments featured as little as three national teams. Ghana similarly have four black stars celebrating their four wins, including their title in 1963, their debut at the AFCON.\n\nFor reasons known only to the staff at the Ethiopian football federation, Ethiopia never wore a star that would commemorate the likes of Mengistu Worku, joint top scorer in the 1962 tournament and the eighth top scorer in the history of the AFCON with ten goals, trailing the likes of Didier Droga (11) and all time scorer, Samuel Eto'o (18). Until last night that is.\n\n![](/images/uploads/luciano.jpg)\n\n> Ethiopian captain Luciano Vassalo is handed the 1962 AFCON trophy by the then Emperor Haile Selassie at the Addis Ababa stadium \n\n60 years after the most cherished chapter of Ethiopian footballing history, Ethiopia are no longer favourites at the finals, with Coach Wubetu Abate stating that escaping the group would be his team's goal in Cameroon. The gesture to honour the legacy of Ethiopia's African champions comes very late, but is still a noteworthy way to preserve fading memories of the team's biggest accomplishment.\n\n![](/images/uploads/can-1962-mengistu-worku-luciano-vasallo-encuentro-1991.jpg)\n\n>  Decades after their greatest achievement, friends for life, Mengistu Worku (left) and Luciano Vassalo, on the same pitch where they combined for five goals in two games to win it all in 1962. Mengistu passed away in 2010, after a battle with cancer\n\nIt came heartbreakingly too late for Italo Vassalo, younger sibling of Luciano, and scorer of the winning goal in the final. The former striker, most renowned for his time at Dire Dawa's Cotton FC, passed away aged 80, last July in his hometown of Asmara, Eritrea.\n\nThe Walias will again wear the star bearing testimony to the heroics of 1962, this Thursday when they take on host nation Cameroon at the Olembe Stadium."
}