{
  "layout": "blog",
  "date": "2022-01-11T03:37:19.105Z",
  "body": "*(Image: KENZO TRIBOUILLARD/AFP via Getty Images)*\n\n ከ ስምንት አመታት ቆይታ በኋላ ወደ አፍሪካ ዋንጫ የተመለሰው የኢትዮጲያ ብሔራዊ ቡድን ትላንት እሁድ የምድብ የመጀመሪያ ጨዋታውን በኦሎምቤ ስታዲየም ያውንዴ ከተማ ላይ ከኬፕ ቨርዴ ጋር አድርጎ 1-0 በሆነ ጠባብ ውጤት ተሸንፏል።\n\nአሰልጣኝ ውበቱ አባተ ለመጀመሪያ የምድቡ ጨዋታ በ 4-3-3 አሰላለፍ ይዘው ወደ ሜዳ ገብተዋል። በግብ ጠባቂ ቦታ ላይ ተክለማሪያም ሻንቆ፣ በተከላካይ ቦታ ረመዳን ዩሱፍ፣ ያሬድ ባየህ፣ አስቻለው ታመነ፣ ሱሌማን መሀመድ፣ በመሀል አማካይ ቦታ ላይ ሱራፌል ዳኛቸው፣መሱድ መሀመድ፣ አማኑኤል ዮሀንስ፣ በአጥቂ ቦታ ላይ ደግሞ አማኑኤል ገብረሚካኤል፣ ጌታነህ ከበደ እና አቡበከር ናስር ለዚህ የጨዋታ ፎርሜሽን የተመረጡ ተጫዋቾች ነበሩ።\n\nጨዋታው በተጀመረ 7ኛው ደቂቃ ላይ የመሀል ተከላካዩ አስቻለው ታመነ ኳስን በጭንቅላቱ አቀብላለሁ በሚልበት እንቅስቃሴ ላይ በፈጠረው ስህተት ኳሷን የኬፕ ቨርዴ አጥቂ ማርሴሎ ታቫሬዝ ወደ ጎል ይዞ ሲሄድ  ያሬድ ባየህ ከኋላ በሸርተቴ ወርዶ ተጫዋቹ ላይ ጥፋት ይፈጽማል። የእለቱ አንጎላዊው የጨዋታው ዳኛ ሄልዳ ማርቲንስ ለተጫዋቹ የቢጫ ካርድ አሳይተው ለኬፕ ቨርዴ ቅጣት ምት ይሰጣሉ።ነገር ግን የVAR የዳኞች ቡድን ለአርቢትሩ ባሰሙት የድጋሜ እይታ ጥሪ ውሳኔያቸውን ቀልብሰው ያሬድ ባየህን በ12ኛው ደቂቃ ላይ ከሜዳ በቀይ ካርድ አባረውታል።\n\nአሰልጣኝ ውበቱ አባተ ከተጫወቹ ቀይ ካርድ በኋላ የመሀል አማካዪን መሱድ መሀመድን አስወጥተው የመሀል ተከላካዩን ምኞት ደበበን በማስገባት ቀሪውን የጨዋታ ጊዜ በ4-4-1 የጨዋታ ፎርሜሽን እንዲጨርስ አድርጓል። ጨዋታው 0ለ0 በሆነ ውጤት እረፍት ለመውጣት በተቃረበበት የጨዋታ ክፍለጊዜ ላይ የብሄራዊ ቡድኑ ግብ ጠባቂ ተክለማሪያም ሻንቆ የተሞከረበትን ኳስ በጥሩ ሁኔታ ይዞት ነገር ግን ኳሱን አዘግይቶ ማስጀመር ሲገባው እና ቡደኑ 0-0 እረፍት መውጣት ሲገባው ኳሷን በፍጥነት ጀምሮ  ኳሷን የኬፕ ቨርዴ ተጫዋቾች ወደ ጎልነት ቀይረውታል።\n\n![](/images/uploads/gettyimages-1237629686-612x612.jpg)\n\n> የኢትዮጵያ ብሄራዊ ቡድኑ ተከላካይ አስቻለው ታመነ ከኬፕ ቬርዴው ዲአስ ጎንዛሌዝ ጋር ለኳስ ሲፋለም (Photo by KENZO TRIBOUILLARD/AFP via Getty Images)\n\nምንም እንኳ ተክለማሪያም ይህችን ስህተት ይፈጽም እንጂ ከቀይ ካርዱ በኋላ በራስ መተማመን እና ስነልቦና ከጎደላቸው ሌሎች የሜዳ ላይ ተጫዋቾች ይልቅ ግብ ጠባቂው የምሽቱ የኢትዮጲያ ብሔራዊ ቡድን ኮኮብ ሆና አምሽቷል።በ69 ኛው ደቂቃ ላይ ኳሷ በምኞት ደበበ ተጨርፎ ወደ ጎል ሲሄድ ተክለማሪያም በአስደናቂ ሁኔታ አድኗታል። በአጠቃላይ የግብ ጠባቂው ስነ ልቦና የሚደነቅ ነበር። የኢትዮጲያ ብሔራዊ ቡድን የመሀል አማካይ ተከላካይ የታየበት ክፍተት የኬፕቨርዴ ተጫዋቾች በቀጥታ  ከኢትዮጲያ ብሔራዊ ቡድን ተከላካዮች ጋር ሲገናኝ ነበር።\n\nበቀጣዪ የካሜሮን ጨወታ ላይ አሰልጣኝ ውበቱ አባተ በቦታው ላይ ሊያስቡበት ይገባል።በ27ኛው ደቂቃ ላይ ጌታነህ ከበደ በመቀስ ምት ለመምታት የሞከራት ኳስ እና በኬፕ ቨርዴ ተከላካዮች ስህተት አማካኝነት አቡበከር ናስር ለመድረስ ያደረገው ጥረት ለጥቂት አለመሳካቱ በኢትዮጲያ ብሔራዊ ቡድን ሊነሱ የሚችሉ ሙከራዎች ናቸው። በአጠቃላይ በኢትዮጲያ ብሔራዊ ቡድን ልምድ የማጣት፣የትኩረት እና የአካል ብቃት ችግሮች የተስተዋሉ ሲሆን በቀጣዩ የካሜሮን ጨዋታ ላይ ሊታረሙ ይገባል።",
  "title": "የኢትዮጲያ እና የኬፕ ቨርዴ ጨዋታ ሲዳሰስ",
  "slug": "ethiopia-capeverde-review",
  "author": "Brook Tefera",
  "thumbnail": "/images/uploads/gettyimages-1237630333-612x612.jpg"
}