{
  "layout": "blog",
  "date": "2022-01-13T01:26:10.237Z",
  "body": "*(Image: KENZO TRIBOUILLARD/AFP via Getty Images)*\n\nDespite defeat at the hands of Cape Verde’s Blue Sharks, Ethiopian football fans can take some comfort in knowing that the bulk of the team is likely to play for years to come. That’s because Walias’ gaffer Wubetu Abate fielded a starting eleven with an average age of 25.6 years, the second youngest average at the African Cup of Nations after Nigeria’s average of 25.3.\n\nWith the end of today’s Group F fixtures, each of the twenty four teams at the finals have had a runout of ninety minutes (bar Tunisia and Mali, whose game ended in controversial and comical fashion). Wubetu’s youthful selection reflects the budding potential of his squad and also that of the Ethiopian Premier League.\n\n![](/images/uploads/youngest.jpg)\n\n> Prodigy kids: a reason for Ethiopian football fans to \"trust the process?\"\n\nThe Walias started with three players aged 22 or younger with forwards Abubeker Nassir, Amanuel Gebremichael and left back Ramadan Yesuf who outshined many of his teammates in the defeat.\n\nAs promising as this could be, the team’s lack of experience also showed. With far too many giveaways in the middle of the park and the lack of a creative outlet that the injured 32 year old Shemeles would have likely offered, the Ethiopians rarely threatened in the final third, producing just a single shot on target, although this could be blamed on the team’s going down to ten men after centerback Yared Baye’s 12th minute red card.\n\nWith the experience of a single AFCON game under their belts, Ethiopia’s youthful selection are set to face off against their highly fancied hosts Cameroon tomorrow afternoon. Defeat could mean an early tournament exit.",
  "thumbnail": "/images/uploads/gettyimages-1237628845-612x612.jpg",
  "author": "Ebawak Tesfaye @negussu_",
  "slug": "ethiopia-second-youngest-afcon",
  "title": "Ethiopia's starting XI second youngest at AFCON"
}