{
  "layout": "blog",
  "date": "2022-06-02T01:21:04.048Z",
  "body": "The Walias prepared for their upcoming AFCON 2023 Qualification games via two friendlies against Lesotho on the 28th and 30th of May. These matches both ended in  1-1 results that will not exactly thrill either team but will give both positive building blocks going into their respective competitive matches. Ethiopia face Malawi on the 5th of June and Egypt on the 9th of June for their opening AFCON qualifiers. Lesotho also have an equally tricky set of fixtures when they play Comoros on the 3rd of June before facing the Ivory Coast on the 9th of June.  \n\nBoth games took place in Ethiopia at the Adama Science and Technology University Stadium. The Ethiopian National Team will not have this luxury of playing at a domestic stadium when they play their AFCON qualifiers.  This is due to Ethiopia failing to obtain CAF accreditation for its previously sole-CAF-approved venue, Bahir Dar International Stadium.  \n\n![](/images/uploads/bahirdarstadium.jpg)\n\nWubetu Abate showed through his squad selection that he was looking to mix things up and give a decent number of new players a chance. As such, the starting elevens for Ethiopia were nearly completely different across both games, with only two players remaining constant, Dawa Hotessa and Bereket Desta. Desta was one of the many new faces that were not included in the AFCON 2021 squad and have been promoted into the team after an impressive season in the Ethiopian Premier League: Git Gatkoch, Henok Adugna, Bereket Amare, Yigezu Bogale, Cherinet Gugsa, and  Beniam Belay also join the Fasil Kenema attacker as newcomers to the squad.\n\nLong-time veterans and starters had to make way for all of these new players. Longtime starting center-back Aschalew Tamene was one of these players who was dropped from the squad. The Center-back has been dropped after a less than stellar season so far, with the defender having difficulties adjusting to his move to Fasil Kenema from Saint George. Getaneh Kebede is another major omission from the squad. The falling out between the veteran striker and Coach Wubetu Abate risks casting a shadow over the national team if they fail to register wins. Kebede is currently tied for top scorer in the Premier League with 13 goals and is the nation's all-time leading goal scorer. This is not the forward's first falling out, however, with Getaneh leaving Saint George over disciplinary issues in 2021. Walias can find comfort in the fact that the current Ethiopian side is not lacking in attacking firepower, with Abubekir Nassir and Yigezu Bogale both contributing to 15 goals for their respective sides in the Ethiopian Premier League this season.\n\nLesotho came into the game in mixed form, having beaten and drawn with Seychelles, being beaten heavily by South Africa and Botswana as well as getting a shock win against Zambia in their last five games. They are currently in group H of AFCON Qualifying, where they will go toe to toe with the Ivory Coast, Zambia, and Comoros.\n\n![](/images/uploads/lesotho.jpg)\n\n> (Image Source: CAF)\n\nBoth of the games played had their similarities and differences. In both, Ethiopia had the lion’s share of possession with Lesotho preferring to soak pressure and counter. Both games also had a distinct lack of goals from open play, with the only goal that was not from a set-piece being Ethiopia's equalizer in the first game. Ethiopian Premier League top scorer Yigezu Bogale came on in the second half to put this ball in the back of the net after a helping hand from Cherinet Gugsa (who was also a substitute). \n\nLong-time fans of the Walias will not be surprised that both goals that the Ethiopian National Team conceded across the set of games were the result of set pieces. Lesotho’s goal in the first game came about as a result of poor marking from a free-kick routine. The Ethiopian defense was stretched towards the right side which led to Rethabile Mokokoane and Tumelo Makha finding themselves unmarked on the left side of the box,  Makha got on the end of a low cross and put the ball in the back of the net. \n\nThe second halves of both games were completely different, Ethiopia looked very likely to score in the second half of the first game with substitutes Suleiman Hamid and Biniam Belay looking lively. Dawa Hotessa had the biggest chance to equalize in the 84th minute as he got on the end of a good early whipped ball in from the right-hand side to deliver a header that just glanced past the post. Hotessa got his goal in the second match when the Adama forward utilized his aerial prowess yet again to get on the end of another excellent set-piece delivery by Henok Adugna. The Walias capitulated after this goal ,however, with Lesotho dominating the second half and getting their equalizer in the 65th minute courtesy of a Gini Tabasito penalty.\n\nThe two teams last met in the first round of the World cup qualifiers for 2020. The Walias, then led by Abraham Mebrahtu, narrowly went on to qualify for the second round of World Cup Qualification via away goals after drawing 0-0 at home and 1-1 away. Ethiopia are currently 137 while Lesotho are 145th in the FIFA Men 's World Rankings. The last time these two sides met was in September 2019, Ethiopia were 14 places below where they rank now at 151 and Lesotho were placed above the Walias at 137.",
  "title": "Ethiopia and Lesotho Held to Consecutive Stalemates",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "slug": "ethiopia-and-lesotho-held-to-consecutive-stalemates"
}