{
  "layout": "blog",
  "date": "2022-01-13T19:48:22.653Z",
  "body": "*(Image: Kenzo Tribouillard/AFP/Getty Images)*\n\nThe gap in class between the upstarts from Ethiopia in their first African Cup of Nations finals since 2013, and the host nation and five time champions was evident by the time Congolese referee Jean Jacques Ndala blew his final whistle. The Indomitable lions ran out 4-1 winners and booked their spot in the knockout stages.\n\nVincent Aboubakar and Karl Toko Ekambi each got a brace on the night the floodgates opened on an AFCON which had seen eleven out of twelve games decided by a single goal or end scoreless. The result leaves the Walias currently bottom of group A, and on the brink of elimination.\n\nWubetu Abate made just two changes to the starting eleven, with Mignot Debebe replacing the suspended Yared Bayeh. The decision to drop captain and proven goal poacher  Getaneh Kebede for Dawa Hotessa was seen as a risky gamble, but it paid off immediately.\n\nFour minutes in, Abubeker Nassir broke through the middle and spread the ball out to the right wing where Amanuel Gebremichael had ran into the space down the exposed Cameroonian left flank. Slack man marking by Collins Fai gave Dawa the space to meet the the St. George midfielder’s low cross and slot it home past the sprawling right leg of Andre Onana in the Cameroonian goal.  \n\n![](/images/uploads/celebration.jpg)\n\n> *The Walias celebrate Dawa Hotessa's opening goal (Image: Kenzo Tribouillard/AFP/Getty Images)*\n\nIt was only Dawa’s second international goal and his first in over four years. It was Ethiopia’s first goal at a major international tournament since Adane Girma’s equalizer against Zambia at the 2013 AFCON, and Amanuel would earn Ethiopia’s first finals assist since Salahdin Said on that very same night. The goal sent the contingent of Ethiopian fans at the Olembe stadium wild.\n\nThe lead didn’t last long. A sweetly struck strike by Vincent Choupu Moting was parried away from goal by Teklemariam Shanko minutes later. Fai made amends for his role in the opening goal by delivering a perfect cross that Ekambi drilled home with his head.\n\nWith the score level, the Walias looked menacing on the counterattack, with Abubeker Nassir pulling the strings and looking more and more like the player that Ethiopian fans recognize as the best talent in the Ethiopian top flight. Mid way through the first half, Amanuel Gebremichael broke free yet again, drove forward and managed to shoot but was denied by an unorthodox save from Onana.\n\nMidfielder Surafel Dagnachew, who got the start despite a poor performance against Cape Verde, was lucky to remain on the pitch after a rash challenge only earned him a yellow card. The Cameroonians began exploiting sizeable gaps down the flanks and looked the more likely to score by halftime.\n\n![](/images/uploads/sura.jpg)\n\n> Cameroon's Nohou Tolo and Ethiopia's Surafew Dagnachew (Image: Kenzo Tribouillard/AFP/Getty Images)\n\nSurafel was withdrawn at half time but it did little to prevent the wave of Cameroonian attacks. Teklemariam Shanko got busier in the Ethiopian goal as the night went on, and he could do little about Vincent Aboubakar’s towering header past him. With the Indomitable Lions firmly in the driver’s seat, the night got longer and more painful for the Walias.\n\nThe Ethiopians were visibly rattled after going behind, and much like they were after being reduced to ten men against Cape Verde, they were pegged back into their own half. But they remained unable to plug the gaps on the flanks and there was nobody to stop Moumi Ngamaleu who had charged towards goal nor Aboubakar who slid in from close range to make it four before the hour mark.\n\nTeklemariam did everything he could to prevent it from becoming a total rout, including saving a deflected goal bound Ekambi shot. But there was no stopping Ekambi, when he waltzed into the Ethiopian penalty area, cut the ball back leaving Mignot Debebe and Aschlew Tamene for dead and slammed it into the goal to make it 4-1 in the 67th minute.\n\nGetaneh Kebede was eventually brought on, and he nearly combined with Bezabeh Meleyo for a second goal. On in place of stand in skipper Mesud Mohammed, Bezabeh was unmarked and in the box when he blazed the ball over the bar with minutes to go.  \n\nDespite exhibiting some eye-catching football, Ethiopia was quite simply outclassed, and will now have to defeat Burkina Faso in their final group game on January 17th and hope results elsewhere go their way if they hope to advance to the round of 16 among the best third place finishers.",
  "thumbnail": "/images/uploads/cam.jpg",
  "title": "AFCON Floodgates open as Cameroon hit Ethiopia for four ",
  "author": "Ebawak Tesfaye @negussu_ ",
  "slug": "ethiopia-battered-by-cameroon-afcon"
}