{
  "layout": "blog",
  "date": "2022-02-05T07:54:21.543Z",
  "body": "> *(Image: Ethiopian Premier League Share Company)*\n\nEthiopian Coffee and Adama Ketema shared the spoils in the first game at Dire Dawa that ended goalless.\n\n \n\nIn hindsight, this scoreline shouldn’t have been as surprising, as Adama’s defence has been a big reason for their strong start to the season with the club conceding just six goals, a record bested only by league leading St. George. This has been the major reason why last season’s bottom placed side made a big turnaround this season, with them having the same points on the board at this stage as they accumulated over the entirety of last season.\n\n \n\nEthiopia Coffee’s defence looks pretty similar from last season with it being middle of the road. The main issue for the coffee side is the significant drying up of their attacking output this season.\n\n \n\nTheir attack has been overly dependent on their star man Abubeker Nasir who has been involved in six out of the team’s eight goals this season. Abubeker had been away [on trial](https://www.bluenilesport.com/articles/abubeker-nassir-south-africa-trials) prior to [signing](https://www.bluenilesport.com/articles/abubeker-nasir-signs-mamelodi-sundowns) for South African giants Mamelodi Sundowns this week.\n\n \n\nEthiopia played in their familiar style under Kassaye Arage, keeping possession and pressing high up the pitch with their 4-3-3 system. They were not able to create many chances however, with Fasil Tekalign setting up Adama’s defence well with good positional discipline in maintaining a compact low-block that did not allow Coffee to play through them, especially in the first half.\n\n \n\nAdama attacked through counters, with one of the biggest chances of the first half coming off of a counter and a through ball that Dawa Hotessa would have got to the end of if not for Goalkeeper Abel Mamo’s heroics off his line. Abel did well to stay alert and come off his line in this instance.\n\n \n\nEthiopian Coffee’s press was more effective in the second half, as Adama lost the ball in their half more frequently, creating more chances for Coffee. Endale Debalke’s clever chipped pass later gave Abel Endale the opportunity to convert, but he was prevented by a good save from AFCON returnee Jemal Tassew in the Adama goal.\n\n \n\nEthiopian Coffee will get a big opportunity to register their first win in three games next week when they face newly promoted Addis Abeba Ketema, who currently hit in thirteenth place. Adama Ketema will face a tough challenge in the current champions Fasil Kenema.",
  "title": "Coffee continue to be starved of goals without Abubeker",
  "slug": "ethiopian-coffee-goalless-draw-adama",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3 ",
  "thumbnail": "/images/uploads/273423729_469316314725886_656296949666942901_n.jpg"
}