{
  "layout": "blog",
  "date": "2022-01-13T00:11:42.464Z",
  "body": "*(Image: Sports Inc via CFP)*\n\nAfter a disappointing start to their campaign, the Walias have in their second AFCON group game tomorrow, a must win fixture if they still have their sights set on a possible round of sixteen berth. They do however have as opposition, one of the strongest teams in the tournament in none other than Cameroon on home soil no less.  \n\nCameroon showed the rest of the competition what they are capable of when they came back from behind to dispatch a strong Burkina Faso 2-1 side in the tournament opener. With the odds piled against them, the Walias will look to replicate some of their performances against continental giants in recent years, including their dominant 2-1 victory over Cote d’Ivoire during qualifiers for this very tournament in November 2019, as well as a surprise draw etched out away from home against the Black Stars of Ghana in world cup qualifying a few months ago.\n\nWhilst Vincent Aboubakar stole the show with two composed finishes from the penalty slot, Seattle Sounders left back Nouhou Tolo also had a stellar performance on the night. Most of his game was restricted to defending the left flank from assault courtesty of Burkina Faso’s star man Bernard Traore. He came out on top, and throughout the encounter, won fourteen of fifteen duels, blocked two shots, cleared an effort of the line and successfully executed four tackles. It is fortunate for the Ethiopians that one of their main threats in Ethiopian Coffee forward Abubeker Nassir will be deployed on the left wing, opposite Tolo.\n\n![](/images/uploads/850ff7cc2cce50544b81ab1e04e90b24.webp)\n\n> Vincent Aboubakar was in fine form for Cameroon in their opener Image (Reuters - Thaier Al-Sudani)\n\nWhile it isn’t easy to properly analyze Ethiopia’s performance against Cape Verde due to their being reduced to ten men for most of the match, midfielder Amanuel Yohannes was solid in the pivot, with his 87% passing accuracy, five out of eight successful long balls and five duels won. On the other end of the spectrum, his midfield partner Surafel Dagnachew had something of a game to forget, with an eyewatering twenty, yes twenty giveaways reducing his passing accuracy to a meagre 67%.\n\nThe news that Shemeles Bekele will not recover from injury in time for tomorrow’s game will be a huge blow to the Walias' hopes.\n\nThe game will likely be won and lost by goalkeeping performances. In the first round of fixtures, goalkeeper Teklemariam Shanko was Ethiopia’s best player on the pitch with four saves to keep Ethiopia in the match. Inter Milan bound Andre Onana nearly derailed Cameroon’s match when he mishandled a Burkinabe cross midway through the game.\n\nEthiopian football fans are all too aware however, that their team is never far from a goalkeeping howler and will hope that Teklemariam can put on a display on par with what he pulled off against Cape Verde.\n\nCameroon hosts Ethiopia at Yaounde’s ‘Stade d'Olembé at 17h 00 local time.\n\n\n\n*Match performance data obtained from SofaScore.*",
  "thumbnail": "/images/uploads/ee61394e3e5a491fa4945b60a10c11d7.jpeg",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "slug": "ethiopia-cameroon-afcon-must-win",
  "title": "It's do or die as Ethiopia take on AFCON hosts"
}