{
  "layout": "blog",
  "date": "2022-01-26T17:00:59.699Z",
  "body": ">  *The Walias were the first team to arrive in Cameroon for the 2021 AFCON. They were also the first team to be eliminated from the competition (Image: Ethiopian Football Federation)*\n\nIt has been eight long years since Ethiopia last made it to the African Cup of Nations finals. With that taken into account, it is not a surprise that many fans are disappointed by the fact that the Walias have failed to qualify for the knockout round, and in very similar circumstances to their 2013 AFCON showing: bottom of the group with just a single point.\n\n \n\nWhile there are many valid factors that can be discussed as to the reasons for the perceived underperformance of the team, in this article we’re going to explore a factor that was beyond the team’s control: the aspect of luck and group placement, with the premise that the Walias were placed in a stronger than average group that made it harder to secure qualification to the knockout rounds.\n\n \n\n***Quantifying difficulty?***\n\n\n\nIt is important to utilize a relatively neutral metric when quantifying the strength of teams. For this article, the FIFA World Rankings were employed. This is a points based ranking system that depends on FIFA international match results to allot points. This measure is certainly not perfect with many pointing to regional biases in weighting points as a major flaw that benefits teams from some federations, as well as the rankings susceptibilities to being gamed by friendlies. This measure however, is also the most widespread and accessible measure in addition it is crucially employed in classing teams into **pots** during international tournaments.\n\n \n\n***What are pots?***\n\n\n\nAs briefly touched above, pots are a way of classifying teams on the basis of their perceived strength. During the AFCON draw, one team from each pot is selected to constitute a group. This way, most groups have an even distribution of strong and weak teams. Pots are based off of the FIFA World Rankings.\n\n \n\n***Methods:***\n\nTo look at the disparity between teams in a group, two measures will be employed: the average ranking of each group (of all teams in the group), and secondly, the difference in ranking between third and forth placed teams (since this was the difference between proceeding past the group and elimination for two thirds of the forth placed teams and since this experience is more relevant to the Ethiopian national team).\n\n \n\n***Findings:***\n\n\n\n\n\nLet’s first look at the average group rank of the 2021 AFCON groups:\n\n \n\n![](/images/uploads/afcon-rank.png)\n\nLooking at the average rank of each group, we see that the pot system has done what it is supposed to do by making each group just about even in terms of overall strength. This statistic is misleading however, as it obscures the distribution of strong/weak teams. For instance, groups that have three closely ranked teams may have similar average rank as a team with two high ranking and two low ranking teams.\n\n \n\nFor this reason, it would be a good idea to also look at the difference between FIFA rankings of the third and forth pot teams as it would give us a clearer picture of what the ‘weaker teams’ in the group look like. This measure thus helps us focus on the fight for the ‘best third’ spot, which is what many lesser teams were competing for.\n\n\n\n*Average Group disparity (Pot 3 vs Pot 4) for AFCON 2021 groups*\n\n![](/images/uploads/afcon-rank2.png)\n\nWe see here that clearly Ethiopia has gotten the short end of the stick compared to teams in other groups for the 2021 AFCON. The Walias had a rank difference of 63 with the Pot 3 team, Cape Verde. The closest group in terms of rank difference was group F where pot 4 team (and this year’s dark horse) Gambia was ranked 47 places lower than pot 3 team Mauritania. The average pot 4 and pot 3 disparity for AFCON 2021 was **31**.\n\n \n\n \n\nLet us expand the timeframe to give us more context in regards to how rank differences between the pot 4 and pot 3 teams are usually spread out. Let us look at all AFCONs from 2010 onwards:\n\n \n\n*Average Group disparity (Pot 3 vs Pot 4) compared to the all time average:*\n\n![](/images/uploads/afcon3.png)\n\nThe histogram shows us the distribution of rank differences over the last 7 AFCON tournaments and supports the argument that the Walias can be considered unlucky. Over this time period, there were 32 groups in total, of which 25 of them(**78%**) had a rank difference under 50. The average pot 4 and pot 3 disparity for AFCONs starting from 2010 is **26**.\n\n \n\n\n\n*Conclusion:*\n\n\n\nIt’s important to acknowledge the most important limitation of World Rankings, they are volatile, especially to major tournaments like AFCON. A team may perform well in AFCON qualifiers and friendlies but their rankings do not recieve a major bump until they excel in a major tournament.\n\n \n\nEthiopia’s AFCON 2013 group is actually a good example of this, based on world rankings, the Walias were just 28 places away from Burkina Faso whilst Zambia was one of the highest-ranked teams in the tournament lending to them being AFCON champions the prior year. Nonetheless, it was Burkina Faso which topped the group and reached the final, while Zambia crashed and burned. Amusingly, Burkina Faso met the same fate the next year when they finished bottom of their group with 120nd ranked Equatorial Guinea finishing second and qualifying. The ranking system for the most part appears to work however as on average, pot 3 and 4 teams tend to finish in the bottom half of groups.\n\n \n\nThat is to say, while our metric does show that the Walias have been unlucky in light of the team’s official ranking, it ought not to be used as the sole excuse for underperformance. The goal of most teams qualifying for tournaments is to eventually win the whole thing (or at least make it to the latter stages), so these teams need to build the habit of holding their own against high-ranked teams.\n\n<!--EndFragment-->",
  "thumbnail": "/images/uploads/return-quick.jpg",
  "title": "Was Ethiopia disadvantaged by AFCON group stage disparity?",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "slug": "ethiopia-group-stage-arithmetics-natnaiel-mulugeta"
}