{
  "layout": "blog",
  "date": "2022-03-25T03:30:52.053Z",
  "body": "> *(Image Source: Ethiopian Football Federation)*\n\n\n\nComoros will host Ethiopia for the first time ever in a senior male football match on Friday. The Walias will return to the pitch after their group-stage exit from AFCON 2021. Blue Nile Sports takes a look at the two national teams' recent performances ahead of the match at the Stade Omnisports De Malouzini stadium.\n\n\n\nThe Comoros national team are optimistic after a campaign in which they exceeded expectations. In their debut African Cup of Nations, Les Coelacantes made the knockout stages of the tournament, before being knocked out by hosts Cameroon. On the other hand, the Walias also had notable performances against Burkina Faso and an admirable first-half display against Cameroon that can be used as a springboard for the team to build on. It was a tough ask for Webetu’s men to make it out of a group that included hosts Cameroon, Burkina-Faso, and Cape Verde, all ranked above Ethiopia in the FIFA standings. Comoros(131) are ranked seven places above Ethiopia after their positive AFCON campaign. \n\nThe headline story for the Walias is the omission of veteran striker Getaneh Kebede. While the twenty-nine-year-old striker has not set the world alight with his Wolkite City side this season, many observers thought his experience on and off the pitch was integral to this Walias side. Getaneh’s role as a false nine facilitated Ethiopia’s youthful wingers and was crucial to the way the Walias attacked. Ethiopia is not short on prolific strikers, Yigezu Bogale from Sidama Coffee for instance has averaged an impressive 0.57 goals per game in the BetKing Premier League this season, and Dawa Hotessa has replicated his good performances at AFCON for his club side Adama City. Still, questions will linger as to whether Getaneh's role as the deep-lying playmaker can be replicated by any of Ethiopia’s other strikers or Abate will experiment and change his tactics upfront.\n\n![](/images/uploads/getaneh-kebede.jpg)\n\n> *Getaneh Kebede(Image Source: Getty Images)*\n\nWhile the Walias lose the experience of Kebede, they will be seeing the return of veteran Shimeles Bekele. The midfielder was absent from Ethiopia’s AFCON campaign with an injury and his return will be a boost to the midfield, where he partners up well with Ammanuel Yohannes. The pair have the passing range and press resistance which can decide the midfield battle against Comoros.\n\n\n\nEthiopia will need to go into the game believing that they can win. Despite their AFCON performances, Comoros only won a single game in the whole tournament and had a leaky defense that let in an average of 1.75 goals per game. In February 2022, Comoros named Frenchman Younes Zerdouk as their new national team coach, following the departure of Amir Abdou. The match will be his first test in the dugout and hope to continue their AFCON success with a win against Ethiopia.",
  "thumbnail": "/images/uploads/1024x576_cmsv2_38dbae87-ff01-5f01-8c0a-26718a495995-5511750.jpg",
  "title": "Ethiopia Comoros Match Preview",
  "slug": "ethiopia-comoros-match-preview",
  "author": "Ebawak Tesfaye @negussu_ , Natnaiel Mulugeta @NatnaielMuluge3"
}