{
  "layout": "blog",
  "date": "2022-02-11T03:51:20.751Z",
  "title": " Fasil Kenema's title defense hits roadblock against Adama City ",
  "body": ">\n>\n>  *(Image: Ethiopian Premier League Share Company)*\n>\n>\n\n<!--StartFragment-->\n\nDefending champions Fasil Kenema were held to a disappointing 1-1 draw against coach Fasil Tekalign’s Adama City. Adama started the first half on the front foot and were able to create a plethora of goal-scoring chances in the first twenty minutes.  Fasil slowly grew into the game with the guidance of maverick Surafel Daganchew. The Emperors were in control of the game and looked likely to score after the initial wave of Adama dominance. At the half-hour mark, Adama took the lead against the run of play.  Jemil Yakob's cross was met by Ame Mohammed's right foot on the volley to score from inside the penalty box.  \n\n\n\nSeyoum Kebede responded by making two substitutions at halftime to rally his team for a comeback. In hope of sustaining their title challenge, Fasil piled on the pressure. Bereket Desta was pulling the strings along with Surafel to penetrate Adama's defense. Bereket came the closest to scoring around the hour mark but Adama remained solid. Fifteen minutes later Okiki Afolabi equalized for Fasil with a header. Adama's goalkeeper Jemal Tassew misjudged the flight of the ball that was crossed from his left side to put Okiki through for an open header. \n\n![](/images/uploads/okiki.jpg \" Fasil Kenema's title defense hits roadblock against Adama City\")\n\n>\n>\n> *Okiki Afolabi* *(Image: Ethiopian Premier League Share Company)*\n>\n>\n\nIt was one-way traffic following the equalizer. Fasil desperately pushed for all three points in the limited amount of time available while Adama seemed content with the one. In the end, Adama were able to hold on to register their eighth draw of the season. \n\n\n\nFasil have now only won two games in their last five matches. Meanwhile, Adama are top of the league in terms of draws. Adama have only lost on a single occasion but have the highest number of draws in the league this season with eight out of their twelve games ending in stalemates.\n\n\n\nThe result sees Adama pull into fifth place in the Ethiopian Premier League table, Fasil sits second only a point ahead of Hawassa City in third who play Bahir Dar this match week.\n\n\n\n<!--EndFragment-->",
  "author": "Ebawak Tesfaye @negussu_ ",
  "thumbnail": "/images/uploads/fasil1.jpg",
  "slug": "fasil-kenemas-title-defense-hits-roadblock-against-adama-city"
}