{
  "layout": "blog",
  "date": "2022-02-22T23:25:22.231Z",
  "body": "> *Bezabeh marks his return with a goal(Image: Ethiopian Premier League Share Company)*\n\nMonday’s late kick-off pit 2020/21 BetKing Ethiopian Premier League Champions and runners-up against each other as both had to settle for a hard-fought 1-1 draw. Defending champions Fasil Kenema have looked off the pace recently, with only one win in the last five games. Ethiopia Coffee have also had an underwhelming season and came into the match with identical form with Fasil over their last five games.\n\nAll eyes were on Ethiopian National Team stars Abubeker Nasir and Surafel Dagnachew as the pair looked to reignite the season for their respective clubs. Surafel has been due a goal for the past season and a half while Abubeker is looking to get Ethiopia Coffee up the table and end his spell at Coffee on a high note before his big move to Mamelodi Sundowns.\n\nIn need of a result, both teams started the game with urgency hoping to strike the first blow. It was end-to-end for the first forty minutes which saw Fasil take the lead in the thirty-fifth minute. Bezabeh Meleyo marked his return to the starting lineup with a goal as his one-two pass with Bereket Desta allowed him to get past his marker and smash home the opener. Fasil’s lead did not last long however, Ethiopia Coffee equalized from Abubeker Nasir’s free-kick which hit the post before fortunately rebounding on to the incoming Coffee’s defender Abebe Tilahun for a tap-in. \n\n![](/images/uploads/bunna1.jpg)\n\n> *Ethiopia Coffee celebrate a swift equalizer(Image: Ethiopian Premier League Share Company)*\n\nIn the second half,  both teams sought to control the game and nick a goal to win the match. In the process of doing so, frustrations frequently boiled over leading to some unfortunate scenes. Decisions of the referee, who made some questionable calls on the night, were crucial in deciding the balance of a tightly contested second half. Shemeket Gugsa, already on a yellow, was fortunate to stay on the pitch after his high-flying boot made contact with Ethiopia Coffee's goalkeeper Abel Mamo. \n\nIt was a thriller for the neutrals of the game which saw seven yellow cards given out on the day but Kasaye Arage and Seyoum Kebede may both feel that it was two points dropped. Fasil risk dropping to fourth and being seven points adrift off the top whilst Coffee may slip into the bottom half of the table on the back of this result.\n\n<!--EndFragment-->",
  "title": "Fasil Kenema's title hopes hit a dent against out of form Ethiopia Coffee",
  "author": "Ebawak Tesfaye @negussu_ ",
  "slug": "fasil-kenemas-title-hopes-hit-a-dent-against-out-of-form-ethiopia-coffee",
  "thumbnail": "/images/uploads/fasil-meleyo.jpg"
}