{
  "layout": "blog",
  "date": "2022-06-26T01:25:30.529Z",
  "title": "Gameweek 28 In Review",
  "slug": "gameweek-28-in-review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "body": "## Saint George and Fasil Kenema Neck and Neck\n\nThe race for the league title took another interesting turn this week after Saint George were held to a 1-1 draw against Hadiya Hossana. Saint George will feel desperately unlucky that they did not collect three points as they dominated proceedings on the day. Hadiya goalkeeper Messay Ayano in particular had a good game as he had to pull out all of the stops to prevent the game from getting away from Hadiya. One of his best saves of the game came in the 29th minute when he pushed a blistering Cherinet Gugsa shot onto the crossbar. Saint George opened the scoring via an excellent early cross from Suleiman Hamid that Amanuel Gebremichael was able to head down past the keeper in the 36th minute. Saint George were unrelenting after their first goal but saves by Messay Ayano kept the score 1-0 going into the second half. Saint George were inches away from doubling their lead in the 65th minute when Gebremichael was yet again able to connect with an early cross from the right (this time the crosser of the ball was Dagmawi Araya). Gebremichael was able to control this ball and flicked the ball up past Eyasu Tamiru before putting the ball past the keeper, but a brilliant goal-line clearance from Frazer Kassa prevented a goal. \n\n\n\nAll of Saint George’s hard work was canceled out in the 79th minute as the Horsemen were caught napping when defending a corner. Ephrem Zecharias was able to run to the near post unchallenged, before redirecting Birhanu Bekele’s cross into the back of the net via an excellent volley from a tight angle. This is the second time this season that Hadiya have held Saint George after the sides drew 0-0 in the first half of the season. What makes this more disappointing for Saint George compared to the first meeting would be that Hadiya had relatively little to play for given that they are virtually safe from relegation. After this draw, Saint George have now only won two of their last six games. Before this poor run of results, Saint George were dominating the league with 50 points collected in GW22. Compared to where they are now, that was a Points Per Game of 2.27 compared to their current Points Per Game of 2.0. In comparison, Fasil Kenema won the league last season with an average of 2.125 Points Per Game, and Mekelle 70 Enderta averaged 1.97 Points Per Game in their title-winning season. Both Saint George and Fasil Kenema are performing at the level of a typical title-winning side in this year’s competitive race. \n\n![](/images/uploads/hadiya-vs-saint-george.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nFasil Kenema went into their game with Hawassa City the following day looking to capitalize on the Saint George slipup. As was the case in their last game against Adama City, it was Surafel Dagnatchew and Mujib Kassim that linked up as the difference makers. Dagnatchew drilled in a cross from the right for Kassim to leap and head into the back of the net in the 9th minute for the sole goal of the game. Mujib continued being a menace as it was his presence in the box that took out two defenders and allowed Bereket Desta to get a dangerous shot off in the 16th minute. Fasil had the better of the chances in the first half, with the Hawassa keeper Mohammed Muntari making decent saves to keep his side in the game. \n\n\n\nMesfin Tafesse had the best chance of the game for Hawassa as Biruk Beyene threaded a ball for Tafesse after which he was able to deceive the Fasil Kenema defense with a Cruyff turn and unload a shot that dragged just wide of the post. Fasil were able to hold on for three points to narrow the gap between them and Saint George to just one point. Mujib Kassim’s aerial threat has been serving Fasil well in recent weeks, with the forward scoring three goals in his last two games. Surafel Dagnatchew has also been one of Fasil’s main creative outlets this season, with the attacking midfielder now being the joint highest assistor in the league with seven goals created this season. Just as important as their offensive counterparts, it would be remiss not to acknowledge how solid Fasil’s defense has been in their 9 game winning streak. Samake Mikel, Yared Baye, Amsalu Tilahun, Aschalew Tamene, Koulibaly Kadir, and Seid Hassen have all featured in this defensive unit that has only conceded a remarkable two goals in their past nine matches. \n\n![](/images/uploads/kassim-vs-hawassa.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## Dire Dawa and Adama sink further as Addis, Bahir Dar get crucial wins\n\nSebeta City confirmed their relegation from the Premier League after their 4-3 loss to Addis Ababa City this week. This game mirrored Sebeta’s previous loss to Addis in the first round of the season: both were high-scoring games in which the attacking talents of Fitsum Tilahun and Richmond Adongo overpowered Sebeta City’s defense. Addis Ababa dominated the first 10 minutes of proceedings only for Sebeta to score the opener in the 15th minute via a brilliant individual goal from Sebeta’s Fitsum Gebremariam. Sebeta’s lead did not last for long as their defense afforded Fitsum Tilahun acres of space on the left which allowed him to cut inside and score the equalizer just five minutes later. Tilahun showed off his versatility in the 29th minute when he gave his side the lead via an exquisite header from a floated Endale Kebede cross on the right. A nearly identical combination came about in the 44th minute as Endale Kebede whipped an early cross from the left this time for Tilahun. Sebeta Keeper Solomon Demise was able to deny the winger on this occasion only to see Adongo convert his saved ball into a goal. \n\n\n\n Sebeta’s vulnerability from crosses was on display yet again in the 52nd minute as Muluken Addisu whipped an early cross that Adongo headed into the back of the net for his second goal. Addis Ababa put their foot off the pedal after this goal which allowed Sebeta a way back into the game. Fitsum Gebremariam continued his impressive game as he displayed a brilliant first touch to bring a cross under his control for an emphatic finish in the 66th minute. Addis Ababa looked in danger of collapse in the 87th minute as substitute Samuel Saliso saw his shot from outside the box deflected in the net. Addis held on however to greatly improve their survival prospects at the expense of Sebeta’s place in the Premier League. Addis Ababa have now risen to 11th and put a 3-point buffer between them and the final relegation spot. Richmond Adongo also launched himself top of the goal-scoring leaderboard with his goal tally for the season going up to 14. This game served as a microcosm of Addis Ababa’s season, Addis Ababa’s attacking prowess is one of the best in the league in terms of goalscoring, but their leaky defense often lets them down. Addis’s safety can largely be put down to their recent form as they have picked up 9 out of their possible last fifteen points, putting them in the top five for the last five games. \n\n![](/images/uploads/fitsum-tilahun-v-sebeta.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nA side that has the exact opposite issue that Addis Ababa have is Adama who have one of the best defenses in the league but have had issues with goal scoring all season. The 20 goals that Adama have scored this season is tied for the lowest in the league alongside Sebeta City. Their solid defensive record has started to unravel in the past three games as well though as they conceded four in these games. Adama have dangerous forwards in the likes of Dawa Hotessa and Ame Mohammed but for some reason, these players have not been able to score consistently this season. These problems were plain to see in their dour 0-0 draw against Defense Force. Adama find themselves only two points away from the relegation zone. Adama’s next game will no doubt be one of the most important of their season, as it will be a relegation six-pointer against Dire Dawa. Win and Adama guarantee their place in their league, lose and they will be dragged into the final relegation position with one game remaining. \n\n\n\n\n\nAddis Ababa’s victory this week also confirmed that Jimma Aba Jifar’s time in the Premier League has come to an end. Yusuf Ali’s side could not produce a result against 6th placed Welayta Dicha after taking the lead in the 24th minute via a goal of the season contender from Mesud Mohammed from outside the box. Jimma will be disappointed to not have improved on their finish from last season as they similarly finished second bottom last season only to survive via the special relegation play-offs. With the bottom two spots confirmed, Dire Dawa’s position in the Premier League was put in increasing peril as they failed to pick up points against Bahir Dar. The side has not been able to keep up pace with Addis Ababa as they have lost their last three games. This week’s loss looks to be the most devastating blow as it not only kept Dire Dawa rooted to 14th place, it also served as a launching pad to lift Bahir Dar away from relegation trouble. It was a huge win for Abraham Mebrahtu’s side as their first win in three saw them open up a four-point relegation gap between them and the remaining relegation spot.\n\n\n\n![](/images/uploads/bahir-dar-vs-dire.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## Abubekir’s Farewell\n\n\n\nThis week saw Ethiopia Coffee and the Ethiopian Premier League say farewell to one of its most promising prospects, as Abubekir Nassir closed out his time at Ethiopia Coffee after two impressive seasons with the senior squad. Coffee fans filled the stadium as a guard of Honor was held to send him off. In his time spent in the league, Nassir managed to break the League record for goals in a single season as the forward registered 27 goals in the 2020/21 campaign. With Abubekir achieving all these remarkable feats at the young age of 22, Ethiopian Football has high hopes that Nassir can take his game to the next level abroad. Nassir will now head to South Africa to join his new club Mamelodi Sundowns, 12-time champions of the PSL. He follows in the footsteps of Getaneh Kebede, who had a 3-year stint in the South African PSL from 2013-2016. The level of influence that the youngster has at Coffee is quite remarkable as Nassir has had 46 goal contributions in his last two seasons which accounts for more than 60% of Coffee’s goals over this time period. It will no doubt be a massive endeavor for Kassaye Arage to replace his goals next season. \n\n\n\nRelative to Nassir’s departure, Coffee’s game against Arba Minch felt like an afterthought as the two sides were squarely midtable and were not playing for much.  Arbaminch scored the solitary goal of the game in the 44th minute as a lovely weighted through pass from the midfield set Ahmed Husain off, all Husain had to do was to poke the ball past the Coffee goalkeeper Bereket Amare. Ethiopia Coffee had a majority of the chances in the game with 14 shots in total compared to Arba Minch’s 10 but most of these shots did not ultimately test keeper Yishak Tegegn leading to a victory for Arba Minch that sees them get to one point within Coffee in 6th place. While both sides played a fairly inconsequential game this week, Coffee and Arbaminch have the ability to alter the course of the title race in Gameweek 29. Arba Minch City face Saint George. Saint George will face a formidable opponent as Arbaminch have been the second-best side in the league based on the last five games, collecting 13 points in this period. Ethiopia Coffee meanwhile, face Fasil Kenema being handicapped with the departure of star\n\n![](/images/uploads/abuki-farewell.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*",
  "thumbnail": "/images/uploads/fasil-fans.jpg"
}