{
  "layout": "blog",
  "date": "2022-06-22T02:27:26.023Z",
  "title": "Gameweek 27 in Review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "thumbnail": "/images/uploads/hawassa-vs-bahir-dar2.jpg",
  "body": "\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n\n\n## Saint George Vs Wolkite City\n\n\n\nSaint George and Wolkite City met in one of the most important matches of the week. The Horsemen will have gone into the game with jangly nerves as Fasil Kenema were getting closer to the league leaders by the week as Saint George dropped points in their previous two games. Wolkite on the other hand were nowhere near the summit of the table, as they have the second-worst points tally in the league over the last ten Premier League matches. To make things worse for Wolkite, their top scorer and captain Getaneh Kebede is currently serving a three-game suspension after an alleged incident with match officials in gameweek 25 against Hadiya Hossana. Wolkite had brought forth an appeal towards the Ethiopian FA to allow Getanhe to play against his former club but a dispute between the FA and the League Shareholder company meant that the forward remained suspended for this match. \n\n\n\nSaint George dominated proceedings in the first half without really testing Wolkite keeper Seid Habtamu. A majority of this threat came via the Horsemen’s right-hand side, Henok Adugna launched a good ball into the box towards Kannan Markneh in the 9th minute but Markneh’s header was straight at the Habtamu. Markneh was involved in another chance in the 18th minute, as he made a threatening run after receiving a lay off from Cherinet Gugsa before passing it to Abel Yalew Yalew drilled a ball into a dangerous central area in the box from the right channel but there was no one to capitalize. \n\n![](/images/uploads/saint-georgev-wolkite-markneh.jpg)\n\n\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nAs has been the case for many games this season, many of Saint George's most dangerous chances were created from their set-pieces. Center Back Frimpong Mensu hit a good direct Fk that was saved by Seid. When Saint George’s opener arrived, it was no surprise that it arrived via a set-piece as well. Adugna delivered the corner that led to the goal. Amanuel Gebremichael headed the ball towards goal but could not keep the ball low enough to avoid the crossbar. It looked like the chance had gone when the ball ricocheted back to the keeper. Habtamu Seid could not hold on to the ball, however, and Markneh took advantage of the spilled ball to score the opener.\n\nThe second half was more of the same as Saint George threatened from a Henok Adugna corner yet again as the Wolkite keeper’s struggles in dealing with crosses was put on display when he yet again spilled his attempt to catch the corner. Markneh’s attempt to feed from the keeper’s scraps again was prevented by a goal-line clearance by Wuhub Admas. Not long after in the 79th minute, Saint George substitute Dagmawi Araya was brought down by Challa Tashita inside the box. Gatoch Panom scored from the resulting penalty for his second goal of the season.  Ismael Oguru, who was on top of the goalscoring charts before an injury sidelined him, nearly got a goal in his substitute appearance in the dying minutes of the game as Araya crossed a good ball towards Ogoro. Ogoro used excellent technique to get power on the header, but it was placed too close to the keeper.  In the end, Saint George were the deserved winners on the day as they created more clear-cut chances. The horsemen generated 4 shots on target compared to the one created by Wolkite.\n\n![](/images/uploads/saint-georgev-wolkite-panom.jpg)\n\n\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n\n\n## Bahir Dar City Vs Hawassa City\n\n\n\nAbraham Mebrahtu's side came into this game desperate for a win as they looked to get away from the relegation scrap. Bahir Dar did have a promising start as Hawassa goalkeeper Mohammed Muntari had to be on his toes in the opening minutes of the game as Ali Suleiman tested him on two occasions in the 2nd and 9th minutes. Bahir Dar created both of these chances for the Eritrean on the right half-space inside the box. Hawassa got their first major attempt of the game immediately in the 16th minute as a dangerous ball was crossed in from the right, Biruk Beyene should have done better with converting this cross with the amount of time and space he had, his attempt hit the crossbar and went out for a goal kick. \n\n\n\nA clever back-heel from Ephrem Ashamo put Wondimagegn Hailu through on goal for Hawassa in the 33rd minute: his attempt to place the ball into the back of the net from outside of the box went wide. Hawassa's Kalongi Mondiya delivered a brilliant diagonal ball for Mintesinot Endriyas who was gifted by a rash decision by Fasil Gebremichael to come out of his box to deal with the danger. Endriyas bypassed the Bahir Dar goalkeeper easily and put the ball into the back of an empty net in the 36th minute. \n\n![](/images/uploads/hawassa-vs-bahir-dar.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nIt would be harsh to judge Fasil Gebremichael for the second goal however, Brook Beyene provided a spectacular swerving finish after he cut inside from his left-hand side outside the box. It was a shot that would be difficult to save for most keepers as the ball looped to the far post before bouncing into the back of the net. Bahir Dar got their consolation goal in the dying minutes as Mawuli provided a snapshot finish after receiving a pass from Adam Abas.\n\n\n\nGoalkeeping mistakes have been haunting Bahir Dar in recent weeks, with this being the third instance in their last two games that Fasil Gebremichael’s difficulty when coming off his line has cost Bahir Dar a goal. Hawassa got a big boost following that win, as they have been on a poor spell as of late. Prior to these last two fixtures: Hawassa had only picked up 9 points from 10 games. It seems as if they have now turned it around by getting successive wins for the first time since Gameweek 14. Things look less rosy for Bahir Dar, who have 2 wins in their last 10 (one of which was a game they had drawn on the pitch to Wolkite only to be awarded a 3-0 win after Wolkite were found to have fielded an ineligible player ). One of the few positives for Bahir Dar is that they are averaging more than a goal a game over the last three matches, an improvement over their goalscoring form earlier on in the season. Mawuli has been a big contributor of goals as he has scored three in their last two games.\n\n![](/images/uploads/hawassa-vs-bahir-dar-3.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n\n\n## Fasil Kenema vs Adama City \n\n\n\nFasil Kenema and Adama City met in what was a high-stakes match for both ends of the table. Fasil were on the heels of league leaders Saint George with a win on the day taking them within three points of first place. Adama on the flip side were looking to get away from the relegation zone as Dire Dawa City and Addis Ababa City’s improved form over the past 10 games has threatened the position of sides further up the table. \n\n\n\nThe first half was not one of many dangerous chances, and there was not much in the way of goalmouth action until the opening goal in the 55th minute. This was created via fantastic vision from the creative Surafel Dagnatchew. He threaded a lovely weighted through ball for Mujib Kassim, who was able to go in front of Adama’s Eyob Mathias and get on the end of the ball to put it into the back of the net. \n\n![](/images/uploads/fasilvadama-qassim.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nAdama gave Fasil a major scare in the 70th minute, as Addis Tesfaye delivered a cross that Ame Mohammed was able to head well towards goal. It took a good save from Mikel Samake to prevent a goal. Fasil got their second goal five minutes later, with the Dagnachew and Kassim linkup proving deadly yet again, this time from a set-piece routine. Dagntachew delivered a dangerous in-swinging free-kick from some distance out that Mujib finished in a rather unorthodox fashion as the ball looked to have bounced off of his shoulder. \n\n\n\nThis win keeps the pressure on Saint George as the gap between the top two clubs is back down to three points with three games remaining. Adama meanwhile, are only a point away from the relegation zone. The relegation battle looks like it will go down to the wire this season as there are currently four teams within a point of each other fighting to avoid the final relegation spot.\n\n![](/images/uploads/fasilvadamaqassim2.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n\n\n## Ethiopia Coffee Vs Addis Ababa\n\n\n\nDespite being on opposite ends of the table (Ethiopian Coffee occupying 4th place while Addis Ababa were languishing in 14th position ) both were also on a streak of good form. Looking at the past ten games, Addis Ababa were the 7th best team in the league while Bunna were the third-best team in the league for this time period. \n\n\n\nAddis Ababa were the better of the two teams in the first half of the match. While Ethiopia Coffee have shown a propensity to be vulnerable from incisive through balls due to their high defensive line, their main defensive weakness in this game was their inability to deal with crosses into their box. This was evident as early as the 5th minute when Endale Kebede delivered a good cross towards Richmond Adongo whose attempt was kept out by Bereket Amare. Coffee's susceptibility towards aerial balls continued in the 17th minute, this time from a Free kick, Muluken Addisu floated an inswinger for number Eyob Beketa to get a header on. His attempt smacked the post and out of danger in what was a close call for Coffee. \n\n![](/images/uploads/addis-ababa-vs-ethiopia-coffee.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nAddis Ababa continued their dominance as Muluken Addisu delivered another quality long ball that Fitsum Alemu was able to take into his stride via excellent chest control. The winger got his shot off on the left side of the box but Bereket Amare was able to push this shot towards the post in the 28th minute. After all this persistent pressure, Addis Ababa finally got a deserved goal in the 34th minute as Fitsum Alemu turned provider when he supplied a cross from the left for Endale, who was left unmarked in the box by Coffee’s Asrat Tunjo and was afforded the time to land a solid header from the back post. \n\n\n\nEthiopia Coffee got back into the game immediately after kickoff in the second half. Addis Ababa will feel hard done by on the day as there did not seem like much contact in the foul that was awarded against Limeneh Tadesse and in favor of Abubekir Nassir. Nassir converted the penalty to go top of the Premier League top scorer chart alongside Yigezu Bogale with 14 goals. No more goals were conceded after this in large part due to good performances from both teams’ goalkeepers.  Coffee’s Bereket Amare had a wonderful double save in the 54th minute to deny  Fitsum Tilahun venomous outside-the-box shot as well as the follow-up effort from Richmond Adongo. On the other side of the pitch, Daniel Teshome made good use of his legs to deny Bunna's best open-play attempt in the 69th minute after Tafesse Solomon threaded an excellent through ball for Nassir. \n\n![](/images/uploads/nassir-vs-addis.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nWhile Addis Ababa will be on the whole disappointed with the scoreboard (Paulos Getachew’s team registered 6 shots on target compared to Coffee’s 2), the solitary point that the team earned puts them outside of the relegation zone for the first time since Gameweek 18. This will no doubt be a huge psychological boost for the team in their battle for survival. Addis Ababa are currently on a remarkable 9-game unbeaten run, the issue being that only two of these nine games have been wins.",
  "slug": "gameweek-27-in-review"
}