{
  "layout": "blog",
  "date": "2022-02-19T01:35:23.138Z",
  "body": "\n\n> *Image: Ethiopian Premier League Share Company)*\n\nSaint George failed to capitalize on dropped points by title rivals and widen the points gap between them and the chasing pack of title contenders against a determined Hadiya in Thursday’s early kick-off. Earlier in the game week, Champions Fasil lost to Hawassa City who leapfrogged them into second in the standings. League leaders Saint George came into the game with a five-game winning streak. Hadiya also came into the game with good confidence, only losing once in the past five games.\n\n\n\nThe deadly trio of Abel Yalew, Amanuel Gebremichael, and, Ismail Ouro Agoro have scored a total of 13 league goals so far with the galloping Horsemen making a habit of beating opponents with a large goal margin. To counteract the threat posed by St. George's attack Mulugeta Mihiret's Hadiya chose to sit back and defend in a low block to deny space and time for the pacy wingers of Saint George. \n\n\n\n![](/images/uploads/aman.jpg)\n\n> *Image: Ethiopian Premier League Share Company)*\n\nIt was a tactical master class from the former Bahir Dar and Ethiopian National team player Mulugeta Mihiret. Saint George failed to register a goal attempt until the seventeenth minute. Hadiya created chances on the counter-attack but didn't threaten Charles Lukwago's net. St. George dominated possession but were frequently frustrated by the determined defending of Hadiya.\n\n\n\nAfter the break, the Horsemen upped the tempo but failed to hit the net despite finding themselves in promising positions. This season holds the promise of a first title win in five years for Zerihun Shengeta's Saint George, making their dropped points against Hadiya all the more infuriating for supporters who traveled from the capital in large numbers to Dire Dawa. Hadiya's game plan to defend as a unit and stifle opponents' attacks was effective on the day to earn a point against strong opposition. The draw maintains Hadiya's league position at ninth. Saint George failed to register a goal for the fourth time this season.\n\n\n\n<!--EndFragment-->",
  "title": "Hadiya Hossana hold league leaders Saint George to a goalless draw.",
  "thumbnail": "/images/uploads/hadiya-2.jpg",
  "author": "Ebawak Tesfaye @negussu_",
  "slug": "hadiya-hossana-hold-league-leaders-saint-george-to-a-goalless-draw"
}