{
  "layout": "blog",
  "date": "2022-02-16T02:17:28.982Z",
  "body": "<!--StartFragment-->\n\n> *Hawassa Kenema (Image: Ethiopian Premier League Share Company)*\n\n<!--EndFragment-->\n\nReigning champions Fasil Kenema slumped to a defeat against a resurgent Hawassa City on the first day of game week thirteen of the Ethiopian Premier League. \n\nFasil went into the game at Dire Dawa Stadium hoping to return to consistency and catch up to title rivals Saint George. Fasil's recent form had been middling as they ranked seventh on the form table for the last five games with eight points. Hawassa on the other hand have fared better, collecting ten points from the maximum fifteen.\n\n Even though a majority of the game was characterized by a dearth of shots and goalmouth action (particularly the first half), the game never failed to be entertaining due to the end-to-end nature and intensity of play employed by both teams. Both Fasil and Hawassa came in with similar formations, swarming the midfield with five players. Both teams also attempted the use of a counter press to win the ball back high up the pitch.\n\nFasil was more threatening in the opening half, with Hawassa giving away many set-pieces where many of these Fasil chances were created. It is not surprising then that Surafel Dagnatchew was Fasil's most threatening player in this half. Fasil also sought to exploit the spaces created out wide from the congested midfield, using switch passing effectively, particularly on their left-hand side.\n\nFasil's Achilles heel throughout the match was their inability to deal with transitional play. Hawassa was excellent when breaking on the counter. They sent the Emperors a warning in the twenty-first minute when Tebarek Hefamo seemed to have won his side a penalty on the counter only for it to be called offside. \n\nFasil defender Koulibaly Kedir in particular had a game to forget, getting beat for a Tebarek Hefamo shot in the thirty-second minute as well getting dispossessed by Tebarek again in a dangerous position which would have led to a penalty had the offside flag not been raised. Things went from bad to worse for the defender in the fifty-ninth minute when miscommunication with his keeper led Koulibally to head the ball into his own net for Hawassa's opener.\n\nOn the other end of the spectrum, Shimekit Gugsa had a good game for The Emperors, threatening Hawassa Goalie Muntari with a couple of shots inside the box. He also provided a well-worked assist for Fasil's goal, whipping in an early cross on the right for Fekadu Alemu to flick past Hawassa's keeper.\n\n![](/images/uploads/fasil-gugsa.jpg)\n\n> *S.Gugsa & F.Alemu (Image: Ethiopian Premier League Share Company)*\n\nHawassa were clinical on the day, scoring two goals from just two shots on target. Crucial to this was the pacy youthfulness and finishing techniques of  Wendemagn Hailu and Tebarek Hefamo.\n\nIn the end, it was this pace on the break and Fasil's weakness in transition that decided the game. Fasil left themselves exposed in the back during a frantic search for the winner, with a Fasil corner leading to blistering Gugsa shot that smacked the post. Wondimagegn dispossessed Amsalu Tilahun from the resulting play and went on a slaloming run before slotting the ball past Fasil keeper Samake in the eighty-fifth minute.\n\nWith this win, Hawassa City has overtaken Fasil Kenema to second place. Fasil risk slipping to fourth place if Wolaitta Dicha can win their game against Jimma Aba Jifar.",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "title": "Hawassa City's Youth Outpace Leaky Fasil",
  "slug": "hawassas-youth-outpace-leaky-fasil",
  "thumbnail": "/images/uploads/hawassa-wondimagegn.jpg"
}