{
  "layout": "blog",
  "date": "2022-02-18T05:14:04.274Z",
  "title": "Dissecting the “home field” advantage in the 2020-21 Ethiopian Premier League",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "body": "*(Image: St. George)*\n\nSince its formation in 1997,  The Ethiopian top flight has employed the double round-robin format (every team playing each other, visiting each other’s homeground once in a season). With the advent of the covid 19 pandemic however, the BetKing Ethiopian Premier League’s shareholders have embraced having phases for the league.  Each phase contains multiple gameweeks and is played in a different stadium. This new format has solved many of the issues impeding the league’s restart during the height of the covid-19 pandemic, mostly related to keeping all teams and squads in a bubble and the logistics of travel in the pandemic. Additionally, multiple matchweeks played in a single location made the logistics of broadcasting the games much easier with the advent of the TV deal. The format served the league so well last year that it has been kept for the 21/22 season.\n\n \n\nWhile this new format has solved some fairly serious bottlenecks, it has also created new problems of its own. The most obvious being one of fairness. Teams from the selected host cities have the advantage of playing in their home field for multiple weeks while teams that come from cities with less developed footballing infrastructure do not get the same luxury. This effect would seem to be compounded this season with fans being allowed back in stadiums. It is thus important to study if home advantage was evident in last season’s games.\n\n \n\n\n\n\n\n***Analyzing a venue’s impact***\n\n\n\nIn this article, the home teams (teams who had games played in their stadiums or had stadiums in their cities) would be: Ethiopian Coffee, St. George, Sebeta Kenema, Sidama Coffee, Hawassa Kenema, Jimma Aba Jifar, Dire Dawa Ketema and Bahir Dar Ketema.\n\n\n\n \n\n \n\nFor starters, let's look at the points tables for each stadium.\n\n *Dire Dawa Stadium*\n\n![](/images/uploads/diredawa.png)\n\n*Bahir Dar Stadium*\n\n![](/images/uploads/bahir-dar.png)\n\n*Hawassa University Stadium*\n\n![](/images/uploads/hawassa-stadium.png)\n\n\n\n*Jimma University Stadium*\n\n![](/images/uploads/jimma.png)\n\n\n  \n \n\nThe above tables are crude in the sense that they do not exactly separate teams who do well as a result of the home ground and teams who play well regardless.\n\n \n\n***Stadium Effects***\n\n In an attempt to separate the two factors, we constructed a measure of performance at each stadium. We created the ‘Stadium Effect’ variable for this purpose. As the name indicates, it is a measure of how much a specific stadium affects a team’s performance. This was calculated by dividing a team’s average points per game (ppg) for the 2020 season by the ppg for the team in that specific stadium. This means that any value above 1 indicates overperforming average season performance while a value below 1 indicates under-performance.\n\n \n\nOf all the sides that were able to play at their home grounds, Bahir Dar, Sidama Coffee, Dire Dawa Ketema, Ethiopian Coffee performed better at their home Stadiums while Jimma Aba Jifar was a major outlier, vastly outperforming at Bahir Dar Stadium.\n\n![](/images/uploads/st-goerge.png)\n\n![](/images/uploads/bahir-dar-graph.png)\n\n![](/images/uploads/sebeta.png)\n\n![](/images/uploads/diredawa-graph.png)\n\n![](/images/uploads/hawassa-graph.png)\n\n![](/images/uploads/sidama-graph.png)\n\n![](/images/uploads/jimma-graph.png)\n\n\n\n\n\n\n\n\n \n\nAmong other notable observations, Jimma had the biggest stadium effect in a positive direction, with it outperforming its season average at Bahir Dar stadium with a score of 2.08.\n\n \n\nAs for teams that suffered the most, using variance, we can also look at the teams who were most/least affected by the stadium that a game was played in.\n\n \n\n*Club*\n\n*Adama Ketema        0.467528*\n\n*Bahir Dar Ketema    0.236438*\n\n*Diredawa Ketema     0.181263*\n\n*Ethiopia Bunna      0.119659*\n\n*Fasil Kenema        0.090463*\n\n*Hadiya Hossana      0.082185*\n\n*Hawassa Ketema      0.204670*\n\n*Jimma Aba Jifar     0.426631*\n\n*Kidus Giorgis       0.045630*\n\n*Sebeta Ketema       0.146930*\n\n*Sidama Bunna        0.549304*\n\n*Wolaitta Dicha      0.242094*\n\n*Wolkite Ketema      0.547504*\n\n\n\n\n\n\n\nLooking at the variance scores, it seems like Wolkite, Adama, Sidama were the most affected by stadiums whereas Hadiya Hossana, Fasil Kenema, St. George were consistent from stadium to stadium. There may be a potential correlation between team quality and stadium effect that should be explored further.\n\n \n\n\n\n***Limitations:***\n\n\n\nIt is important to note that this analysis is limited by multiple factors that have not been accounted for and are hard to quantify such as form, injuries, managerial changes, player transfers and more. Additionally, this season sees the reintroduction of fans into home grounds, which may benefit home teams even more.\n\n<!--EndFragment-->",
  "slug": "home-field-advantage-ethiopian-premier-league",
  "thumbnail": "/images/uploads/74419593_2327028597407967_5636164107980767232_n.jpg"
}