{
  "layout": "blog",
  "date": "2022-02-10T01:22:18.892Z",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "title": "In form Ayano leads Hadiya Hossana  to victory",
  "thumbnail": "/images/uploads/hadiya-messay.jpg",
  "body": "> *Hadiya Hossana (Image: Ethiopian Premier League Share Company)*\n\nSebeta Ketema slumped to a fourth consecutive defeat after a penalty saw Hadiya Hossana pick up all three points on the first matchday of the twelfth round of Ethiopian Premier League at Dire Dawa International Stadium.\n\n\n\nIt was clear to observers going into the game that Sebeta needed a win much more urgently than Hadiya, with Sebeta coach Zelalem Shiferaw frankly admitting that his job was under scrutiny in his pre-match interview.\n\n\n\nSebeta started brightly, dominating the first half. Sebeta were particularly productive in utilizing set-piece opportunities, with Saliso 's crosses consistently creating dangerous situations. One of the biggest chances came from a free-kick that saw Zecharias Fikre miss an open goal from close range. Frustratingly for Sebeta, second-choice keeper Messay Ayano had a fantastic game that could see him displace Soho Mensah from the first team. Ayano saved three shots to keep Hadiya in the game.\n\n![](/images/uploads/sebeta-v-hadiya.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nAll of this dominance did not affect the scoreline, however, and the key moment of the match came when a cross from the right was handled by Sebeta's Alemayehu Muleta in the fifty-third minute. The resulting penalty was cooly slotted by Samson Tilahun low and to the keeper's left. Hadiya made sure to shut the game down after their goal and Sebeta did not create any dangerous chances after the sixtieth minute.\n\n\n\nThis win momentarily lifts Hadiya a substantial five spots up to seventh place. Sebeta, on the other hand, risk going bottom if in-form Jimma collects points against Sidama Bunna.",
  "slug": "in-form-ayano-leads-hadiya-hossana-to-victory"
}