{
  "layout": "blog",
  "date": "2022-01-31T21:14:41.473Z",
  "body": "> *Jimma Aba Jifar players celebrate Dawit Estifanos' winner (Image: Ethiopian Premier League Share Company)*\n\nA Dawit Estifanos free kick saw last place Jimma Aba Jifar secure their first three points of the BetKing Ethiopian Premier League season against Addis Ababa Ketema on Sunday.\n\n\n\nJimma came into the game hopeful of putting an awful start to their season, losing eight out of their first nine games behind them. The team’s attacking output had been a major hindrance, with Jimma only scoring twice throughout those nine games.\n\n \n\nThis game was just as crucial to Addis Ababa Ketema, who are teetering dangerously close to the relegation zone. Inconsistency has riddled the capital city club’s campaign so far, with two losses in their first two games immediately followed by a run which saw them pick up an impressive ten out of twelve available points. This before being hit with a three game winless streak.\n\n \n\nBoth sides had a cagey start to the game, with Jimma seeing more of the ball in the first half but Addis creating slightly more chances. On the whole though chances came by very rarely in the half, with the best one coming in the 41st minute, which saw Jimma’s Dawit Fekadu blast one over the bar. Jimma were forced into an early substitution mid-way into the first half with Musa Kebele being forced off with injury for Dula Mulatu.\n\n \n\nJimma attempted to create chances from central areas whereas Addis Abeba deployed the ball across wide areas, where they’d cross into the Jimma box. Addis Abeba's topscorer Richard Adongo did not get many opportunities to score however, with crosses for him being dealt with well by the Jimma defence.\n\n \n\nFitsum Tilahun had more joy on the right-hand side, with him consistently getting into dangerous positions cutting in from the right, but he was not clinical enough on the day to register a goal. Jimma goalkeeper Zerihun Tadele was brave and put his body on the line on the few occasions that crosses managed to reach Tilahun and Adongo.\n\n \n\nThe difference for Jimma was Dawit Estifanos, who scored a wonderful freekick in the 78th minute. The only goal of the game arriving via a set play was fitting as both teams were having problems creating clear-cut chances from open play.\n\n \n\nJimma protested that they should have had a second as a strike by African Cup of Nations returnee Mesud Mohammed resulting from a corner routine rebounded off the crossbar, replays however showed that the ball did not cross the line.\n\n \n\nWhile the result will not have a major impact on the current standings (Jimma is still some seven points away from safety), it will be a huge psychological boost for Jimma to get their first three points of the season.\n\n \n\nConversely, Addis Ababa Ketema see themselves getting dragged down to the relegation scrap with this result, results go against them tomorrow they could drop down to 14th place. Next week will be big for both teams as they face teams in and around them, with Jimma playing Hadiya Hossana and Addis Ababa facing Wolaita Dicha.",
  "title": "Bottom dwellers Jimma Aba Jifar snatch three points from Addis Ababa Ketema",
  "slug": "jimma-aba-jifar-defeat-addis-ababa-ketema-betking-ethiopian-premier-league",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "thumbnail": "/images/uploads/jimma.jpg"
}