{
  "layout": "blog",
  "date": "2022-02-05T07:36:06.637Z",
  "body": "> *(Image: Ethiopian Premier League Share Company)*\n\nJimma Aba Jifar followed up their [first win of the season](https://www.bluenilesport.com/articles/jimma-aba-jifar-defeat-addis-ababa-ketema-betking-ethiopian-premier-league) with an impressive win over Hadiya Hossana which saw them score four goals, the first time they have scored more than once this season.\n\n \n\nJimma went into the match feeling buoyed by their win against Defence Forces FC. Hadiya also had reasons to be hopeful as their first half against Wolkite Ketema was impressive, although work was needed in order to iron out second half issues that saw them drop two points.\n\n \n\nThe game had an end to end and frenetic start with Jimma scoring in the fourth minute, Eyob Alemayehu’s left foot making a solid connection with the ball after its was headed clear from a corner also had a slight deflection from Tesfaye Melaku which helped it into the goal.\n\n \n\nHadiya Hossana scored an equalizer in the thirteenth minute after Jimma lost the ball in their own half, with Baye Gezahegn taking advantage of this with a far post shot which rebounded off both posts and ricocheted off of Jimma player Wondimagegn Markos for an own goal.\n\n \n\nThe stalemate did not last long however as Hadiya keeper Mensah Nsouhoho spilled a shot from outside the box, allowing Mohammed Nur to score an easy tap-in.\n\n \n\nIt was Mohammed Nur again who played a big part in Jimma’s third goal in the 64th minute, carrying the ball from his own half all the way to the final third before cutting it back to Dawit Estifanos who threaded a through ball which Eyob Alemayehu converted for his second goal.\n\n \n\nHadiya outnumbered Jimma in midfield three to two, this was reflected in the final possession stat as it showed Hadiya with the lion’s share of the ball. As Hadiya coach Mulugeta Mihretu said post-match, though, it's not how much possession you have but what you do with it. Hadiya’s highline could not deal with Jimma’s pace on the counter, indeed, Jimma’s third goal came in a similar fashion with the explosive Mohammed Nur beating the highline and chipping the goalkeeper.\n\n \n\nHadiya got their second goal from sub Fikreyesus Tekleberhan. It was an unforced error from Jimma who lost the ball in their own half, which Hadiya took advantage of.\n\n \n\nThe consolation goal could have been so much more if the 91st minute penalty (won after a bad tackle from Jimma’s goalkeeper) was converted. Hadiya captain Henok Arfichu was unable to keep the penalty on target, instead hitting the outer left post.\n\n \n\nBoth sides have had contrasting starts to this round of fixtures in Dire Dawa, with Jimma getting six points in two games in contrast to their awful one point from nine games.\n\n \n\nHadiya on the other hand are winless in two and will want to pick up three points soon to avoid being pulled into the relegation zone. They will have an opportunity to do so against struggling Sebeta next week. Jimma’s winning streak will come under threat as they face high-flying Sidama Coffee in round twelve.",
  "title": "Jimma Aba Jifar on the upsurge with second win of season",
  "slug": "jimma-aba-jifar-defeat-defence-fc-betking-second-win",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3 ",
  "thumbnail": "/images/uploads/jimmafc.jpg"
}