{
  "layout": "blog",
  "date": "2022-06-30T02:41:12.274Z",
  "body": "\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n## **Addis Ababa, Dire Dawa and Adama to battle it out for survival on the final day**\n\nAfter winning a crucial match against Dire Dawa City last week, Abraham Mebrahtu’s Bahir Dar side were looking to guarantee their safety heading into game week 29 as they faced a Sebeta City side that had already been relegated last week courtesy of a 4-3 defeat to Addis Ababa City. Bahir Dar took the initiative in the early stages of the game as they launched wave after wave of attack into the Sebeta box in the opening fifteen minutes. It was Sebeta that landed the first blow, however, as they took advantage of the offensive nature of Bahir Dar’s game to strike them on the counter. Durisa Shubisu caught Bahir Dar’s defense on the transition with a through ball in the 16th minute. Samuel Salisu was able to break the offside trap and get to the end of the ball, after which he employed a Cruyff turn before putting the ball past Abubekir Nuri. Shubisu nearly got a goal of his own in the 29th minute as his ambitious diving header met Getu Hailemariam’s early cross, only for his effort to hit the crossbar and go out of play. Of the Bahir Dar contingent, Mawuli was the biggest threat; he created problems for Sebeta drifting into the left channel. He was also dangerous whenever he was left alone with space outside of the box. Sebeta managed the first half well from the 30th minute onwards as Berhan Debele’s men limited the chances that Bahir Dar were able to create. \n\nBahir Dar’s attacks mostly came down the left side in the first half, Sebeta’s Bereket Samuel did well to stave off threats from this side of the pitch. Sebeta on the other hand looked to threaten Bahir Dar’s goal via through balls into central pockets of space on the counter. Bahir Dar had a quick response after the break. When Bahir Dar finally made the breakthrough, it was created on the left side as well. Fikremichael Alemu was able to launch an excellent diagonal pass into the left channel which Alem Abbas chipped first time into Sebeta’s box. Mawuli utilized great athleticism in order to Bicycle kick the ball into the back of the net against his former team. Things quickly got from bad to worse for Sebeta as Bereket Samuel got himself sent off in the 65th minute. It was one-way traffic from this point onwards. Sebeta were fortunate not to go down to 9 men as Aschalew Tadesse went committed to a rash challenge in the 85th minute into Girma Disasa. Bahir Dar did have more threat overall as they registered 9 shots on target compared to Sebeta’s 4 but Bahir Dar were never able to get the winning goal. Their inability to threaten from dead balls was pronounced on the day, with Bahir Dar not being able to threaten Sebeta from the more than 14 corners they earned. With Bahir Dar unable to collect maximum points in their game, they had to depend on Dire Dawa dropping points to guarantee their safety from relegation.\n\n![](/images/uploads/sebeta-vs-bahir-dat.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n\n\nDire Dawa played Adama in what was the crucial game of this week for the relegation battle. Neither team could deliver a knockout blow on the day as both settled for a 1-1 draw. Dire Dawa will be disappointed not to have capitalized on a great start to the as the three points would have allowed them to claw their way out of the bottom three. Mohammed Abdulletif scored for Dire Dawa early on as he curled in an excellent free-kick past Adama keeper Sakuba Kamara in the 10th minute. Dire Dawa thought they had doubled their lead five minutes later after Surafel Getachew put the ball into the back of the net after a good chipped pass inside the box, but it was correctly deemed offside by the linesman. Adama came into the game from the 20- minute mark onwards, but the team did not make any dangerous attempts outside of a few speculative shots from outside the box. Not for the first time this week, the rainy season made for difficult pitch conditions in the second half. Adama substitute Berhan Ayten shone in this second half, it was his chipped pass into the box that created Adama’s equalizer for Ame Mohammed to finesse the ball into the corner. Adama were close to grabbing the lead in the 74th minute as Ayten threatened again to make a connection to a long ball from deep into Adama’s half. Dereje Alemu was able to keep the scores even by keeping this effort out.\n\n\n\nBoth sides dropping points will come as a relief for Addis Ababa, who lost to third-place Sidama Coffee. Addis Ababa’s defensive frailties cost them, especially with the added absence of their topscorer Richmond Adongo. Elsewhere in the league, Wolkite thrashed already relegated Jimma for their first win in seven games. The injury-ridden Defense Force on the other hand extended their winless run to six games, with the side failing to score a single goal in five matches. Wolkite, Bahir Dar, and Defense Force all guaranteed their place in the league as a result of Dire Dawa’s failure to collect three points this week. \n\n![](/images/uploads/adama-vs-dire.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n\n\nThis leaves Adama, Addis Ababa, and Dire Dawa as teams that will head into the final matchday with the threat of relegation looming over them. Both Addis Ababa and Dire Dawa have the toughest opponents in the league to overcome: they face title challengers Saint George and Fasil Kenema respectively. While Addis Ababa have the security of knowing that 1 point will in all likelihood be enough for them(due to Dire Dawa’s vastly inferior goal difference), Dire Dawa will have to push for all three points. Adama do not have an easy matchday opponent either, they face fourth-placed Hawassa.\n\n\n\n## Tite Race Poised for a Final Day Showdown\n\n\n\nFasil Kenema became the first team outside of Saint George to top the league table since game week 9(albeit temporarily) after The Emperors came out on top against Ethiopia Coffee. Whereas their last match was a tight win against Hawassa, the Emperor's demolished Ethiopian Coffee, who had an abysmal showing on the day. Coffee will no doubt have been weakened by the departure of their starman Abubekir Nassir. What was more surprising was the collapse of their defense against Fasil. Fasil Kenema’s trio of Mujib Kassim, Surafel Dagnatchew, and Bereket Desta ran the show on the day and were involved in most of Fasil’s big chances. Kassim opened the scoring in the 11th minute as Surafel Dagnatchew provided yet another assist for the striker this week with an excellent long pass deep from Fasil’s own half. Kassim calmly side-footed the ball past Bereket Amare from the resulting one-on-one situation. \n\n\n\nEthiopia Coffee’s leaky highline continued facing issues, this time from the pacy Bereket Desta, who ran through Coffee’s defense in the 52nd minute. Bereket Amare did well to tighten the angle of Desta’s shot and prevent a goal. It was a similar situation ten minutes later as Dagnatchew chipped a lovely pass that put Desta through with acres of space to run into. Bereket Amare again saved the resulting Desta effort only to see the ball fall to Kassim who subsequently put the ball into the back of the net. Dagnatchew and Desta yet again linked up in the 85th minute as Dagnatchew threaded on outside of the boot through ball for Desta. Bereket Desta subsequently went down in the box after questionable contact. Defender Tewodros Bekele fairly protested his innocence, but this did not matter as Surafel converted the resulting penalty to make it three for Fasil. All three of Fasil’s goals were created as their players were allowed acres of space to run into. This has become a trend for Coffee, who afford opponents space when they employ their high-risk, high-reward highline. This is perhaps why Kassaye Arage’s side have the joint-third worst defensive record in the league with 36 goals conceded this season. Kassim is on red hot form at the moment, scoring five goals in his last three games. His uptick in form coincides with Surafel Dagnatchwe’s, who has masterminded nearly all of the goals that Fasil have scored in the past five games.\n\n![](/images/uploads/kassim-dagnatche.jpg)\n\n\n\n> *(Image: Ethiopian Premier League Share Company)*\n\n\n\nFasil did not top the table for long, as Saint George collected three points from their matches as well. Arba Minch City came into the game with better form than the league leaders, collecting 13 points from a possible fifteen compared to the Horsemen's 8 points in the same period. The last match between the two sides also suggested that this may be a tricky match for Saint George; both sides drew 1-1 in the first half. Saint George’s top scorer Ismael Ogoro came back into the starting eleven after a lengthy injury absence. The Togolese striker was instrumental in creating the first goal, as it was his control inside the box and his saved shot that fell to Markneh, who scored into the empty net. Markneh continued his recent uptick in goal-scoring form, as the forward registered his third goal in the past four games. \n\n\n\nPersistent rain meant that the condition of the pitch deteriorated throughout the match which forced both teams to utilize more long balls in the second half. Saint George had the better of the chances after the break and Cherinet Gugsa had two chances from the right in the 68 and 81 min that were saved by Arba Minch City keeper Yishak Tegegn. Arba Minch's best chance of the game came in the 83rd minute as Tsegaye Abera attempted a dangerous shot from outside the box that Charles Lukwago was equal to. Arba Minch were ultimately not able to create many chances in the game, with only two attempts on target. Saint George were effectively able to limit their opponent's chances, something they have been able to do for most of the season but have had difficulty with as of late with the Horsemen conceding four goals in their last five games. Saint George head into the last match week with the title in their hands, if they win their next match, the Horsemen will win their 15th Premier League title.  \n\n![](/images/uploads/ogoro.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*",
  "thumbnail": "/images/uploads/bahir-dar-fans-v3.jpg",
  "title": "Matchweek 29 in Review",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "slug": "matchweek-29-in-review"
}