{
  "layout": "blog",
  "date": "2022-02-21T03:14:01.422Z",
  "body": "Skokie Illinois, where Ethiopian American high school soccer phenom Mekeyes Gashaw currently resides, is a long way away from the bustling Ferensay Legasion neighbourhood of Addis Ababa Ethiopia where the nineteen year old was born and where he first learned to juggle the ball. And now, Mekeyes is set to make another trip halfway around the globe, this time to Germany, where his exploits in America have earned him a trial with a Bundesliga side.\n\n“This will be a whole new experience for me,” Mekeyes told Blue Nile Sport. “I’ve worked hard my whole life for this moment and now I’m ready to chase my dreams.”\n\nCompiled [footage](https://www.youtube.com/watch?v=UMzXRpjfbNY&feature=emb_title) depicts the skillful winger with silky dribbling abilities and a depth first touch.\n\nAfter three action packed years in which the youngster estimates having taken part in as many as seventy games across multiple competitive leagues at school, municipal and state level, Mekeyes says he passed on college scholarships from teams around the country to take up the opportunity to train with Hertha Berlin’s U23 side in the German capital.\n\n“I had offers from college teams, but I had my heart set on Europe,” he explained.\n\nMekeyes’ trial is scheduled for mid March, a month where Hertha Berlin’s U23 side have three scheduled fixtures in the north east division of the *Regionalliga,* Germany football’s fourth tier league.\n\n![](/images/uploads/wz1k5kdg.jpg-medium.jpg)\n\n> *Mekeyes Gashaw as a 15 year old after winning a city wide competition*\n\nAddis Ababa born Mekeyes would be following in the footsteps of just a handful of footballers of Ethiopian descent who in the past decade looked to the German program to further their development. Among them, fellow Ethiopian American and former Arsenal midfielder Gedion Zelalem, brothers Melkamu and Melesse who rose through the ranks at TSG 1899 Hoffenheim before Melkamu’s 2020 move to Liverpool, and Ethiopian national team midfielder Binyam Belay who in 2017, [went on trial](https://www.dynamo-dresden.de/saison/news/newsdetails/dynamo-testet-binyam-belay.html) at 2. Bundesliga side Dynamo Dresden.\n\nIt would be a major step up for Mekeyes, who notched two goals and three assists for his Niles West Highschool last year, during a stop start season that was interrupted by the pandemic.\n\nMekeyes left his native Ethiopia with his parents and two younger brothers as an eight-year-old, settling in Skokie Illinois, just 25 km north of Chicago. His love for the beautiful game followed him to United States, where he excelled representing both city and school teams, and developed into a winger capable of being deployed on either flank.\n\n“My favourite player is Cristiano Ronaldo, but I model my game around a player like (Liverpool’s) Mohammed Salah,” Mekeyes explained.\n\nAs is typical among Ethiopian families, Mekeyes’ desire to hone his skills in the game clashed regularly with his father’s wish to see him excel in school. But Mekeyes’ kept up his sporting development thanks to among other things, a personal trainer.\n\nAged 15, he caught the eye of an MLS scout and was brought in on trial at Houston Dynamo, where he displayed enough skill to be invited to move into the club’s youth academy.\n\n“I turned down the offer. It would have required me moving away from my family. We weren’t ready for what comes with that,” he recalled.\n\nMekeyes explained that when he was younger, other opportunities to play required long drives from home or costly registration fees, both of which were unattainable. But given a shot last year during the winter season with Chicago City, he impressed a visiting scout during a six or seven game stint. Those six or seven games, he says, are what will have him board a flight to Berlin next month.\n\n“This time I’m more than ready to go,” Mekeyes says, saying he has maintained match fitness levels despite the pandemic halting his senior high school season midway. His interview with Blue Nile Sport had to be postponed by several hours to accommodate his training sessions.\n\nDespite his youth, he did have words of wisdom for up-and-coming athletes who may encounter difficulties along the way.\n\n“Just chase your dreams. I’ve had people tell me that my dreams aren’t realistic and that I should stop playing. But a lot of hard work and sacrifice can make those dreams come true.”\n\nInterestingly enough, Mekeyes also said that he’s a fan of the Ethiopian national team and has communicated with the likes of national team stalwart Shemeles Bekele. “He answered me when I reached out on Instagram, we talked about the team.”\n\nMekeyes’ drive to establishing himself in the professional game will see him spend a week in Germany.",
  "title": "Mekeyes Gashaw en route to Germany to chase footballing dreams",
  "author": "Blue Nile Sport staff",
  "slug": "mekeyes-gashaw-germany-trial-ethiopian-american-football",
  "thumbnail": "/images/uploads/mekeyes.jpg"
}