{
  "layout": "blog",
  "date": "2022-01-11T02:09:16.405Z",
  "title": "Ethiopian born Melkamu Frauendorf makes history with Liverpool",
  "slug": "melkamu-frauendorf-ethiopian-liverpool",
  "author": "Staff",
  "thumbnail": "/images/uploads/2021-11-03-117-liverpool_u19_atletico_u19.jpg",
  "body": "*(Image: This Is Anfield)*\n\nLiverpool manager Jürgen Klopp gave a number of youth players a run out during the team's 4-1 victory over third tier side Shrewsbury Town in the FA Cup yesterday. Among them, 17 year old Ethiopian German youth international Melkamu Frauendorf. \n\nThe midfielder has been stellar for Liverpool's youth sides since signing with the club in 2020. While the headlines were stolen by another teenage sensation in Kaide Gordon who scored Liverpool's equalizer on his debut, Melkamu managed to write a new chapter in Ethiopian football with his cameo.\n\nBrought on with less than ten minutes on the clock with the result all but sealed, Melkamu Frauendorf made history and became the first Ethiopian born footballer to take to the pitch for an English Premiership side. \n\n![](/images/uploads/melk-ig.jpg)\n\n> Melkamu in kit #94, celebrating teammate Fabinho's injury time strike against Shrewsbury Town (Image: Melkamu's official Instagram page)\n\nBorn in the luscious greenery of the Kembata region in southern Ethiopia, Melkamu was a four year old child when he and older brother Melesse, relocated to Germany to live with their adoptive parents. \n\nThe Frauendorf brothers are products of the TSG 1899 Hoffenheim academy in Germany. Both have been capped at German youth level, with Melkamu currently a fixture with the German U-18 national team. Melesse is still at Hoffenheim with the reserve team, and recently declared a willingness to [play for his country of birth.](https://www.ethiosports.com/2021/12/15/9-foreign-based-players-declare-willingness-to-represent-ethiopia/?fbclid=IwAR1eYA4oiqCkeb3uGXpiJxJ9tfZCUHXx3D-qSTUyTGu2ZIdvMC0ZEK8_4vc)\n\n![](/images/uploads/1_gettyimages-1182625994.jpg)\n\n> Melkamu in action with the German U16s back in 2019 (Image: Karina Hessland-Wissel/Getty Images for DFB) \n\nNo footballer of Ethiopian descent has ever played in the Premier League, with former Arsenal midfielder Gedion Zelalem coming the closest, making Arsenal's matchday squad against Fulham in August 2013.\n\nMelkamu has won plaudits from pundits and fans alike for his performances with Liverpool's U-18 setup, with some labelling the talented teenager as key to the club's future. The maiden premier league appearance may not be too far off."
}