{
  "layout": "blog",
  "date": "2022-06-07T01:16:36.909Z",
  "body": "\n\n> *(Image Source: EFF)*\n\nWubetu Abate saw his side lose their 12th consecutive away game in all competitions against Malawi on Sunday. The Walias dominance on the ball did not translate to three points as two first-half penalties condemned Ethiopia to succumb to the Flames of Malawi.  Ethiopia's sole goal came from Abubeker Nassir as the Walias slipped to third in group rankings while Malawi now tops the Group D qualification group. \n\n![](/images/uploads/gebremichael.jpg)\n\n> *(Image Source: EFF)*\n\nMalawi started the game with more threat, with forward Khudu Muyaba nearly opening the score in the opening three minutes. Ethiopia’s defensive line left too much open space between the lines throughout the game. This afforded Chimwemwe Idana the space to run into the box with the ball. Instead of attempting to force the player wide, Yared Baye overcommitted and went flying in on the midfielder. The spot-kick was converted by Gabadinho Mhango.\n\n\n\nThe second goal was a result of Ethiopia’s incapability of dealing with the transition. Asrat Tunjo was dispossessed at the halfway line and a simple ball over the top away. He passed to Mhango, who was cut down inside the box by another rash challenge, this time from Mignot Debebe. Mhango scored yet again to make it five goals in his last four games. \n\n\n\n![](/images/uploads/gaba.jpg)\n\n> *(Image Source: EFF)*\n\nEthiopia did not threaten Malawi’s defense much until the 42nd minute when a good Asrat Tunjo cross was connected well with Nassir for a looping-headed attempt that forced Malawi keeper Thumo to palm the effort away. When Ethiopia earned a penalty in the 66th minute, it was the result of a good through ball by Bekele and good dribbling by Nassir. Ultimately, it was Cherinet Gugsa who was brought down by Peter Banda. Nassir converted coolly from the spot by sending the keeper the other way.\n\n\n\nThe Walias attempted to mount a comeback after this goal, particularly applying pressure from the 80th minute onwards. The team failed to make the decisive pass in the final third as most of this pressure only led to half chances. It is telling that all of the game’s goals came from penalties as much was not created via open play. The closest that the Walias came to scoring was a tricky Ramadan Yusuf low cross which looked like it was destined to be put in the back of the net by two waiting Ethiopian players, but it was cleared well by Denis Chembezi before the ball could reach them.\n\n\n\n![](/images/uploads/abukieth.jpg)\n\n> *(Image Source: EFF)*\n\nOverall, Ethiopia only registered two shots on target and Malawi had 5. In the last three matches Ethiopia has played, all four goals that they have conceded have been via set-pieces. With this loss, Ethiopia continued their 12-game winless streak. The last game that the Walias won was on September 7 2021 against Zimbabwe. This result is also a far cry from the thumping that Malawi received from the Walias in March 2021.\n\n\n\nThings only get harder from here on out for Walias, as their next opponents are seven-time AFCON champions Egypt. The Pharaos left it late on Sunday as they came out on top over a resilient Guinea side via a goal from Mostafa Mohamed. Ethiopia will have the odds stacked against them even further against Egypt on Thursday as they will be forced to play in a neutral venue due to all Ethiopian Stadiums lacking CAF accreditation.",
  "thumbnail": "/images/uploads/ethiovs-malawi-lineup.jpg",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "title": "Mhango Double Sinks Woeful Walias",
  "slug": "mhango-double-sinks-woeful-walias"
}