{
  "layout": "blog",
  "date": "2022-02-21T01:10:24.950Z",
  "title": "Fasil Kenema’s Mujib Kassim in awe over “invaluable experiences” in Algeria despite fallout over pay  ",
  "body": "> *Mujib Kassim and Fasil Kenema Coach Seyoum Kebede cut a cake surrounded by the club's players in warm welcome for returnee Mujib, fresh from a stint in Algerian football (Image: Fasil Kenema)*\n\nMujib Kassim, the newest acquisition of Ethiopian club side Fasil Kenema, says he’s back in Ethiopia and raring to go after a brief stint on the books of Algerian side JS Kabylie, which saw him go three months without being paid. Despite his premature return to Ethiopian league football, Mujib says his time in Algeria taught him a lot as a footballer.\n\n“The attention given to a player’s diet, training and even medical treatment is much more advanced than it is here in Ethiopia,” Mujib said. “It was an eyeopener. We have a lot to learn.”\n\nThe club’s refusal to pay him, he says, is why he is back in the BetKing Ethiopian Premier League.\n\n“I left Algeria because the club wouldn’t honor the contract I signed,” Mujib said. “It was me who departed and not the club that let go of me.”\n\nMujib joined the reigning Algerian League Cup champions in August, during a financial meltdown which led to players going months even up to a year without pay. Mujib showed promise during preseason friendlies with the club and eventually made three appearances in the league.\n\nMujib last game for the club was a 1-0 defeat way to JS Saoura, in which he came on as a substitute in the 63rd minute and was taken off thirteen minutes later. He was also excluded from JS Kabylie’s official CAF Confederations Cup squad. It led to rumours and reports in Ethiopia that he had been let go by the Algerian club for his failure to meet the standard.\n\n“I was disappointed by what was said in some reports,” the 26 year old striker told Blue Nile Sport. “Stories saying that I was forced out because of poor play are completely false. I had a contract, I could have just stayed there if I wanted to.”\n\nMujib Kassim had made his last appearance for JS Kabylie by the time he left them to join up with the Ethiopian national team at the African Cup of Nations in January. His deal was officially terminated by January 28th.\n\n“I know my rights as a player, and I followed the rules,” he explained. “I gave the club two weeks notice, notifying them that I would be leaving if they didn’t pay me what I was owed.”\n\n![](/images/uploads/274267239_5230391713646018_4997052349750910521_n.jpg)\n\n> *On Friday, Mujib Kassim put pen to paper on a six month loan deal which reunited him with with his teammates in Gonder (Image: Fasil Kenema)*\n\nIn an exclusive interview, Mujib told Blue Nile Sport that he has since [escalated the matter](https://www.bluenilesport.com/articles/mujib-kassim-fifa-mediation-js-kabylie-unpaid-wages) to football governing body FIFA.\n\nDescribing his pride at realizing a childhood dream and taking to the pitch for Ethiopia at a major international tournament, Mujib added that he hopes to see more Ethiopian footballers try their luck abroad.\n\n“I was very happy to hear of Abubeker Nasir’s [signing](https://www.bluenilesport.com/articles/abubeker-nassir-south-africa-trials) for Mamelodi Sundowns,” Mujib said. “The broadcasting of our domestic games on DSTV has gained valuable exposure for our local game and our players. It is what got me noticed as well and I’m certain it will lead to greater opportunities for young talents.”\n\nFIFA recognized the termination of his contract with JS Kabylie and his status as a free agent, paving the way for his resigning with Fasil Kenema, for whom he scored 20 goals in 23 matches en route to winning the Premier League last season. The Ethiopian Football Federation is set to finalize formalities that would permit him to take part in the current campaign.",
  "thumbnail": "/images/uploads/274303757_5232951060056750_3756281328683383205_n.jpg",
  "author": "Brook Tefera @Bk_Tefera , Ebawak Tesfaye @negussu_",
  "slug": "mujib-kassim-player-experience-ethiopia-algeria-fasil-kenema"
}