{
  "layout": "blog",
  "date": "2022-02-20T21:36:57.536Z",
  "body": "> *(Image: JS Kabylie)*\n\nEthiopian international striker Mujib Kassim has confirmed to Blue Nile Sport that he has lodged a complaint with the global football governing body FIFA over the failure of Algerian top flight club JS Kabylie to pay him wages owed since joining the club in October.\n\nBarely three months after his move to Algeria, Mujib, 26, tore up his contract and boarded a plane back to Addis Ababa where he began listening to offers from Ethiopian Premier League clubs, before accepting to join his former club Fasil Kenema on a six-month loan.\n\n“My agent and I have submitted all relevant files including the contract I signed to FIFA,” Mujib told Blue Nile Sport. “We followed legal regulations to terminate the deal. FIFA recognized this which permitted me to become a free agent and join any team I like.”\n\n“I resorted to the legal path because the club refused to pay me. FIFA are now handling the matter.”\n\nJS Kabylie didn’t answer emails sent to them by Blue Nile Sport, nor has the team made any official statements acknowledging Mujib’s claims. But the financial turmoil the club finds itself in over the past year has been well documented.\n\nFinancial mismanagement by the previous President Chérif Mellal led to players going without pay for months, including the club’s top scorer last season, Rédha Bensayah, who spent [over a year](https://www.competition.dz/actualites/89-ligue-1/79439-jsk-iarichen-veut-blinder-les-contrats-de-bensayah-et-benabdi.html) at the club without a salary.\n\nAfter growing discontent, threats of players going on strike, a mass exodus saw the manager and five key members of the squad depart in August. An ugly legal battle saw the ousting of Mellal who was replaced by Yazid Yarichène. Yarichène himself [submitted his resignation](https://www.facebook.com/jskabylie.club/photos/pcb.371786811353560/371786721353569/) last week, citing his inability to deal with the club’s “astronomical debts” and the refusal of sponsors to help out the team, although it is understood that Yarichène will stay on as President in the short term.\n\nWith the calamitous state the club finds itself in, Mujib now says more could have been done to avoid [the whole episode](https://www.bluenilesport.com/articles/mujib-kassim-nightmare-js-kabylie-algeria).\n\n“I hope other players learn from me. It’s important to do research on the club you are about to sign for.\n\nIt isn’t the first time an Ethiopian footballer plying his trade in north Africa turned to FIFA to solve a payment dispute. Former Ethiopian international Omod Okori took the same path in 2015, alleging that Egyptian side Al Ittihad Alexandria had owed him money.\n\nMujib made three appearances without scoring in the Algerian Ligue 1.",
  "title": "EXCLUSIVE: Mujib Kassim files complaint with FIFA over unpaid wages in Algeria",
  "author": "Brook Tefera @Bk_Tefera Ebawak Tesfaye @negussu_",
  "slug": "mujib-kassim-fifa-mediation-js-kabylie-unpaid-wages",
  "thumbnail": "/images/uploads/259560808_316906833508225_2150828785899668002_n.jpg"
}