{
  "layout": "blog",
  "date": "2022-02-09T00:46:21.414Z",
  "title": "Inside Mujib Kassim’s Algerian nightmare",
  "body": "Ethiopian international striker Mujib Kassim headlined the Walias’ twenty eight man squad that played at the recently concluded African Cup of Nations primarily because he was one of just two squad members who weren’t under contract at Ethiopian Premier League sides.\n\nBut Mujib Kassim’s time abroad is over, according to a report by Soccer Ethiopia. Mujib told the news outlet that barely four months after signing for Algerian giants Jeunesse Sportive Kabylie, he had severed ties with the club due to their unwillingness or inability to pay him three months worth of salary. Mujib made three appearances for the Canaries in the Algerian Ligue Professionnelle 1 without scoring, with his last appearance coming in mid December, prior to his departure to Cameroon to join up with Ethiopia’s AFCON squad.  \n\nThe twenty six year old wouldn’t be short of suitors in Ethiopia, where in his last season he fired Fasil Kenema to league title glory, finishing as the league’s second highest scorer with twenty goals in twenty three games. After his stellar performances, Mujib was tipped to become a success abroad and play at a level higher than what Ethiopia’s domestic league offers.\n\nUnfortunately, it didn’t pan out in Algeria.\n\n![](/images/uploads/244676860_281751847023724_6666265623951660960_n.jpg)\n\n*Mujib Kassim transiting through the Tunisian capital Tunis en route to his final destination, Tizi Ouzou Algeria*\n\n< On paper, the club based in the northern Algerian city of Tizi Ouzou would be a dream move for any up and coming footballer. The club have a fiercely engaged fan base and are the most successful club side in Algerian football with fourteen league titles. JS Kabylie also made a splash on the continent last season, losing 2-1 in the final of the CAF Confederations Cup to Moroccan side Raja Casablanca. The club’s Champions League aspirations and their desire to end a league title drought that extends back to 2008, are all draws for aspiring footballers.\n\nIn the end though, the timing appeared to be wrong. Mujib put pen to paper for the Algerian side after several months of pursuit and after Fasil Kenema willingly tore up his contract which still had a year on it. He left the Gonder based club which was at the pinnacle of its success and moved to Tizi Ouzou, home to a club that unbeknownst to him, was wracked by internal turmoil, legal troubles, financial mismanagement, and a battle for ownership of the club.  \n\n![](/images/uploads/cherif-mellal-président-jsk.gif)\n\n> *JS Kabylie's ousted former President Chérif Mellal (Image: DZ Foot)*\n\nAs Mujib was finalizing details ahead of his transfer, the club itself was embroiled in an ugly battle to dismiss its President. That President, 46 year old businessman Chérif Mellal, was blamed for mismanagement of club finances and assets which had left the club in the red and unable to cover costs, including salaries of first team players. According to Algerian football magazine DZ Foot, JS Kabylie owed nearly $900,000 US in salaries to its players. For instance, the club’s top scorer Rédha Bensayah, went up to [fourteen months without being paid](https://www.competition.dz/actualites/89-ligue-1/79439-jsk-iarichen-veut-blinder-les-contrats-de-bensayah-et-benabdi.html) during a season when the club reached the final of the CAF Confederations Cup.\n\nTragedy struck the country in August when wildfires ravaged Algeria’s Kabylie region, where the club is based, [killing dozens](https://www.bbc.com/news/world-africa-58165169). The club put on a heroic display on August 10th, wearing black badges in honour of the victims and taking to the field in the inaugural Algerian League Cup final, defeating NC Magra 4-1 on penalties after finishing the game 2-2. It was their first trophy in a decade and the team dedicated the victory to survivors and the fallen.\n\n![](/images/uploads/jsk_coupe_de_la_ligue_-2020-2021-.jpg)\n\n>  *Amid internal turmoil, natural disasters and unpaid salaries, JS Kabylie overcame multiple challenges to lift the Algerian League Cup last year (Image: Akli11)*\n\n\n\nDays after that triumph, the club’s coach Frenchman Denis Lavagne announced his resignation, stating that he was unable to convince unpaid players to keep coming to practice. Four players who were in the starting eleven for the club’s league cup victory [departed the club](https://observalgerie.com/2021/08/14/sports/denis-lavagne-cinq-joueurs-quittent-jsk/) within the same week. The players had had enough. Club President Chérif Mellal had promised to pay players their salaries with the award money CAF would deliver to them for finishing as Confederations Cup finalists. But a month later, no money had been disbursed to the players.  \n\nBetween August and November 2021, JS Kabylie underwent a face lift. Chérif Mellal was forced out of the club by the board after taking the matter to court. Numerous players departed, and the club began recruiting replacements, which hastened the arrival of Mujib Kassim among others. And after Lavagne’s departure, Henri Stambouli was drafted in as manager by the outgoing Mellal. But Mellal’s replacement, Yazid Yarichène, didn’t take a liking to him and sacked him after just two games in charge.\n\nThe current coach, Tunisian national Ammar Souayah, is the club’s third coach in three months. He joined JS Kabylie days after Mujib Kassim’s arrival in Tizi Ouzou.\n\nFormer President Mellal meanwhile, has since been sentenced to [six months in prison](https://observalgerie.com/2021/12/09/sports/cherif-mellal-prison-ferme/) on a defamation charge and has reportedly left the country for Germany. He also lost a [legal battle](https://www.dzairdaily.com/algerie-cherif-mellal-perd-face-yazid-yarichene-presidence-jsk-definitivement/) to regain control of the club from Yarichene, also in December.\n\nBy the time Mujib Kassim began training with his new teammates, the club President and coach which had sought him out, were gone. The new regime inherited an extremely poorly managed club with a fan base left increasingly frustrated by the departing of fan favourites. Above all, the entire community was still reeling from the devastation caused by the deadly forest fires.\n\nHaving arrived very late into preseason preparations, Mujib got almost no time to gel with his teammates, being thrown on as a substitute in JS Kabylie’s league clash away to Olympique de Medea on November 2nd. He came on after the hour mark and became the first Ethiopian footballer to grace Algeria’s top flight since Salahdin Said did for MC Alger back in 2015.\n\nBut Mujib looked every bit a player who hadn’t played in a competitive fixture since the end of the Ethiopian league season, over five months ago. He drifted out of position and appeared to lack rhythm on the ball. The game ended in a goalless draw. With insufficient preparation, it was clearly too soon for Mujib's league debut, but the management's desperation for a new goal scoring hero was such that his integration was rushed.\n\nNearly two weeks later, on November 13th, Mujib scored for JS Kabylie in a friendly against fellow top flight side Union Sportive de Biskra, where the Canaries ran out 5-0 winners. In a game where a number of debutants were brought on, Mujib impressed enough to be inserted straight into the starting lineup for the team’s next league match.\n\n![](/images/uploads/256855512_315521416980100_1567269408318894020_n.jpg)\n\n> *Third from left standing, Mujib Kassim poses for a team photo ahead of his first and only official league start on November 19th (Image: JS Kabylie)* \n\nMujib Kassim got around seventy minutes of playing time during his side’s 1-1 draw home to RC Arbaa on November 19th. It was the team’s forth game of the season, all of which ended in draws much to the chagrin of many of the team’s fans who took to [social media](https://www.facebook.com/jskabylie.club/posts/315466336985608) to express their frustration with a perceived lack of creativity in the attacking third. JS Kabylie’s goal was scored by Malian defender Yacouba Doumbia, whose arrival at the club preceded Mujib’s by a few weeks, following the mass exodus of JS Kabylie players and management in August.\n\nThe Ethiopian Premier League’s level of play isn’t on par with that of the Algerian Ligue 1 and perhaps allowing Mujib more time to adapt could have seen him develop into a fan favourite. At the same time, Ethiopia’s top flight has seen a number of its leading scorers over the years head off to north Africa and settle well, with the likes of Salahdin Said and Omod Okori establishing themselves in Egypt over the past decade.\n\nPerhaps the expectations were set relatively high. Whatever the case, it couldn’t help that Mujib was given the JS Kabylie jersey number 9, which was worn by former Atletico Madrid youth player Zakaria Boulahia. Boulahia starred at the club, and was crucial in the club’s Confederations Cup run, scoring twice in the semi final second leg and once in the final. He too left the club after the league cup success and signed for Emirates Club in the UAE.\n\nAfter finishing as finalists last season, JS Kabylie were eager to go one better in the Confederations Cup this season. A playoff to reach the group stages against Eswatini Premier League champions Royal Leopards, was deemed little more than a formality.\n\n![](/images/uploads/mujib.jpg)\n\n*Mujib Kassim during a JS Kabylie training session*\n\n\n\nThe writing may have been on the wall for Mujib when Coach Ammar Souayah excluded Mujib's name from JS Kabylie's Confederations Cup squad. It was a telling sign that the gaffer lacked confidence in the Ethiopian international's abilities. Being excluded from the most lucrative competition of the season spelled the beginning of the end of Mujib's time in green and yellow.\n\nAs such, Mujib didn’t make the trip to Eswatini for the CAF Confederations Cup playoff first leg. Without Mujib, JS Kabylie suffered a shock 1-0 defeat in the first leg.\n\nIt was quite apparent that Mujib Kassim was deemed surplus to requirements at the club. Nevertheless, expecting a player to thrive in such a toxic atmosphere, where player salaries aren’t guaranteed and where a revolving door saw coaches and players leave with alarming frequency, is foolhardy.\n\nIn September, JS Kabylie had hired Algerian footballing legend Karim Ziani as a sporting director. The former Marseille player was part of Algeria’s team at the 2010 FIFA World Cup and his arrival was expected to serve as a moral booster for a team on the decline in every department. But by Christmas, Ziani too had quit JS Kabylie.\n\nMujib Kassim’s final game in the green and yellow kit of the canaries came on December 14th and it might have been his worst. It was JS Kabylie’s fifth game of the season, and having drawn the four previous encounters and lost the first leg of their Confederations Cup tie, they fell flat against JS Saoura, conceding a goal in the first minute and losing 1-0.\n\nChasing the match and reduced to ten men, Mujib Kassim was brought on just past the hour mark with the hope of providing some spark up front. He was taken off the pitch in the 77th minute after twelve minutes in which he largely maintained a pedestrian pace and barely got two touches of the ball. The team were woeful on the day and etching out a draw was beyond the Canaries after they were reduced to ten men. But Mujib had another poor game and Souayah had seen enough.\n\n\n\n![](/images/uploads/265189575_4434957406631340_6841730248266004091_n.jpg)\n\n> *Mujib Kassim ended up being pushed out of the first team picture two months after arriving in Algeria*\n\n\n\nBetween December 14th and the new year, JS Kabylie had three Ligue 1 fixtures in which Mujib Kassim didn’t even make the bench. In his place, 23 year old club product Massinissa Nezla was promoted to the starting lineup. The Canaries would go on an eight game undefeated streak, with Nezla scoring five times during that run, entrenching his place in the lineup and further isolating the Ethiopian.\n\nMujib had been out of the first team picture for a while by the time he linked up with the Walias in Cameroon. By that time, his teammate Malian international Yacouba Doumbia who had signed for the Canaries at almost the same time, had settled in the starting lineup, logged in six league appearances and scored a goal from his center back position.\n\nNearly a month after he last saw the pitch, Mujib was brought on by Wubetu Abate in the 82nd minute as ten man Ethiopia chased an equalizer that would never come in their AFCON opener against Cape Verde. Mujib did little during his brief cameo to convince Ammar Souayah that he was worth gambling on again at JS Kabylie. He would see no further action at the AFCON either.\n\nAfter Ethiopia’s first round elimination, Mujib Kassim’s next priority would be sealing his exit and putting an end to his nightmarish stint in Algeria. Reports from Algeria state that he and JS Kabylie had officially parted ways by January 28th. With the extremely messy situation JS Kabylie had found itself in, signing for the club during the off season was in hindsight, a terrible idea albeit, shrouded by the fact that the team had just won a domestic cup and were finalists of a continental competition. The shambolic way the club is run and the manner with which it abuses its players isn’t fitting of the team’s storied history.\n\nMujib Kassim may not have made the grade in such circumstances. At twenty six, time isn't exactly on his side, but another decent season in the BetKing Ethiopian Premier League could put him back in the crosshairs of African football scouts.\n\nAs it stands, few foreign clubs are likely to take their chances on him after his spell in Algeria.\n\n![](/images/uploads/166819164_3679426275517794_6036272366594493877_n.jpg)\n\n> *Mujib Kassim (left) celebrating with international teammate Getaneh Kebede after the Walias sealed their berth at the 2021 AFCON*\n\nFor now, the Ethiopian national team has one less player plying his trade abroad. There's no word on whether Mujib tends to pursue legal means of obtaining compensation as well as the wages he is due.\n\nJS Kabylie wouldn't respond to requests for comment.",
  "author": "Blue Nile Sport staff",
  "slug": "mujib-kassim-nightmare-js-kabylie-algeria",
  "thumbnail": "/images/uploads/251336936_303201211545454_3862044405767701659_n.jpg"
}