{
  "layout": "blog",
  "date": "2022-02-11T02:27:57.826Z",
  "body": "\n\n> *William Solomon (Image: Ethiopian Premier League Share Company)*\n\n<!--StartFragment-->\n\nEthiopia Bunna got their first win in three after a narrow one-nil win against embattled Addis Ababa Ketema. \n\n\n\nThe early exchanges of the game were energetic as Bunna played their usual possession-based 4-3-3 while Addis Ababa attempted to pin Bunna back and counter-press to dispossess Bunna in their own defensive third. \n\n\n\nAs the half progressed, Addis started to retreat to a lower block and Bunna began creating chances. In the twentieth minute, Tafesse Solomon blasted a shot from a cutback inside the box after Addis Ababa lost possession in their defensive third.\n\n\n\nIt was a cross from the left that resulted in Ethiopia Bunna going ahead, with Robel Teklemichael flicking the early cross from Asrat Tonjo towards William Solomon who volleyed the ball into the goal.\n\n\n\nThe same sequence was nearly replicated in the thirty-sixth minute when a cross from the left resulted in another  William Solomon chance, Solomon couldn't score this time as his header was poor.\n\n\n\nAbubekir Nassir’s return from South Africa was a big boost for Ethiopia Bunna, he had an immediate impact as a facilitator in Bunna’s attacks with clever flicks and dribbles keeping Bunna’s offensive play ticking. Bunna's left-hand side continued causing Addis problems as the interplay between Tonjo and Nassir on the left side of the box opened up a one-on-one chance which Tonjo blasted over the bar.\n\n\n\nThe second half saw a much-improved performance from Addis Ababa, with them registering six shots and four on target in contrast to the first half where they only had two shots and one on target. Keyman Fitsum Tilahun continued to impress as the left-winger with his dribbling ability and shots from range.\n\n![](/images/uploads/fitsum.jpg)\n\n> Fitsum Tilahun and William Solomon *(Image: Ethiopian Premier League Share Company)*\n\nThe best Addis Ababa chance, however,  came near the end of the game from Endale Kebede, who used his first touch flick to split open the Ethiopia Bunna defense, unfortunately for him, his shot was too close to keeper Abel Mamo. The save was only as far as Adiss' Elias Ahmed, who scuffed his header. \n\n\n\nThe win sees Ethiopia Bunna temporarily up to fifth spot and leaves Addis Abeba Ketema rooted to the bottom three.\n\n\n\n<!--EndFragment-->",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3 ·",
  "thumbnail": "/images/uploads/raya.jpg",
  "title": "Nassir's homecoming sees Ethiopia Bunna returning to winning ways",
  "slug": "nassirs-homecoming-sees-ethiopia-bunna-returning-to-winning-ways"
}