{
  "layout": "blog",
  "date": "2022-01-16T15:22:29.677Z",
  "body": "\n\nEthiopia lost yet another one of its African Cup of Nations heroes earlier this month Blue Nile Sport has learned. Eritrean born former Ethiopian international Negassie Gebreselassie passed away at 81 of natural causes at his residence in the Eritrean capital Asmara earlier this month.\n\nNegassie, enjoyed a storied playing career as a defender in Ethiopian football playing for Dire Dawa based football clubs in the sixties. At the international level, he won twenty one caps and was part of the Ethiopian national team at three African Cup of Nations tournaments, including in 1962 when Ethiopia won its only major international tournament on home soil.\n\n![](/images/uploads/271871164_4878474635508330_6055356606650505109_n.jpg)\n\n> *Negassie Gebreselassie waves to fans after winning the 1964 Ethiopian league title (Image Kassu Kidane/EthioSports)*\n\nNegassie was on the bench during the AFCON triumph but would later establish himself among the country’s best defenders, starting both of Ethiopia’s games at the 1965 AFCON in Tunisia.\n\nTekeste Asmelash, a son of the late Asmelash Berhe, who was one of Negassie’s AFCON winning teammates and started in the final, confirmed the news of Negassie’s passing to Blue Nile Sport.\n\n“We lost Italo last year and now in Negassie, another from that generation,” he said.\n\nItalo Vassalo, a striker of Eritrean and Italian descent scored Ethiopia’s winning goal in the 1962 AFCON final against Egypt and like Negassie, made a name for himself during the heyday of Dire Dawa’s footballing glory, in the sixties and seventies.\n\nLast July, he too passed away aged 80 in Rome, leaving behind his wife, four children and his brother, older brother Luciano Vassalo who was captain of that legendary 1962 squad.  \n\n![](/images/uploads/5gr9di2l.jpg-medium.jpg)\n\n> *Members of the legendary 1962 squad get together for a photoshoot in Asmara. Standing from left to right, Haile Tesfagaber, Italo Vassalo, Berhe Goitom and Tekle Kidane. Sitting on the left, Kiflom Araya and on the right, Negassie Gebreselassie.*\n\nNegassie was a part of two Ethiopian league title winning teams with the Dire Dawa based  Ethio Cement in 1961 and 1964. According to [Ethio Sports](https://www.facebook.com/groups/EthiopianFootballers/posts/1539548689760860/), he also won at last three Hararghe regional titles, before retiring and heading into management.\n\nSixty years after that AFCON title and for the first time in Ethiopian footballing history, the Ethiopian national team took to the pitch with a [tiny star sewn atop the crest](https://www.bluenilesport.com/articles/ethiopia-honor-afcon-legends) on their national team kit to honour Italo, Negassie and the greats of 1962.",
  "title": "AFCON Champion Negassie Gebreselassie passes away",
  "author": "Blue Nile Sport staff",
  "slug": "negassie-gebreselassie-afcon-hero-passes-away",
  "thumbnail": "/images/uploads/edited-correctly.jpg"
}