{
  "layout": "blog",
  "date": "2022-06-11T04:10:21.908Z",
  "body": "> (Image Source: EFF)\n\nFirst-half goals from Dawa Hotessa and Shimelis Bekele were enough for the Walias to stun the Egyptian National team with a 2-0 win on Thursday. It was a historic night, with this being the first triumph for the Walias over the Egyptians in over thirty years. \n\n\n\nIt is difficult to articulate how much the odds were stacked against Ethiopia to win this match. Prior to this game, the Egyptian National Team had a head-to-head record of 11 games won,  2 drawn, and 2 lost against the Walias.  This gulf in quality is clear to see when looking at the FIFA World Rankings, with almost a hundred spots separating the two nations, Egypt sits in 32nd place while Ethiopia is ranked 140th in the world. To make things even more challenging for Ethiopia, the Walias had already had a poor start to their qualifying campaign, arguably losing what would be one of their more winnable games in the group in the game against Malawi. The Walias could not even depend on home advantage against the Pharaohs as they were forced to play in Malawi due to all Ethiopian stadiums now lacking the appropriate CAF accreditation.\n\n![](/images/uploads/img-20220610-wa0004.jpg)\n\nWubetu Abate made two changes to the side that started in the Malawi loss, with Mesud Mohammed and Surafel Dagnatchew making way for Gatoch Panom and Shimelis Bekele. Gatoch Panom made his way into the starting lineup for his first competitive start under Wubetu Abate. Panom joined Amanuel Yohannes in a defensive midfield role, with the two shielding the defense while Shimelis joined the attack further up the pitch.\n\n\n\nShimelis, who plies his trade in Egypt, was one of the biggest thorns on the Egyptian side on the day. He showed this threat early on as well worked interplay between him and Abubekir Nassir led to a chance for him inside the box in the 6th minute. Egypt’s defense looked particularly susceptible to counter attacks as was evidenced by the first goal they conceded. It was telling that at the moment when a through ball was threaded to one of Ethiopia’s most dangerous players Abubekir Nassir, many of Egypt's players elected to stay in the Ethiopian half, with only five Egyptian players defending in their half compared to Ethiopia’s four offensive players. This allowed Abubekir (who had drifted to the right) to easily isolate and get past Mahmoud Alaa before cutting the ball back to Dawa Hotessa. Hotessa’s connection was fortunately unknowingly redirected away from keeper Abou Gabal by Omar Gaber for the first Ethiopian goal.\n\n![](/images/uploads/287255197_2244969219018009_3864292097331100761_n.jpg)\n\n> (Image Source: EFF)\n\nEthiopia nearly immediately doubled the scoreline not long after this as Egypt’s extremely high line (with both center backs nearly at the halfway line) allowed Amanuel Gebremichael to thread a lovely through ball for an Abubekir run initiated from his own half. Nassir had the defenders beat for pace and looked in control of the one-on-one with the keeper. His shot, however, was agonizingly kept out by the inside of the post in the 23rd minute.\n\n\n\nNassir had thought he finally had gotten his goal in the 34th minute as he got on the end of a deft cross from the right via Shemelis Bekele and put it into the back of the net. The linesman deemed that Bekele had strayed offside in the buildup of the goal.It was not long before Ethiopia doubled their lead, a longball from Mignot Debebe deep in his own half initiated the move in the 39th minute. Amanuel Gebremichael continued his creative streak as it was his through ball that allowed Shimelis Bekele to smash the ball into the back of the net for Ethiopia’s second.\n\n![](/images/uploads/287192418_2244969332351331_6397360999936679922_n.jpg)\n\n> (Image Source: EFF)\n\nEthiopia did not relent after the second goal either, and Egypt and its highline could simply not handle the through balls to the pacy Gebremichael and Nassir causing problems in the latter stages of the first half. With Egyptian coach Ehab Ghalal so dissatisfied with the first-half performance that he brought on three substitutes before the half had even ended.  The game did slow down in the second half, although this is a reflection of Ethiopia’s ability to manage the game after solidifying a two-goal cushion as well as Egypt’s lack of firepower to take the game to the Walias. Egypt rarely threatened the Ethiopian final third throughout the game with the only notable chance that the Pharaohs had coming in the 87th minute with one of Egypt’s substitutes, Omar Kamal, attempting a decent shot from outside the box which just curled wide of the goal.\n\n\n\nThis win will come as a welcome boost for the Ethiopian National team and its supporters as the team has been on a lengthy winless run. It is fair to say that the reception in the Egyptian camp has been one of utter shock at the dismal showing from the national team in Malawi. Egyptian head coach Ehab Ghalal explained to the media that his team's performance was partly down to weather conditions as well as the need to adjust to a new system of football. The Egyptian FA, who hired Galal following the dismissal of Carlos Queiroz after failing to win the 2021 AFCON final, held an urgent meeting after the game. Ethiopia now sit top of  Group D on goal difference with the group finely poised with all teams on three points. Ethiopia’s next match will be against a tough Guinea side, while Egypt will face a Malawi side that have shown that they are not push overs at last year's AFCON.",
  "title": "Pharaohs Outclassed by Embattled Ethiopian Side",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "thumbnail": "/images/uploads/img-20220610-wa0001-1-.jpg",
  "slug": "pharaohs-outclassed-by-embattled-ethiopian-side"
}