{
  "layout": "blog",
  "date": "2022-01-14T05:14:36.158Z",
  "body": "> *(Image: Liewig Christian/Corbis via Getty Images)*\n\nSo, this is love, at times brutally honest in exposing one’s weakness to the world.  The Indomitable Lions gave the Walias no chance as soon as the whistle blast to start the second half was heard. Cameroon came out looking to grab control of what up until that point been an evenly balanced match. Ethiopia had started the game in magnificent fashion. Those four-minutes of bliss were felt all around the world by everyone who affiliates themselves with the national team’s fanbase.\n\nThis time around, I wasn’t in Washington DC, so the feeling of being even further from home felt even deeper. I jumped up and shouted when Dawa Hotessa exquisitely redirected a precision pass from Amanuel Gebremichael. I was looking pretty crazy to the group of people who had no idea what was taking place. The perfect start, my heart was racing. The game plan that Coach Wubetu Abate had chosen to pursue, appeared to be a masterstroke. The front three speed demons were going to be crucial in putting the lion’s defense under pressure.\n\n![](/images/uploads/brief.jpg)\n\n> *The Ethiopian fan contingent at the Olembe Stadium celebrates Ethiopia's taking of an early lead (Image: Bein Sports)*\n\nHowever, that joy was taken away quickly. Defensive calamity in the Ethiopian final third gifted the Cameroonians the chance to draw level within moments of conceding. Our chronic inability to control the flow in the heat of the moment and act accordingly failed us yet again.\n\nWe saw this in the first game against Cape Verde, and it was evident last night in each and everyone of Cameroon’s goals. There are a whole lot of unwritten rules in football, among those one of them is you’re most vulnerable to concede goals immediately after scoring. This rule applies everywhere, whether it’s pick up footy with the neighbour’s kid in your backyard, whether it’s Sunday league action, or even on football’s biggest stage.\n\nDespite conceding, Ethiopia spent the rest of the half going toe to toe, which was quite frankly the best I have seen the national team play in a long time. There were moments where had the players been slightly more clinical, we could have gone into the half with a priceless lead.\n\nWhat took place after the break was quite simply a massacre, the brutal exposure of one’s core weakness. Cameroon kept on hammering away and had wrapped it all up by the hour mark, leaving fans like myself who were given reason to dream at the halfway mark, stunned and left in total disbelief.\n\nFor the next half hour of play, tactics were changed, substitutions were made in an attempt at damage control. The television broadcast commentator continuously reminded viewers of Ethiopia’s footballing shortcomings and was backed by the camera crew which repeatedly beamed images of crestfallen Ethiopian fans and bewildered looking Ethiopian players on the bench for millions around the world to gaze at.\n\n![](/images/uploads/defeatplayers.jpg)\n\n> *Ethiopian players Bezabeh Meleyo, Ahmed Rashid, Suleman Hamid and Firew Solomon trudge off the pitch after last night's 4-1 defeat to Cameroon (Image: KENZO TRIBOUILLARD/AFP via Getty Images)*\n\nI’ve spent my whole life watching the beautiful game and it was the hardest thirty minutes I had to sit through. As painful as it was, I’m still happy I stuck through to the tail end. Despite defeat, the Walias have come a long way. The gate has been opened again, this time let’s not let it close back on us.\n\nWhen football teams in the world suffer stunning defeats, the question that often follows is how will deflated players rebound from painful on field setbacks. Our players owe it to themselves to make amends and make this day right before the end of their careers.\n\nAs far as us fans are concerned, we will go at it again. The road to football glory is fraught with ups and downs. The national team needs its true fans now more than ever, especially if we are keen on changing history and rewriting everything that has been said about Ethiopian football, for decades. As far as I know, I still won’t miss a minute of national team football no matter what the stage. The revolution will be televised!\n\nUntil we meet again.",
  "thumbnail": "/images/uploads/fans.jpg",
  "title": "Fan's corner: Through thick and thin, stick with the Walias",
  "slug": "robel-moges-cameroon-oped",
  "author": "Robel Moges"
}