{
  "layout": "blog",
  "date": "2022-01-26T01:55:05.445Z",
  "body": ">  *(Image: PIUS UTOMI EKPEI/AFP via Getty Images)*\n\nI hope you weren’t expecting me, I do this a lot where I take time to reflect instead of giving hot takes. Listen the African Cup of Nations flew us by simple as that. Ethiopia looked timid, taken by the occasion, and above all we kept repeating the same old mistakes the team has become renowned for, on the biggest stage.\n\nPart of me wanted to present excuses for Yared Baye’s obvious red card in the first eleven minutes of the opening game against Cape Verde. At ten men, it was always going to be an uphill battle for any team in the world. The second game against the hosts Cameroon started magically, like those out of body moments we’ve all felt. A bell has rang (ዳዋ ተደወለ) in the fourth minute. Mind you, in all three games, the Walias were without their engine man, Shemeles Bekele renowned for connecting the team’s play in the midfield. Beyond his experience of playing at the highest level, his depth touches have been crucial to the flow of our game. It certainly hurt Shemeles to miss out on the entire AFCON. For Ethiopians, major tournament appearances don’t come very often.\n\nAs someone who went into these games with a high expectation of seizing the moment, I was surprised how shell shocked the players looked throughout them three games. I am okay with taking a loss if the team is way below par. If you don’t earn the right to share the pitch then you don’t win.\n\nWhat irritates fans is when your team lets its fans down by consistently making backyard football mistakes on the global stage. This cost blood and tears, literally. This is where you keep it simple and professional. If anyone needed a preview of how the Video Assistance Referee (VAR) was going to play a role in this tournament, it was laid bare beautifully in the tenth minute.\n\nYared commits a foul, the referee gives a free kick. Cape Verde’s players got on his face and coerced him to show Yared the yellow card along with the free kick. As the Cape Verde players positioned themselves for the set piece, the ref was summoned to the VAR monitor because there was more to the foul than what met the eye.\n\nThat yellow became a red card. Yared was off, Ethiopia were down to ten men, and panic set in from which the players didn’t recover from. You needed your leaders to take the game into half time even. Tournaments can be turned on their heads within moments. You don’t have thirty eight tries to make it right. I am known to criticize coaches when needed and to applaud them when its deserved. Coach Wubetu Abate let this glorious opportunity pass him by. Greats are moulded by experience. I look forward to seeing him using it to elevate the team. A tournament that has passed you by doesn’t mean a tournament forgotten. Ups and downs are expected to fuel the foundation which which future teams can be built.\n\nLife is bigger than football because of its realities, but I would like to exist in one that has Ethiopia returning to AFCONs with regularity.\n\nUntil we meet again.",
  "thumbnail": "/images/uploads/gettyimages-1237788030-1024x1024.jpg",
  "title": "Fan's corner: Experience can be foundation for future AFCON showings",
  "slug": "robel-oped-experience-afcon",
  "author": "Robel Moges"
}