{
  "layout": "blog",
  "date": "2022-02-05T08:12:30.547Z",
  "body": "> *(Image: Goal.com)*\n\nHello again. Listen the African Cup of Nations I had hoped for didn’t happen, but one of my expectations was met in an instance, in the sealing of [Abubeker Nasir’s transfer abroad.](https://www.bluenilesport.com/articles/abubeker-nasir-signs-mamelodi-sundowns)\n\nTeams are made of individuals that will define its direction moving forward. The moment I laid my eyes upon this individual nicknamed “Abuki” I knew the kid had the sauce. He is the type of player that needs proper guidance and a stronger team to further develop his game.\n\nYou want a glimpse of his brilliance, get this, in the first season of the BetKing Ethiopian Premier league’s DSTV broadcast deal, a twenty-year-old Abubeker Nasir broke the record for number of goals scored in a single league campaign.\n\nNot to be historical, but this league has been around for a long time. You aren’t supposed to shatter records like that as a 20 year old bursting into the scene. On top of that he was a core component of the team that sealed AFCON qualification, ending a decade in the major international tournament wilderness. The window of opportunity presented itself at the AFCON in Cameroon, [and he grabbed it](https://www.bluenilesport.com/articles/abubeker-nasser-shines-afcon).\n\nAn unknown 20-year-old walking into to one of the biggest teams in the continent is a big deal, especially for Ethiopia. As a die-hard fan of Ethiopian Football, I want a continuation of major tournament appearances, regardless of whether or not we escape the group stage once there.\n\nBut qualifying then disappearing for years will only indicate failure from within. This country has produced, is producing and continues to produce talented players. How the system raises them and brings them into the spotlight will be crucial in this new chapter we are entering. The frustration of the past must be replaced by a hopeful future, in order to do so an individual must be able to develop into an integral part of a team. The future of team Ethiopia looks bright and Abuki being the poster child of this change fuels the hope inside all of us who are avid about the path forward for Ethiopian Football.\n\nEthiopian football fans will tell you that Abuki has brought that football fever that kids around the block feel in the midst of the AFCON. One of my memorable moments of AFCON ’21 was seeing young kids don Abubeker’s number ten shirt of the newly released national team jersey.\n\nThe long road ahead requires daily forward steps. The player has taken his first stride and the reward has arrived now it’s up to him and his new mentors to enhance his game.\n\nThe sweetness of the deal is that he will be loaned back to Ethiopian Coffee for the remainder of the season. Ethiopian league fans will have a chance to enjoy his talent once more. For us to move forward and become competitors the success of this move and adjustment in other areas are crucial. Rome wasn’t built in a day, nor will Ethiopia become a major force in the continent overnight.\n\nUntil we meet.",
  "thumbnail": "/images/uploads/b21kkmn1706.jpg",
  "author": "Robel Moges",
  "title": "Fan's corner: Abubeker Nasir's move sign of great things to come",
  "slug": "robel-moges-oped-abubeker-nasir-mamelodi"
}