{
  "layout": "blog",
  "date": "2022-05-26T02:02:20.952Z",
  "body": "> *(Image: Ethiopian Premier League Share Company)*\n\nFasil Kenema denied Saint George the chance of making Ethiopian Premier League history as a narrow 1-0 victory on Sunday meant that Saint George’s 24-match unbeaten run came to an end. Saint George kicked off the match at Bahir Dar Stadium with only six games remaining to go a full season unbeaten.\n\n.\n\n\n\nSaint George were favorites going into the match as they had thumped Fasil in the reverse fixture 4-0 and were comfortably sitting in first place in the Ethiopian Premier League table. Fasil Kenema were also in good form as of late as well, being undefeated in six games after replacing Head Coach Seyoum Kebede with his assistant Hailu Negash. The importance of the match was made more evident with the raucous atmosphere set by the fans, which was only heightened by an early goal in the fifth minute. Okiki Afobali received a lobbed ball from Amsalu Tilahun and converted it to the back of the net with a superb strike to bring his season total to eight goals.\n\n\n\n![](/images/uploads/fasilsaint.jpg)\n\n\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nBoth teams attempted to test the opposition’s defense following this opening goal, but the only other dangerous opportunity in the first thirty minutes arrived in the 29th minute with Saint George right back Sulieman Hamid inadvertently testing Fasil Goalkeeper Michael Samaki with what seemed to have been a mishit cross. The Fasil keeper made a mess of this as his suspect positioning and misjudgment of the ball’s trajectory nearly led to the ball dropping into the back of his net, luckily for him, the ball went past the post by a whisker.\n\n\n\nSaint George attempted to breach the Emperor’s defensive lines primarily through combination play using the width of the pitch. The Horsemen were frustrated with Fasil’s well-organized defense, however, with Fasil defending their box well while exploiting spaces in behind Saint George defense via counters.\n\n\n\nOne of these dangerous counters arrived in the 41st minute. Okiki Afolabi received a long-range cross from outside the box, and shrugged off his marker Frimpong Mensu to take a shot. This shot was blocked by the combined efforts of Mignot Debebe and Saint George Goalkeeper Lukwago. Afolabi claimed to have been cut down by Saint George's keeper but any shouts for a penalty fell on deaf ears as the referee waved away any claims of a potential foul inside the box.\n\n![](/images/uploads/fasilsaint3.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nHalf-time substitutes Canaan Markneh and Abel Yalew added more bite to Saint George’s attacking play after the break but their efforts were not enough to get Saint George on the scoreboard. As the clock started to wind down to the final whistle The Horsemen upped the tempo in an attempt to get an equalizer. It was an off day for Saint George however, with the league’s top scorers not managing to land a single shot on target. The most threat that Fasil’s lead faced in the second half was due to Samake missing the ball when came off his line to punch a cross away in the 76th minute, Yared Baye was there to clear the shot for Fasil however.\n\n\n\nThe final whistle from referee Asheber Seboka was a relief to Fasil Kenema fans who traveled in big numbers from neighboring city Gonder. Saint George are still at the top of the league with 54 points, but the Emperors have made the Premier League Title chase interesting with them now being in second place with 49 points, cutting the gap between the top two sides to five points.",
  "title": "Saint George Lose Their Invincible Status to Resolute Emperors",
  "author": "Ebawak Tesfaye @negussu_",
  "thumbnail": "/images/uploads/fasilsaint2.jpg",
  "slug": "saint-george-lose-their-invincible-status-to-resolute-emperors"
}