{
  "layout": "blog",
  "date": "2022-07-04T22:58:21.242Z",
  "title": "Saint George Win their First League Title Since 2017 While Dire Dawa Escape Relegation in Action-Packed Final Matchweek",
  "slug": "saint-george-win-their-first-league-title-since-2017-while-dire-dawa-escape-relegation-in-action-packed-final-matchweek",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "thumbnail": "/images/uploads/saint-george-champs2.jpg",
  "body": "> *(Image: Ethiopian Premier League Share Company)*\n\nSaint George secured their 15th league title as they defeated Addis Ababa City 4-0. Ismael Ogoro has been a major part of Saint George’s season, as he provided a plethora of goals in the first half of the season before being sidelined with an injury. It is thus fitting that it was his brace that helped Saint George to this crucial win. Addis Ababa started strongly with #29 getting a dangerous header off in the early stages of the match that required a good save by Charles Lukwago to keep it out. Saint George opened the scoring not long after as Amanuel Gebremichael laid up Ogoro who blasted his shot past the Addis keeper Daniel Teshome in the 16th minute. Saint George doubled the lead in the 53rd minute via a penalty that Ogoro scored. Addis Ababa players were incensed by the referee’s decision to award the spot-kick, but defender Lemene Tadesse did clearly tug at Ogoro’s shirt. This goal killed the game and it was all Saint George from this point onwards. Amanuel Gebremichael scored a superb solo goal in the 88th minute, as he carried the ball from the halfway line to the edge of the box before unloading a venomous strike past the keeper. Gebremichael doubled his goal tally for the day in the dying seconds of the game from a similar area as his first goal. Instead of blasting it into the back of the net, his second effort was a well-placed side-footed shot that beat Daniel Teshome at his near post. Saint George wins the league with 65 points from 30 games for a Points per Game average of 2.17. Only Fasil Kenema in the 20/21 have won the league with a better average over the past five league seasons. The league champions scored 50 goals during the course of their campaign, with the biggest goal contributors being: Ogoro with 12 goal contributions, Amanuel Gebremichael with 9 goal contributions, and  Kanan Markneh with 8 contributions. The first-half statistics show that this was a tight game with each side registering a single attempt on target and Saint George having slightly more possession. The Horsemen improved their grip on the game in the second half, especially after they scored their second goal. \n\nThis defeat coupled with Dire Dawa’s victory over Fasil Kenema means that Addis Ababa City are relegated to the second tier of Ethiopian football after one season in the Premier League. Paulos’ Addis side can take pride in the fact that they put up a good late run in an attempt to stay in the league, managing to collect nine points in five games to get out of the relegation zone before letting it slip in their final two games with losses against Sidama and Saint George. Addis Ababa also had a strong offensive line with the likes of Richmond Adongo, Fitsum Tilahun, and Endale Kebede giving Addis Ababa the fourth-best goalscoring record in the league with 38 goals scored this season.\n\n![](/images/uploads/saint-george-champions.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nMeanwhile, at Bahir Dar Stadium, Dire Dawa stayed up in the most spectacular of fashion as a Fasil Collapse from the 76th minute onwards saw Fasil blow a 2-0 lead to concede 3 in the last 14 minutes. Fasil took the lead in the first half and doubled their lead in the 61st minute via Desta Belay and Bezabih Meleyo goals. Fasil were in control of the large parts of the game but the Emperors collapsed from the 77th minute onwards as. Fasil consistently gave away the ball in their own half, easily allowed Dire Dawa to split their defense with through balls, and saw their Keeper Samake Mikel spill a ball to allow Dire Dawa three goals in the 77th, 85th, and 87th minutes.\n\n The game's final minutes have become a point of contention in the Ethiopian Football sphere as for many, the events in the closing of the game crossed the threshold of being unbelievable as many suspect that the events of the Saint George vs Addis Ababa match may have unduly affected the performance level of Fasil Kenema. The league company had passed the decision to play all relevant games at concurrent times to prevent this scenario, but news about the Saint George result may have nevertheless spread into Bahir Dar Stadium. Addis Ababa have expressed their frustrations regarding the circumstances surrounding Dire Dawa’s victory in their letter to the league company claiming that ”Our team was put in danger of relegation as a result of Fasil Kenema playing well below their standards on the day”. Investigations as to what transpired in the final matchday are expected to take place soon, with potential ramifications in regards to who gets relegated from the league this season.\n\n![](/images/uploads/fasil-vs-dire-dawa.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*"
}