{
  "layout": "blog",
  "date": "2022-02-28T02:44:07.802Z",
  "body": "> *Shimekit Gugsa celebrating his double (Image: Ethiopian Premier League Share Company)*\n\nDire Dawa City were pummeled 4-0 to Fasil City to mark a disappointing end to their home fixtures.\n\nDire Dawa City came into the match with an overhaul in attack and a 3-5-2 formation in hopes that it would help the team bounce back from a disappointing defeat to Adama City. Mohammed Abdulletif was deployed as left-wing-back whereas Samuel Zerihun and Eyob Ayele were given the opportunity to lead the attack in place of veterans Mamadou Sidibe and Muhedin Musa. There were also changes for Fasil with Yidnekatchew Kidane coming in for main keeper Samake. Surafel Dagnatchew was also ruled out with Habtamu Tekeste returning in the midfield to fill this hole.\n\n\n\nThe first ten minutes were positive for Dire Dawa, as the team showed hunger in their pressing and got on the end of many second balls. All of this culminated in a huge chance for Dire Dawa to take the lead via an Ayele through ball, Samuel Zerihun could not take advantage of this ball when he failed to keep track of the ball and could not get a shot off in time.\n\n\n\nFasil grew into the game after a cagey first fifteen minutes. It was Shimket Gugsa who scored the opener after a clever chip arrived from the left-half space via Belay Desta. Desta’s pass left Gugsa one-on-one with Dire's second choice keeper Dereje Alemu. A flick from Gugsa was enough to put the ball in the back of the net.\n\n\n\nSome of Dire Dawa’s flaws against Adama City reemerged in the twenty-fourth minute when Dire Dawa’s defenders left huge gaps between them. This allowed Gugsa to find Afolabi's run on the right. Afolabi squared it to Desta who should have made it two but his shot was hit right at keeper Alemu.\n\nDire fans will have felt a sense of Deja Vu for the third Fasil goal as it was a result of a keeper coming off of his line unsuccessfully yet again. It was Afolabi who was able to take advantage of Dire Goalie Alemu being stranded in no man's land to get the long ball past the keeper and slot the ball into an empty net.\n\nGugsa got his second and Fasil’s third goal as a result of good passing interplay that culminated in a cutback from Alembirhan Yigzaw to Gugsa,  whose powerful shot gave the keeper no chance. The last goal came from a moment of individual brilliance from Bereket Desta who took out two players with his dribbling before smashing the ball over Dire keeper Alemu from what seemed an improbable angle.\n\n\n\nFasil were extremely lucky not to see their clean sheet wiped out in the eighty-fifth minute when a Dire Dawa freekick saw Muhedin Musa get a good connection for his header. Yidnekatchew Kidane made a good save to deny the substitute.\n\n![](/images/uploads/dire-fans.jpg)\n\n> Dire Dawa city fans watch their side play their last home game *(Image: Ethiopian Premier League Share Company)*\n\nThe win ends a three-game winless streak for Fasil Kenema. Brook Desta has been the breakout star for Fasil this season, becoming the joint top goal contributor (with nine) in the league after his goal and assist today. Dire Dawa on the other hand have collected just two points from their last five games, which is even more concerning given all those games were played with home advantage. Dire fans will have to hope that their team thrives playing at away grounds if they are to avoid relegation.\n\n\n\n<!--EndFragment-->",
  "thumbnail": "/images/uploads/fasil-gugsa2.jpg",
  "title": "Shimekit Double Sinks Demoralized Dire Dawa",
  "slug": "shimekit-double-sinks-demoralized-dire-dawa",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3"
}