{
  "layout": "blog",
  "date": "2022-02-08T04:01:38.712Z",
  "body": "> *Habib Kemal celebrates scoring the equalizer for Arba Minch (Image: Ethiopian Premier League Share Company)*\n\n\n\nSidama Coffee and Arba Minch shared the spoils on the final matchday of the BetKing Ethiopian Premier League’s 13th round. Sidama Bunna were punished for not finishing the plethora of chances they created, with Arba Minch holding on for a point at Dire Dawa Stadium.\n\n \n\nThis southern derby was not too long ago dominated by Arba Minch, with them winning two and drawing two of the games between the two sides since the 2016/17 season. Arba Minch has only won two games this season, they will have been looking to break their trend of drawing games as five of their games had ended in ties. Sidama Coffee seems to have hit their stride after the start of the round in Dire Dawa with two wins after a wobbly start that saw them only pick up eight points from a possible twenty four.\n\n \n\nIt was all Sidama on the day with Gebremedhin Haile’s side being able to control the game through a 4-3-3 formation which allowed them to outnumber Arba Minch’s two-man midfield . Sidama was rewarded for this pressure in the thirty seventh minute when a brilliant through ball by number nine Habtamu Gezahegn from his own half reached Yegezu Bogale who lifted up the ball past the keeper for the first goal.\n\n \n\nSidama continued to control the game going into the second half, and it was Yegezu Bogale again who threatened, getting on the end of a well placed diagonal ball which Firew Solomon launched from his own half. Luckily for Arba Minch, Bogale’s attempt to curl the ball was scuffed and the Keeper was able to collect the ball.\n\n \n\nArba Minch at times were guilty of leaving wide gaps between the midfield and the back four, they were almost punished for this when Habtamu Gezahegn had all the time in the world to take a shot from outside of the box. Fortunately for the crocodiles, the shot fell straight at the keeper. Habtamu nearly made up for this miss with an interception from his own half which led to a one-on-one with the keeper as a result of his brilliant run. Unfortunately for him, his shot hit the far post.\n\n \n\nIn the end, it was a goal of the season contender that equalized the score for Arba Minch, with substitute Habib Kemal curling a free kick to the top right corner of the goal. It was an intense game for the substitute, as he’d later be given his marching orders for a second yellow card for a rash two footed challenge which could have easily been a red on its own.\n\n \n\nThe result sees Arba Minch drop one spot to thirteenth while Sidama overtakes Bahir Dar to seventh place.",
  "title": "\"Southern Derby\" ends in draw",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "slug": "southern-derby-draw-sidama-arba-minch-round-thirteen",
  "thumbnail": "/images/uploads/273474079_470620877928763_1299834762891918630_n.jpg"
}