{
  "layout": "blog",
  "date": "2022-01-30T04:18:25.232Z",
  "body": "> *(Image: Ethiopian Premier League Share Company)*\n\nIn BetKing Premier League action today, St. George emerged victorious in the highly anticipated top of the table clash, thumping defending champions Fasil Kenema 4-0 at Dire Dawa Stadium to leapfrog them into first place. A brace from striker Abel Yalew in the first half and another brace in the second half from Togolese striker Ismail Ouro-Agoro put daylight between the two sides and propelled the Horsemen to the summit of the league.\n\n \n\nIt was the Horsemen who started the game on the front foot and their pressure was rewarded early on with a goal in the tenth minute. A counterattack saw Abel Yalew latch on to a ball from Amanuel Gebremichael, and Abel, among the national team members cut from the flight to the African Cup of Nations, fired home past N'Tji Michel Samaké in the Fasil goal.\n\n \n\nAbel Yalew began the play that saw him seal his brace by robbing Fasil defender Yared Baye of the ball. Ouro-Agoro sent him clear on goal and Abel slotted home from a similar position in the 38th minute, to give St. George a commanding lead and perhaps show national team Coach Wubetu Abate what he had missed out on in Cameroon.\n\n \n\nFasil Kenema Coach Seyoum Kebede regrouped, and his players began the second half far more improved, but unable to penetrate the St. George back line. Fasil conceded a third just past the hour mark, when Ouro-Agoro tapped the ball into an empty net, after Chernet Gugsa’s attempted finish came off the upright.\n\n \n\nWith a minute to go in regulation time, Surafel Dagnachew nearly got a scorcher of a consolation goal, crashing the crossbar with a swerving freekick that left St. George keeper Charles Lukwago a spectator.\n\n \n\nBut it was a night to forget for Fasil Kenema’s and the national team’s starting central defensive pair. Aschalew Tamene capped off his night with a headed pass towards his goalkeeper in injury time, which was easily intercepted by Ouro-Agoro who put it beyond Samaké for his seventh goal of the league campaign. Through balls left Aschalew and Yared repeatedly exposed, and their decision making, both as a pair and individually, was questionable all night.\n\n \n\nIsmail Ouro-Agoro’s second goal on the night saw him surpass Yegezu Bogale’s [six goal haul](https://www.bluenilesport.com/articles/sidama-coffee-bahir-dar-kenema-betking-week-ten) and become the league’s leading scorer. It was a marvellous performance from St. George who remain undefeated in the league and are atop the league with twenty points, two more than the defending champions.",
  "title": "St. George top of the league after 4-0 thumping of Fasil Kenema",
  "slug": "stgeorge-defeat-fasil-kenema-betking-premier-league-abel-yalew",
  "author": "Natnael Muluneh",
  "thumbnail": "/images/uploads/stgfasil.jpg"
}