{
  "layout": "blog",
  "date": "2022-09-30T03:19:56.358Z",
  "title": "The BETKING Ethiopian Premier League returns for the 2022/23 season this weekend",
  "slug": "the-betking-ethiopian-premier-league-returns-for-the-202223-season-this-weekend",
  "author": "Ebawak Tesfaye @negussu_",
  "thumbnail": "/images/uploads/img-20220929-wa0000.jpg",
  "body": "<!--StartFragment-->\n\nThe Ethiopian Premier League returns this weekend for what will hopefully be another season filled with twists and turns. The competition kicks off on Friday, September 29 with two matches (Wolkite vs Arba Minch and Bahirdar vs Ethio Electric). The league was competitive last season, with the fights for the championship and relegation being decided on the final day of the previous season. Saint George won the league with four points, closely followed by Fasil Kenema. Sidama City, Wolayita City, Hawassa City, and Ethiopian Coffee will try to break into what was a two-horse title race last season.\n\nArbaminch, who had a quiet transfer window, will look to capitalize on their solid performances last season, which kept them in the league after achieving promotion the year before. These aspirations will be put to the test on the opening day when they face Wolkite who finished two points behind them. Wolkite have in contrast been very busy in the transfer market, with more than ten new players joining the squad under new head coach Gebrekristos Birara. \n\n![](/images/uploads/img-20220929-wa0001.jpg)\n\n> (﻿Source: Supersport)\n\nThe second match of the opening day will see the host city team Bahirdar face freshly promoted Ethio-Electric. Bahir Dar coach Abraham Mebrahtu has rebuilt his backroom staff and will aim to do much better than their poor showing last season. Ethio Electric, two-time Premier League champions, have returned to the league after a four-year sabbatical. Electric is one of Ethiopia's most historically decorated teams, with the club having the distinction of producing league-record goal scorer Yordannos Abay. The club will have much less lofty goals for this season, however, with the aim being to avoid relegation."
}