{
  "layout": "blog",
  "date": "2022-05-22T03:20:34.276Z",
  "body": "\n\n> (Image Source: Getty Images)\n\nWubetu Abate has named a squad of 28 players who will report to Jupiter Addis on May 23 to begin training ahead of matches against Malawi on June 2 and Egypt on June 9 at Bingu National Stadium (BNS) in Lilongwe, Malawi. Following CAF's decision to prohibit Ethiopia from hosting international matches, the Ethiopian National Team will remain in the country to meet Egypt on June 9 for what will be considered their home tie.\n\n![](/images/uploads/img-20220522-wa0007.jpg)\n\n> (Image Source: EFF)\n\nSince October 2021, Bahir Dar and Addis Ababa stadiums have been barred from hosting international matches. Ethiopia is one of twenty countries that have had their stadiums fail to meet CAF's \"minimum stadium requirements.\" As a result, Ethiopia will have to play away from home and will be forced to forego vital foreign exchange revenue in order to secure a suitable venue for its qualification games. As a response,  the Ethiopian Football Federation has sent a request to Malawi's Football Association to use Bingu National Stadium (BNS) as an alternate home venue for Ethiopia’s next AFCON qualifiers in June. Ethiopia's request was granted by Raul Chipendo, CAF's Developmental Director, in April. This stadium situation was a major blow to the Walias as home form was important in their qualification to the last AFCON tournament, with Ethiopia winning all three home games and losing every away game.\n\n\n\n## Squad Preview\n\n \n\nWubetu’s aim of achieving back-to-back AFCON qualifications for the first time in four decades will be tested as his side will be without home advantage for the foreseeable future. Getaneh Kebede, a seasoned striker, and the former captain is left out of the squad, in what is sure to be a polarizing decision. Kebede was also left out for a March friendly against Comoros but had since picked up form in the second half of the Ethiopian Premier League season, scoring eight of his twelve goals in this period to become one of the top scorers in the league. Abubaker Nassir, who has been in good form after a difficult start to the season, will presumably lead the line, with Dawa Hotessa and Amanuel Gebremichael providing width on the flanks. Abubaker (11G+4A), Amanuel (3G+3A), and Dawa (5G+1A) have combined for 19 goals. Yegezu Bogale, the topscorer in the BetKing Ethiopian Premier League, will join Habtamu Tadesse to complete the forward selection. \n\n![](/images/uploads/img-20220522-wa0004.jpg)\n\nIn the midfield, Bereket Desta, Biniyam Belay, and Wondemagegn Hailu have been included in the squad after stellar performances this season. Gatoch Panom, who has been underutilized by Wubetu, has forced his way into the roster; whether Webetu will give Gatoch minutes remains to be seen, as he was the only outfield player who did not play in Cameroon. Chernet Gugsa of Saint George will also battle for minutes in place of his brother Shemeket Gugsa, who did not make the shortlist.\n\n\n\nWubetu Abate has elected to not select any foreign-based players with the exception of the National Team’s new captain Shemelis Bekele. Mesud Mohammed also rejoins the squad after missing the friendly against Comoros, with Wubetu electing to include veterans who will provide valuable experience to this young side. Saint George, who are in dominant form in the domestic league, eight points clear and unbeaten in the season so far, have the most players selected for the National Team with six. \n\n\n\n## Group Preview \n\n\n\nEthiopia has been allocated to Group D for the qualification for next year’s AFCON in Côte d'Ivoire. The draw, which took place in April pitted the Walias against Egypt, Guinea, and Malawi in the qualifying group.\n\n\n\nAll four national teams in the group featured in the most recent African Cup of Nations, with Ethiopia being the only team to not advance past the group stage in Cameroon. Guinea and Malawi's run ended in the round of sixteen, while Egypt reached the final before losing to Senegal on penalties.\n\n\n\nMalawi, dubbed \"The Flames,\" lit the AFCON alight after getting past the group stages as one of the four best third-place teams with four points. The Walias have played their CECAFA rivals, Malawi, 12 times, winning on three and drawing on six occasions with Ethiopia winning the most recent meeting between the two in a March 2021 friendly match with an overwhelming 4-0 margin on home soil. This is the second time the two countries have been drawn into the same AFCON qualification group. The qualification for the 2015 AFCON in Equatorial Guinea saw the Walias settle for a goalless draw at home against The Flames, while Malawi won a slender 3-2 victory at home to finish third ahead of Ethiopia.\n\n\n\nAhead of AFCON 2022, Malawi’s FA made the peculiar decision to hand over coaching duties from local coach Meck Mwase, who had led them to qualify for AFCON 2022, to then Technical Director Mario Marinica for the duration of the AFCON tournament.  The intention was to hand the position back to Mwase after the tournament, however, a mixture of an impressive AFCON campaign for Marinica as well as a disappointing World Cup Qualifying campaign for Mwase, led to the decision to hand over the head coach position back to the Romanian Marinica on a full-time basis.\n\n![](/images/uploads/malawint.jpg)\n\n> (Image Source: fam.mw)\n\nThe second match, The Nile derby, will be a highly anticipated game between Ethiopia and Egypt, two North-Eastern African rivals. It will be a contest between two countries with a long-standing historical and political rivalry. In 1957, Egypt, Ethiopia, and Sudan founded and competed in the first-ever African Nations Cup. The trio have all won the coveted trophy, but Egypt’s accomplishments in this competition towers over the others as they are seven-time winners, while Ethiopia and Sudan have each only won once. The Walias, then captained by Luciano Vasallo, etched their mark in history by defeating Egypt 4-2 in the 3rd AFCON final on home soil in 1964, securing Ethiopia's sole major tournament triumph. Egypt have appointed Ehab Galal as their head coach after a disappointing World Cup qualification campaign saw Carols Queiroz’s departure. Galal is scheduled to make his first appearance with the Pharaohs in the qualifiers against Guinea.   \n\n  \n\n![](/images/uploads/egyptnt.jpg)\n\n> (Image Source: egyptindependent.com)\n\n\n\n## Ethiopian National Team Squad List:\n\n## Goalkeepers \n\n\n\nFasil Gebremicheal (Bahir Dar City)\n\nBerket Amare (Ethiopia Coffee)\n\nDagem Tefera (Hawassa City)\n\nSeid Habtamu (Wolkite Kenema)\n\n\n\n## Defenders\n\n\n\nAsrat Tunjo (Ethiopia Coffee)\n\nRamadan Yusuf (Wolkite Kenema)\n\nHenoke Adugna (Saint George)\n\nSuleman Hamid (Saint George)\n\nBirhanu Bekele (Hadiya Hossana)\n\nMegnot Debebe (Saint George)\n\nYared Baye (Fasil Kenema)\n\nGit Gatkut (Sidama Coffee)\n\nMillion Solomon (Adama City)\n\n\n\n## Midfielders\n\n\n\nAmmanuel Yohannes (Ethiopia Coffee)\n\nGatoch Panom (Saint George)\n\nSurafel Dagnachew (Fasil Kenema)\n\nBezabeh Meleyo (Fasil Kenema)\n\nMesoud Mohammed (Jimma Abba Jifar)\n\nBiniyam belay (Defense Force)\n\nWendemagegn Hailu (Hawassa City)\n\nShemeles Bekele (El Gouna FC)\n\n\n\n## Forwards\n\n\n\nAmanuel Gebremicheal (Saint George)\n\nChernet Gugsa (Saint George)\n\nDawa Hotessa (Adama City)\n\nBereket Desta (Fasil Kenema)\n\nAbubeker Nassir (Ethiopia Coffee)\n\nYegezu Bogale (Sidama Coffee)\n\nHabtamu Tadesse (Hadiya Hossana)",
  "title": "The Walias Unveil Squad List for Upcoming Qualifiers",
  "author": "Ebawak Tesfaye @negussu_",
  "slug": "the-walias-unveil-squad-list-for-upcoming-qualifiers",
  "thumbnail": "/images/uploads/img-20220522-wa0008.jpg"
}