{
  "layout": "blog",
  "date": "2022-01-12T08:12:29.966Z",
  "body": "We haven’t met yet, but I’m the kind of man who would use football to tell you everything and anything about life. I could probably even cite the reasoning behind why football never took off in America until recently. My findings might surprise you.\n\nAs a nineties’ baby in Ethiopia, I grew up consuming football daily either through television broadcasts at home or in the neighborhood, wherever those who could afford the costly South African broadcaster DSTV subscription that featured top European games, could be found. Growing up, I used football slang with regularity. Football matches became anecdotes with which I remembered crucial dates in history over the course of my life. For instance, a significant amount of people in the world, in particular those who reside in the United States remember September 11th 2001. So do I , because on that exact same date, my favorite team, English Premier League side Manchester United, were losing 3-0 at half time against Tottenham Hotspur. My team looked down and out, but in the second half, we rallied and called upon the spirit of United. The club’s never say die attitude led us to come out on top 5-3 in the end.\n\nWhen I relocated to the United States, the love and connection I had (and still have) for the beautiful game grew even further. In 2006, few American channels would broadcast European football. ESPN would show us the odd UEFA Champions League game but little else. As a student, there would be times where I’d sit at the back of the class in order to be able to stream champions league matches on my phone.\n\nAs the years went by, the one country which still refuses to refer to the sport by its proper name finally and belatedly, embraced the beautiful game. Summer world cups pile pressure on the major broadcast networks to jostle for broadcast rights and bring their “soccer” addict viewers full time football. Eventually, the likes of FOX Sports and GOL TV began airing English and Spanish football with increasing regularity.\n\nWith the next decade and a half, America’s golden era of football madness was ushered in.\n\nAs enticed as I was, I still felt a void. Reaching a stage where I began looking within, I began to wonder when the time would come where my native country would have a recognizable and competitive national team.\n\nIt was incomprehensible to me, how a country like Ethiopia, full of football fanatics and players, was never able to produce a top caliber set of players. I was caught off guard and pleasantly surprised when Ethiopia qualified for the 2013 African Cup of Nations, our first major international tournament in 31 years. I was over the moon upon realizing that the national team would be featuring at an AFCON for the first time since I was born!\n\n![](/images/uploads/gr3mgewj.jpg-medium.jpg)\n\n> Ethiopian football fans in Addis Ababa streamed into the streets on October 14th 2012 (Tikimt 4, 2005 in the Ethiopian calendar) to celebrate Ethiopia's 2-0 qualifying victory over Sudan that put the Walias into the finals of a major international tournament for the first time since 1982\n\nMy fellow Ethiopians and I sang our hearts out at a restaurant in Washington DC. Cheering louder than ever, clad in national team jerseys, I realized that this was the first time I had truly felt at home since leaving my homeland.\n\nIt was beautiful. But what I thought would be the start of a new normal, became a one time fluke and was quickly gone. Multiple coaching changes and a disrupted national team program saw the Walias return to obscurity.\n\nStill, for Ethiopian football fans, with our 2013 AFCON appearance and our journey to nearly reaching the 2014 FIFA World Cup, the 2010s will go down as one of the best decades in Ethiopian football for a long time.\n\nThe three group games in South Africa eight years ago were a blissful but fleeting moment which had me wondering if I’d ever witness anything similar again as the years went by.\n\nWith the new decade, the Ethiopian football federation made major moves to deal with its shortcomings. First, it reached an agreement with DSTV to finally give fans of our local game the change to watch live televised Ethiopian Premier League fixtures. Prominent platforms bring the spotlight and new possibilities for talented Ethiopian footballers.\n\nThe success of the behind the scenes work was evident when Ethiopia managed to qualify for the 2022 African Cup of Nations, their second major tournament berth of my generation. The exact moment the Walias were guaranteed their spot at the final tournament, I was overcome with emotion and tears. If you’re savvy with social media, you can find footage of it!\n\nNow, days away from Ethiopia’s second group fixture against the host nation Cameroon, I am excited and nervous at the same time. Football aside, we need something to bring our country together given the condition it is in.\n\nUntil we meet again.",
  "author": "Robel Moges",
  "thumbnail": "/images/uploads/2013-01-21t165419z_1807030555_gm1e91m02e301_rtrmadp_3_soccer-africa.jpg",
  "slug": "walias-fan-corner-2022-afcon",
  "title": "Fan's corner: We're back in the AFCON. Enjoy the moment!"
}