{
  "layout": "blog",
  "date": "2022-02-17T03:07:45.095Z",
  "title": "Wasteful Dire Dawa Fail to Beat Out of Form Bahir Dar",
  "slug": "wasteful-dire-dawa-fail-to-beat-out-of-form-bahir-dar",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3 ",
  "thumbnail": "/images/uploads/dire-dawa.jpg",
  "body": "\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nDire Dawa City's lack of clinical finishing cost them two points as they were held to a nil-nil draw against a Bahir Dar City side they dominated.\n\n\nBahir Dar went into the game with a renewed sense of optimism after a shaky couple of weeks with an impressive 2-0 win over an in-form Hawassa City. Dire Dawa meanwhile, were hoping for a win in order to avoid getting dragged into the relegation fight, with some of the sides lower than them such as Mekelakeya, Addis Abeba City, and Jimma Aba Jifar showing signs of improvement.\n\nBoth Abraham Mebrahtu and Caretaker coach Fuad Yusuf went into the game with 4-2-3-1 formations. Dire Dawa dominated proceedings with Bahir Dar registering only five attempts and no shots on target for the entire game.\n\nDire Dawa also produced little in the first half of the game but sprung into life after the break. Dire Dawa frequently took advantage of sloppy play in defense from Bahir Dar, with both Abdulrahman Mubarak and Henok Ayele getting interceptions right outside the Bahir Dar box. Both shots did not have enough quality to test Bahir Dar Kepper Fasil Gebremichael though. \n\nOne of the few Bahir Dar chances was created via a dangerous Abdulkerim Nikima cross from the right side which resulted in an Azene shot right outside the box which was well off the mark. \n\n![](/images/uploads/bahir-dar1.jpg)\n\n> *(Image: Ethiopian Premier League Share Company)*\n\nChances from open play dried up towards the end of the game and it was two direct free-kicks from Dire Dawa players Mamadu Sidibe in the seventy-first minute and Daniel Hailu in the ninety-third minute that caused Bahir Dar problems. The former set-piece was hit too high while the latter looked like it would sneak past Fasil Gebremichael's right and into the goal but struck the post instead.\n\nBahir Dar played the last four minutes of the game with ten men, Girma Dissasa received a second yellow after a rash tackle in the eighty-seventh minute\n\nThis result leaves Bahir Dar in very poor form, only getting four points from a possible fifteen in their last five games.  Dire Dawa are in better shape, collecting eight points from the same number of games. Some could argue, however, that this is an underperformance from Dire Dawa given the home advantage they have had for this round of the BetKing Premier League."
}