{
  "layout": "blog",
  "date": "2022-02-08T04:26:30.246Z",
  "body": "> *Addis Ababa City and former Ghanaian youth international striker Richmond Adongo (Image: Ethiopian Premier League Share Company)*\n\nA goal in the final seconds of stoppage time from Kalkidan Zelalem was enough for Wolaita Dicha to snatch all three points against Addis Ababa City in Dire Dawa stadium on Saturday.\n\n \n\nHeading into the game, Addis Ababa City were desperate for points with no wins in their last four matches and just five points from a possible fifteen. Wolaita were looking to turn their winning streak into three matches and keep up with title contenders Fasi Kenema and Saint George.\n\n \n\nAddis Ababa will feel hard done by as they were on top for most of the match, creating the most clear cut chances. Wolaita were more clinical however, creating most of their chances through direct long balls and set pieces.\n\nWolaita’s first goal came in this fashion through Anteneh Gugsa’s long ball from the halfway line making its way into the box and Sintayehu Mengistu scoring with an emphatic finish. Replays showed that Sintayehu had used his hands to control the ball and Wolaita was lucky that the goal was not chalked off.\n\n \n\nMost of the chances in the game were created by Addis Ababa City however, with Fitsum Tilahun being a revelation on the day. Tilahun was deployed in the number nine role as opposed to his usual position on the right wing, his dribbling wreaked havoc on the Wolaita defense.\n\n \n\nA highlight of his game came in the thirty ninth minute, where he took the Wolaita players out of the game through a combination of dribbling and skill, unfortunately his shot was not the cleanest and hit the far post.\n\n \n\nWhen the capital city club’s equalizer came in the 63rd minute, it was a result of Wolaita’s fixation on stopping Fitsum Tilahun. This left acres of space on the right for Asegahegn Petros to cut back to striker Richmond Adongo. The shot from Adongo was far from clean and Wolaita Keeper Wondessen Ashenafi will be disappointed to have let the ball through his legs.\n\n \n\nWolaita risked conceding a goal in a similar fashion fifteen minutes later as their defense went narrow to stop Fitsum Tilahun in the center,creating space on the right for Adongo. A combination of the unfavorable angle as well as solid keeping meant that he could not convert.\n\n \n\nIt was a set piece that ultimately decided the game, Addis cannot say they were not warned as well because Wolaita came very close to a goal in the 83rd from a Sintayehu Mengistu header after getting on the end of a free kick. Nevertheless, Addis Ababa were caught out in the 93rd minute when Kalkidan Zelalem got on the end of Addis Hintsa’s delivery with an unorthodox connection which saw the ball bobble into the net.\n\n \n\nWolaita’s favorable run continues next week, with them facing the fourteenth-placed Defence Force, whereas Addis Abeba City might also fancy their luck against an out-of-form Ethiopia Coffee.",
  "thumbnail": "/images/uploads/273401747_470035037987347_5555401136139506147_n.jpg",
  "title": "Dramatic injury time winner sees Wolaita Dicha past Addis Ababa",
  "slug": "wolaita-dicha-addis-ababa-city-round-thirteen-betking-ethiopian",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3 "
}