{
  "layout": "blog",
  "date": "2022-01-30T04:47:31.095Z",
  "body": "Wolkite came back from behind twice to secure a point against Hadiya Hossana in a four goal thriller in Dire Dawa.\n\n \n\nWolkite has been riding high this season, improving on their finish in the bottom three last season, to now sit in third place and continue to pose a serious threat to the league’s elite. Hadiya Hossana on the other hand, hoped to continue their ascent up the table following a poor start which saw them in the bottom two with 3 points from the opening 6 games. They have improved prior to the African Cup of Nations break, with three consecutive wins lifting them up to nineth place.\n\n \n\nIt was Hadiya who started strongly, playing with a very high line and pressing high up the pitch. This was rewarded in the twelfth minute when wingback Berhanu Bekele received a piercing longball from Tesfaye Alebachew. Berhanu had the composure to dribble past Wolkite fullback Ramadan Yesuf and find Fikreyesus Teklebirhan in the middle who buried the shot for his second goal of the season.\n\n \n\nWolkite did not have many chances in the first half, with Hadiya employing an effective offside trap particularly in the first twenty minutes. As such, Wolkite’s equalizer came very much against the run of play. With Getaneh Kebede’s audacious shot catching the Hadiya defense off guard and the rebound from the crossbar being easily put away by Chala Tesheta.\n\n \n\nWolkite fans will question why their side did not get a penalty in the 29th minute as Hadiya goalkeeper Mensah Nsouhoho clearly manhandled Ahmed Hussein hauling him to the ground in full view of the linesman as the two vied for an aerial ball. Apart from this, Hadiya looked more likely to score until the end of the first half with Berhanu Bekele having two chances that were not dispatched.\n\n \n\nHadiya eventually got their second as a result of some lovely passing interplay in the middle of the park led to an assist by Samson Tilahun and goal by Baye Gezahegn. Hadiya had thought they had scored their third in the 44th minute but Teklebirhan had found himself in an offside position.\n\n \n\nThe second half started the same way the first ended, with Hadiya dominance, eventually though Wolkite came back into the game after the 60th minute. Set pieces and crosses were what created the most chances from the Wolkite side and this vulnerability eventually led to the 88th minute equalizer from substitute Alazar Zewdu.\n\n \n\nHadiya Hossana manager Mulugeta Mihret appeared satisfied with the showing by his team after the long lay off.\n\n\" We had a good first half, unfortunately we retreated to our shell a bit for the second half,” he told SuperSport. “We played well considering this was the first game back from the break.”\n\n \n\nPaulos Getachew had similar comments about the disparity of performances between the halves.\n\n \n\n“Our first half performance was not good. We were unable to control the midfield. This being our first game back from the break played a factor in our slow start. I am happy with our improved second half performance. We will look to improve upon some of our defensive errors and compete for the title.”",
  "title": "Wolkite and Hadiya Share spoils in high octane match",
  "slug": "wolkite-hadiya-hossana-share-spoils-betking-premier-league-week-ten",
  "author": "Natnaiel Mulugeta @NatnaielMuluge3",
  "thumbnail": "/images/uploads/prfbscf2.jpg-large.jpg"
}