{
  "layout": "blog",
  "date": "2022-01-14T06:43:54.216Z",
  "thumbnail": "/images/uploads/wubetu-abate-1.jpg-2.jpg",
  "body": "> *(Image: Africa Top Sports)*\n\nEthiopian national team Coach Wubetu Abate says his team’s lack of experience contributed to their [collapse in the second half](https://www.bluenilesport.com/articles/ethiopia-battered-by-cameroon-afcon) of last night’s group A second round fixture with host nation Cameroon.\n\n“As you all saw, we tried to play our game, but inexperience failed us,” Wubetu told journalists at a press conference immediately following the game. “If you look at our team, almost none of my players have ever taken in a competition of this sort.”\n\nThe Walias stunned the hosts when a Dawa Hotessa redirected the ball from close range to take the lead with only four minutes on the clock. That lead only lasted moments with Karl Toko Ekambi restoring parity, his bullet header beating goalkeeper Teklemariam Shanko. And while the rest of the half appeared evenly balanced and had Ethiopian football fans hopeful of a possible upset, their team fell apart in the second half.\n\nVincent Aboubakar’s third and forth goals of the tournament put daylight between the two sides, and when Ekambi left both Ethiopian center backs on their backsides before smashing home for his brace, the painful reality of the gulf in class between the two teams set in.\n\n“Conceding four goals today definitely puts us in an unpleasant position before our next match,” Wubetu added. “But my staff and I will work to motivate the players to give it what they got (against Burkina Faso). I’m not saying we will win, but we will definitely give it our all.”\n\n![](/images/uploads/gettyimages-1237702385-2048x2048.jpg)\n\n> *Vincent Aboubakar is out of reach of Aschalew Tamene, heading home his first of the contest while a grimacing fullback Suleman Hamid looks on (Image: Ulrik Pedersen/NurPhoto via Getty Images)*\n\nBurkina Faso beat Cape Verde in the other Group A encounter, courtest of a Hassane Bande goal just before the first half. The result puts Cape Verde and Burkina Faso level on three points and on goal difference while Ethiopia remains rooted to the bottom of the group and requiring a victory over Burkina Faso and to have a chance at qualifying for the knockout stage.\n\nThe last time Ethiopia and Burkina Faso faced off was at Ethiopia’s previous AFCON appearance at South Africa 2013, in which the Stallions dismantled Coach Sewnet Bishaw’s team by a 4-0 score line.",
  "title": "Wubetu Abate blames “inexperience” for second half AFCON capitulation ",
  "slug": "wubetu-inexperience-cameroon-afcon",
  "author": "Blue Nile Sport staff"
}